RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_sdio.h
/***************************************************************************//**
 * @file
 * @brief EFM32GG11B_SDIO register and bit field definitions
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#ifdef __cplusplus
extern "C" {
#endif


#if defined(__ICCARM__)
#pragma system_include       /* Treat file as system include file. */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang system_header  /* Treat file as system include file. */
#endif

/***************************************************************************//**
 * @addtogroup Parts
 * @{
 ******************************************************************************/
/***************************************************************************//**
 * @defgroup EFM32GG11B_SDIO SDIO
 * @{
 * @brief EFM32GG11B_SDIO Register Declaration
 ******************************************************************************/
/** SDIO Register Declaration */
typedef struct {
  __IOM uint32_t SDMASYSADDR;     /**< SDMA System Address Register  */
  __IOM uint32_t BLKSIZE;         /**< Block Size and Block Count Register  */
  __IOM uint32_t CMDARG1;         /**< SD Command Argument Register  */
  __IOM uint32_t TFRMODE;         /**< Transfer Mode and Command Register  */
  __IM uint32_t  RESP0;           /**< Response0 and Response1 Register  */
  __IM uint32_t  RESP2;           /**< Response2 and Response3 Register  */
  __IM uint32_t  RESP4;           /**< Response4 and Response5 Register  */
  __IM uint32_t  RESP6;           /**< Response6 and Response7 Register  */
  __IOM uint32_t BUFDATPORT;      /**< Buffer Data Register  */
  __IM uint32_t  PRSSTAT;         /**< Present State Register  */
  __IOM uint32_t HOSTCTRL1;       /**< Host Control1, Power, Block Gap and Wakeup-up Control Register  */
  __IOM uint32_t CLOCKCTRL;       /**< Clock Control, Timeout Control and Software Register  */
  __IOM uint32_t IFCR;            /**< Normal and Error Interrupt Status Register  */
  __IOM uint32_t IFENC;           /**< Normal and Error Interrupt Status Enable Register  */
  __IOM uint32_t IEN;             /**< Normal and Error Interrupt Signal Enable Register  */
  __IOM uint32_t AC12ERRSTAT;     /**< AUTO CMD12 Error Status and Host Control2 Register  */
  __IM uint32_t  CAPAB0;          /**< Capabilities Register to Hold Bits 31~0  */
  __IM uint32_t  CAPAB2;          /**< Capabilities Register to Hold Bits 63~32  */
  __IM uint32_t  MAXCURCAPAB;     /**< Maximum Current Capabilities Register  */
  uint32_t       RESERVED0[1U];   /**< Reserved for future use **/
  __IOM uint32_t FEVTERRSTAT;     /**< Force Event Register for Auto CMD Error Status  */
  __IM uint32_t  ADMAES;          /**< ADMA Error Status Register  */
  __IOM uint32_t ADSADDR;         /**< ADMA System Address Register  */
  uint32_t       RESERVED1[1U];   /**< Reserved for future use **/
  __IM uint32_t  PRSTVAL0;        /**< Preset Value for Initialization and Default Speed Mode  */
  __IM uint32_t  PRSTVAL2;        /**< Preset Value for High Speed and SDR12 Modes  */
  __IM uint32_t  PRSTVAL4;        /**< Preset Value for SDR25 and SDR50 Modes  */
  __IM uint32_t  PRSTVAL6;        /**< Preset Value for SDR104 and DDR50 Modes  */
  __IOM uint32_t BOOTTOCTRL;      /**< Boot Timeout Control Register  */
  uint32_t       RESERVED2[34U];  /**< Reserved for future use **/
  __IM uint32_t  SLOTINTSTAT;     /**< Slot Interrupt Status Register  */

  uint32_t       RESERVED3[448U]; /**< Reserved for future use **/
  __IOM uint32_t CTRL;            /**< Core Control Signals  */
  __IOM uint32_t CFG0;            /**< Core Configuration 0  */
  __IOM uint32_t CFG1;            /**< Core Configuration 1  */
  __IOM uint32_t CFGPRESETVAL0;   /**< Core Configuration Preset Value 0  */
  __IOM uint32_t CFGPRESETVAL1;   /**< Core Configuration Preset Value 1  */
  __IOM uint32_t CFGPRESETVAL2;   /**< Core Configuration Preset Value 2  */
  __IOM uint32_t CFGPRESETVAL3;   /**< Core Configuration Preset Value 3  */
  __IOM uint32_t ROUTELOC0;       /**< I/O LOCATION Register  */
  __IOM uint32_t ROUTELOC1;       /**< I/O LOCATION Register  */
  __IOM uint32_t ROUTEPEN;        /**< I/O LOCATION Enable Register  */
} SDIO_TypeDef;                   /** @} */

/***************************************************************************//**
 * @addtogroup EFM32GG11B_SDIO
 * @{
 * @defgroup EFM32GG11B_SDIO_BitFields  SDIO Bit Fields
 * @{
 ******************************************************************************/

/* Bit fields for SDIO SDMASYSADDR */
#define _SDIO_SDMASYSADDR_RESETVALUE                   0x00000000UL                                    /**< Default value for SDIO_SDMASYSADDR */
#define _SDIO_SDMASYSADDR_MASK                         0xFFFFFFFFUL                                    /**< Mask for SDIO_SDMASYSADDR */
#define _SDIO_SDMASYSADDR_SDMASYSADDRARG_SHIFT         0                                               /**< Shift value for SDIO_SDMASYSADDRARG */
#define _SDIO_SDMASYSADDR_SDMASYSADDRARG_MASK          0xFFFFFFFFUL                                    /**< Bit mask for SDIO_SDMASYSADDRARG */
#define _SDIO_SDMASYSADDR_SDMASYSADDRARG_DEFAULT       0x00000000UL                                    /**< Mode DEFAULT for SDIO_SDMASYSADDR */
#define SDIO_SDMASYSADDR_SDMASYSADDRARG_DEFAULT        (_SDIO_SDMASYSADDR_SDMASYSADDRARG_DEFAULT << 0) /**< Shifted mode DEFAULT for SDIO_SDMASYSADDR */

/* Bit fields for SDIO BLKSIZE */
#define _SDIO_BLKSIZE_RESETVALUE                       0x00000000UL                                    /**< Default value for SDIO_BLKSIZE */
#define _SDIO_BLKSIZE_MASK                             0xFFFF7FFFUL                                    /**< Mask for SDIO_BLKSIZE */
#define _SDIO_BLKSIZE_TFRBLKSIZE_SHIFT                 0                                               /**< Shift value for SDIO_TFRBLKSIZE */
#define _SDIO_BLKSIZE_TFRBLKSIZE_MASK                  0xFFFUL                                         /**< Bit mask for SDIO_TFRBLKSIZE */
#define _SDIO_BLKSIZE_TFRBLKSIZE_DEFAULT               0x00000000UL                                    /**< Mode DEFAULT for SDIO_BLKSIZE */
#define _SDIO_BLKSIZE_TFRBLKSIZE_NOXFER                0x00000000UL                                    /**< Mode NOXFER for SDIO_BLKSIZE */
#define SDIO_BLKSIZE_TFRBLKSIZE_DEFAULT                (_SDIO_BLKSIZE_TFRBLKSIZE_DEFAULT << 0)         /**< Shifted mode DEFAULT for SDIO_BLKSIZE */
#define SDIO_BLKSIZE_TFRBLKSIZE_NOXFER                 (_SDIO_BLKSIZE_TFRBLKSIZE_NOXFER << 0)          /**< Shifted mode NOXFER for SDIO_BLKSIZE */
#define _SDIO_BLKSIZE_HSTSDMABUFSIZE_SHIFT             12                                              /**< Shift value for SDIO_HSTSDMABUFSIZE */
#define _SDIO_BLKSIZE_HSTSDMABUFSIZE_MASK              0x7000UL                                        /**< Bit mask for SDIO_HSTSDMABUFSIZE */
#define _SDIO_BLKSIZE_HSTSDMABUFSIZE_DEFAULT           0x00000000UL                                    /**< Mode DEFAULT for SDIO_BLKSIZE */
#define _SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE4             0x00000000UL                                    /**< Mode SIZE4 for SDIO_BLKSIZE */
#define _SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE8             0x00000001UL                                    /**< Mode SIZE8 for SDIO_BLKSIZE */
#define _SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE16            0x00000002UL                                    /**< Mode SIZE16 for SDIO_BLKSIZE */
#define _SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE32            0x00000003UL                                    /**< Mode SIZE32 for SDIO_BLKSIZE */
#define _SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE64            0x00000004UL                                    /**< Mode SIZE64 for SDIO_BLKSIZE */
#define _SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE128           0x00000005UL                                    /**< Mode SIZE128 for SDIO_BLKSIZE */
#define _SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE256           0x00000006UL                                    /**< Mode SIZE256 for SDIO_BLKSIZE */
#define _SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE512           0x00000007UL                                    /**< Mode SIZE512 for SDIO_BLKSIZE */
#define SDIO_BLKSIZE_HSTSDMABUFSIZE_DEFAULT            (_SDIO_BLKSIZE_HSTSDMABUFSIZE_DEFAULT << 12)    /**< Shifted mode DEFAULT for SDIO_BLKSIZE */
#define SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE4              (_SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE4 << 12)      /**< Shifted mode SIZE4 for SDIO_BLKSIZE */
#define SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE8              (_SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE8 << 12)      /**< Shifted mode SIZE8 for SDIO_BLKSIZE */
#define SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE16             (_SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE16 << 12)     /**< Shifted mode SIZE16 for SDIO_BLKSIZE */
#define SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE32             (_SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE32 << 12)     /**< Shifted mode SIZE32 for SDIO_BLKSIZE */
#define SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE64             (_SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE64 << 12)     /**< Shifted mode SIZE64 for SDIO_BLKSIZE */
#define SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE128            (_SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE128 << 12)    /**< Shifted mode SIZE128 for SDIO_BLKSIZE */
#define SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE256            (_SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE256 << 12)    /**< Shifted mode SIZE256 for SDIO_BLKSIZE */
#define SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE512            (_SDIO_BLKSIZE_HSTSDMABUFSIZE_SIZE512 << 12)    /**< Shifted mode SIZE512 for SDIO_BLKSIZE */
#define _SDIO_BLKSIZE_BLKSCNTFORCURRTFR_SHIFT          16                                              /**< Shift value for SDIO_BLKSCNTFORCURRTFR */
#define _SDIO_BLKSIZE_BLKSCNTFORCURRTFR_MASK           0xFFFF0000UL                                    /**< Bit mask for SDIO_BLKSCNTFORCURRTFR */
#define _SDIO_BLKSIZE_BLKSCNTFORCURRTFR_DEFAULT        0x00000000UL                                    /**< Mode DEFAULT for SDIO_BLKSIZE */
#define _SDIO_BLKSIZE_BLKSCNTFORCURRTFR_STOPCNT        0x00000000UL                                    /**< Mode STOPCNT for SDIO_BLKSIZE */
#define SDIO_BLKSIZE_BLKSCNTFORCURRTFR_DEFAULT         (_SDIO_BLKSIZE_BLKSCNTFORCURRTFR_DEFAULT << 16) /**< Shifted mode DEFAULT for SDIO_BLKSIZE */
#define SDIO_BLKSIZE_BLKSCNTFORCURRTFR_STOPCNT         (_SDIO_BLKSIZE_BLKSCNTFORCURRTFR_STOPCNT << 16) /**< Shifted mode STOPCNT for SDIO_BLKSIZE */

