RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_sdio.h
/* Bit fields for SDIO CMDARG1 */
#define _SDIO_CMDARG1_RESETVALUE                       0x00000000UL                         /**< Default value for SDIO_CMDARG1 */
#define _SDIO_CMDARG1_MASK                             0xFFFFFFFFUL                         /**< Mask for SDIO_CMDARG1 */
#define _SDIO_CMDARG1_CMDARG1_SHIFT                    0                                    /**< Shift value for SDIO_CMDARG1 */
#define _SDIO_CMDARG1_CMDARG1_MASK                     0xFFFFFFFFUL                         /**< Bit mask for SDIO_CMDARG1 */
#define _SDIO_CMDARG1_CMDARG1_DEFAULT                  0x00000000UL                         /**< Mode DEFAULT for SDIO_CMDARG1 */
#define SDIO_CMDARG1_CMDARG1_DEFAULT                   (_SDIO_CMDARG1_CMDARG1_DEFAULT << 0) /**< Shifted mode DEFAULT for SDIO_CMDARG1 */

/* Bit fields for SDIO TFRMODE */
#define _SDIO_TFRMODE_RESETVALUE                       0x00000000UL                                  /**< Default value for SDIO_TFRMODE */
#define _SDIO_TFRMODE_MASK                             0x3FFB003FUL                                  /**< Mask for SDIO_TFRMODE */
#define SDIO_TFRMODE_DMAEN                             (0x1UL << 0)                                  /**< DMA Enable */
#define _SDIO_TFRMODE_DMAEN_SHIFT                      0                                             /**< Shift value for SDIO_DMAEN */
#define _SDIO_TFRMODE_DMAEN_MASK                       0x1UL                                         /**< Bit mask for SDIO_DMAEN */
#define _SDIO_TFRMODE_DMAEN_DEFAULT                    0x00000000UL                                  /**< Mode DEFAULT for SDIO_TFRMODE */
#define _SDIO_TFRMODE_DMAEN_DISABLE                    0x00000000UL                                  /**< Mode DISABLE for SDIO_TFRMODE */
#define _SDIO_TFRMODE_DMAEN_ENABLE                     0x00000001UL                                  /**< Mode ENABLE for SDIO_TFRMODE */
#define SDIO_TFRMODE_DMAEN_DEFAULT                     (_SDIO_TFRMODE_DMAEN_DEFAULT << 0)            /**< Shifted mode DEFAULT for SDIO_TFRMODE */
#define SDIO_TFRMODE_DMAEN_DISABLE                     (_SDIO_TFRMODE_DMAEN_DISABLE << 0)            /**< Shifted mode DISABLE for SDIO_TFRMODE */
#define SDIO_TFRMODE_DMAEN_ENABLE                      (_SDIO_TFRMODE_DMAEN_ENABLE << 0)             /**< Shifted mode ENABLE for SDIO_TFRMODE */
#define SDIO_TFRMODE_BLKCNTEN                          (0x1UL << 1)                                  /**< Block Count Enable */
#define _SDIO_TFRMODE_BLKCNTEN_SHIFT                   1                                             /**< Shift value for SDIO_BLKCNTEN */
#define _SDIO_TFRMODE_BLKCNTEN_MASK                    0x2UL                                         /**< Bit mask for SDIO_BLKCNTEN */
#define _SDIO_TFRMODE_BLKCNTEN_DEFAULT                 0x00000000UL                                  /**< Mode DEFAULT for SDIO_TFRMODE */
#define _SDIO_TFRMODE_BLKCNTEN_DISABLE                 0x00000000UL                                  /**< Mode DISABLE for SDIO_TFRMODE */
#define _SDIO_TFRMODE_BLKCNTEN_ENABLE                  0x00000001UL                                  /**< Mode ENABLE for SDIO_TFRMODE */
#define SDIO_TFRMODE_BLKCNTEN_DEFAULT                  (_SDIO_TFRMODE_BLKCNTEN_DEFAULT << 1)         /**< Shifted mode DEFAULT for SDIO_TFRMODE */
#define SDIO_TFRMODE_BLKCNTEN_DISABLE                  (_SDIO_TFRMODE_BLKCNTEN_DISABLE << 1)         /**< Shifted mode DISABLE for SDIO_TFRMODE */
#define SDIO_TFRMODE_BLKCNTEN_ENABLE                   (_SDIO_TFRMODE_BLKCNTEN_ENABLE << 1)          /**< Shifted mode ENABLE for SDIO_TFRMODE */
#define _SDIO_TFRMODE_AUTOCMDEN_SHIFT                  2                                             /**< Shift value for SDIO_AUTOCMDEN */
#define _SDIO_TFRMODE_AUTOCMDEN_MASK                   0xCUL                                         /**< Bit mask for SDIO_AUTOCMDEN */
#define _SDIO_TFRMODE_AUTOCMDEN_DEFAULT                0x00000000UL                                  /**< Mode DEFAULT for SDIO_TFRMODE */
#define _SDIO_TFRMODE_AUTOCMDEN_ACMDDISABLED           0x00000000UL                                  /**< Mode ACMDDISABLED for SDIO_TFRMODE */
#define _SDIO_TFRMODE_AUTOCMDEN_ACMD12EN               0x00000001UL                                  /**< Mode ACMD12EN for SDIO_TFRMODE */
#define _SDIO_TFRMODE_AUTOCMDEN_ACMD23EN               0x00000002UL                                  /**< Mode ACMD23EN for SDIO_TFRMODE */
#define SDIO_TFRMODE_AUTOCMDEN_DEFAULT                 (_SDIO_TFRMODE_AUTOCMDEN_DEFAULT << 2)        /**< Shifted mode DEFAULT for SDIO_TFRMODE */
#define SDIO_TFRMODE_AUTOCMDEN_ACMDDISABLED            (_SDIO_TFRMODE_AUTOCMDEN_ACMDDISABLED << 2)   /**< Shifted mode ACMDDISABLED for SDIO_TFRMODE */
#define SDIO_TFRMODE_AUTOCMDEN_ACMD12EN                (_SDIO_TFRMODE_AUTOCMDEN_ACMD12EN << 2)       /**< Shifted mode ACMD12EN for SDIO_TFRMODE */
#define SDIO_TFRMODE_AUTOCMDEN_ACMD23EN                (_SDIO_TFRMODE_AUTOCMDEN_ACMD23EN << 2)       /**< Shifted mode ACMD23EN for SDIO_TFRMODE */
#define SDIO_TFRMODE_DATDIRSEL                         (0x1UL << 4)                                  /**< Data Transfer Direction Select */
#define _SDIO_TFRMODE_DATDIRSEL_SHIFT                  4                                             /**< Shift value for SDIO_DATDIRSEL */
#define _SDIO_TFRMODE_DATDIRSEL_MASK                   0x10UL                                        /**< Bit mask for SDIO_DATDIRSEL */
#define _SDIO_TFRMODE_DATDIRSEL_DEFAULT                0x00000000UL                                  /**< Mode DEFAULT for SDIO_TFRMODE */
#define _SDIO_TFRMODE_DATDIRSEL_DISABLE                0x00000000UL                                  /**< Mode DISABLE for SDIO_TFRMODE */
#define _SDIO_TFRMODE_DATDIRSEL_ENABLE                 0x00000001UL                                  /**< Mode ENABLE for SDIO_TFRMODE */
#define SDIO_TFRMODE_DATDIRSEL_DEFAULT                 (_SDIO_TFRMODE_DATDIRSEL_DEFAULT << 4)        /**< Shifted mode DEFAULT for SDIO_TFRMODE */
#define SDIO_TFRMODE_DATDIRSEL_DISABLE                 (_SDIO_TFRMODE_DATDIRSEL_DISABLE << 4)        /**< Shifted mode DISABLE for SDIO_TFRMODE */
#define SDIO_TFRMODE_DATDIRSEL_ENABLE                  (_SDIO_TFRMODE_DATDIRSEL_ENABLE << 4)         /**< Shifted mode ENABLE for SDIO_TFRMODE */
#define SDIO_TFRMODE_MULTSINGBLKSEL                    (0x1UL << 5)                                  /**< Multiple or Single Block Data Transfer Selection */
#define _SDIO_TFRMODE_MULTSINGBLKSEL_SHIFT             5                                             /**< Shift value for SDIO_MULTSINGBLKSEL */
#define _SDIO_TFRMODE_MULTSINGBLKSEL_MASK              0x20UL                                        /**< Bit mask for SDIO_MULTSINGBLKSEL */
#define _SDIO_TFRMODE_MULTSINGBLKSEL_DEFAULT           0x00000000UL                                  /**< Mode DEFAULT for SDIO_TFRMODE */
#define _SDIO_TFRMODE_MULTSINGBLKSEL_SINGLEBLK         0x00000000UL                                  /**< Mode SINGLEBLK for SDIO_TFRMODE */
#define _SDIO_TFRMODE_MULTSINGBLKSEL_MULTIBLK          0x00000001UL                                  /**< Mode MULTIBLK for SDIO_TFRMODE */
#define SDIO_TFRMODE_MULTSINGBLKSEL_DEFAULT            (_SDIO_TFRMODE_MULTSINGBLKSEL_DEFAULT << 5)   /**< Shifted mode DEFAULT for SDIO_TFRMODE */
#define SDIO_TFRMODE_MULTSINGBLKSEL_SINGLEBLK          (_SDIO_TFRMODE_MULTSINGBLKSEL_SINGLEBLK << 5) /**< Shifted mode SINGLEBLK for SDIO_TFRMODE */
#define SDIO_TFRMODE_MULTSINGBLKSEL_MULTIBLK           (_SDIO_TFRMODE_MULTSINGBLKSEL_MULTIBLK << 5)  /**< Shifted mode MULTIBLK for SDIO_TFRMODE */
#define _SDIO_TFRMODE_RESPTYPESEL_SHIFT                16                                            /**< Shift value for SDIO_RESPTYPESEL */
#define _SDIO_TFRMODE_RESPTYPESEL_MASK                 0x30000UL                                     /**< Bit mask for SDIO_RESPTYPESEL */
#define _SDIO_TFRMODE_RESPTYPESEL_DEFAULT              0x00000000UL                                  /**< Mode DEFAULT for SDIO_TFRMODE */
#define _SDIO_TFRMODE_RESPTYPESEL_NORESP               0x00000000UL                                  /**< Mode NORESP for SDIO_TFRMODE */
#define _SDIO_TFRMODE_RESPTYPESEL_RESP136              0x00000001UL                                  /**< Mode RESP136 for SDIO_TFRMODE */
#define _SDIO_TFRMODE_RESPTYPESEL_RESP48               0x00000002UL                                  /**< Mode RESP48 for SDIO_TFRMODE */
#define _SDIO_TFRMODE_RESPTYPESEL_BUSYAFTRESP          0x00000003UL                                  /**< Mode BUSYAFTRESP for SDIO_TFRMODE */
#define SDIO_TFRMODE_RESPTYPESEL_DEFAULT               (_SDIO_TFRMODE_RESPTYPESEL_DEFAULT << 16)     /**< Shifted mode DEFAULT for SDIO_TFRMODE */
#define SDIO_TFRMODE_RESPTYPESEL_NORESP                (_SDIO_TFRMODE_RESPTYPESEL_NORESP << 16)      /**< Shifted mode NORESP for SDIO_TFRMODE */
#define SDIO_TFRMODE_RESPTYPESEL_RESP136               (_SDIO_TFRMODE_RESPTYPESEL_RESP136 << 16)     /**< Shifted mode RESP136 for SDIO_TFRMODE */
#define SDIO_TFRMODE_RESPTYPESEL_RESP48                (_SDIO_TFRMODE_RESPTYPESEL_RESP48 << 16)      /**< Shifted mode RESP48 for SDIO_TFRMODE */
#define SDIO_TFRMODE_RESPTYPESEL_BUSYAFTRESP           (_SDIO_TFRMODE_RESPTYPESEL_BUSYAFTRESP << 16) /**< Shifted mode BUSYAFTRESP for SDIO_TFRMODE */
#define SDIO_TFRMODE_CMDCRCCHKEN                       (0x1UL << 19)                                 /**< Command CRC Check Enable */
#define _SDIO_TFRMODE_CMDCRCCHKEN_SHIFT                19                                            /**< Shift value for SDIO_CMDCRCCHKEN */
#define _SDIO_TFRMODE_CMDCRCCHKEN_MASK                 0x80000UL                                     /**< Bit mask for SDIO_CMDCRCCHKEN */
#define _SDIO_TFRMODE_CMDCRCCHKEN_DEFAULT              0x00000000UL                                  /**< Mode DEFAULT for SDIO_TFRMODE */
#define _SDIO_TFRMODE_CMDCRCCHKEN_DISABLE              0x00000000UL                                  /**< Mode DISABLE for SDIO_TFRMODE */
#define _SDIO_TFRMODE_CMDCRCCHKEN_ENABLE               0x00000001UL                                  /**< Mode ENABLE for SDIO_TFRMODE */
#define SDIO_TFRMODE_CMDCRCCHKEN_DEFAULT               (_SDIO_TFRMODE_CMDCRCCHKEN_DEFAULT << 19)     /**< Shifted mode DEFAULT for SDIO_TFRMODE */
#define SDIO_TFRMODE_CMDCRCCHKEN_DISABLE               (_SDIO_TFRMODE_CMDCRCCHKEN_DISABLE << 19)     /**< Shifted mode DISABLE for SDIO_TFRMODE */
#define SDIO_TFRMODE_CMDCRCCHKEN_ENABLE                (_SDIO_TFRMODE_CMDCRCCHKEN_ENABLE << 19)      /**< Shifted mode ENABLE for SDIO_TFRMODE */
#define SDIO_TFRMODE_CMDINDXCHKEN                      (0x1UL << 20)                                 /**< Command Index Check Enable */
#define _SDIO_TFRMODE_CMDINDXCHKEN_SHIFT               20                                            /**< Shift value for SDIO_CMDINDXCHKEN */
#define _SDIO_TFRMODE_CMDINDXCHKEN_MASK                0x100000UL                                    /**< Bit mask for SDIO_CMDINDXCHKEN */
#define _SDIO_TFRMODE_CMDINDXCHKEN_DEFAULT             0x00000000UL                                  /**< Mode DEFAULT for SDIO_TFRMODE */
#define _SDIO_TFRMODE_CMDINDXCHKEN_DISABLE             0x00000000UL                                  /**< Mode DISABLE for SDIO_TFRMODE */
#define _SDIO_TFRMODE_CMDINDXCHKEN_ENABLE              0x00000001UL                                  /**< Mode ENABLE for SDIO_TFRMODE */
#define SDIO_TFRMODE_CMDINDXCHKEN_DEFAULT              (_SDIO_TFRMODE_CMDINDXCHKEN_DEFAULT << 20)    /**< Shifted mode DEFAULT for SDIO_TFRMODE */
#define SDIO_TFRMODE_CMDINDXCHKEN_DISABLE              (_SDIO_TFRMODE_CMDINDXCHKEN_DISABLE << 20)    /**< Shifted mode DISABLE for SDIO_TFRMODE */
#define SDIO_TFRMODE_CMDINDXCHKEN_ENABLE               (_SDIO_TFRMODE_CMDINDXCHKEN_ENABLE << 20)     /**< Shifted mode ENABLE for SDIO_TFRMODE */
#define SDIO_TFRMODE_DATPRESSEL                        (0x1UL << 21)                                 /**< Data Present Select */
#define _SDIO_TFRMODE_DATPRESSEL_SHIFT                 21                                            /**< Shift value for SDIO_DATPRESSEL */
#define _SDIO_TFRMODE_DATPRESSEL_MASK                  0x200000UL                                    /**< Bit mask for SDIO_DATPRESSEL */
#define _SDIO_TFRMODE_DATPRESSEL_DEFAULT               0x00000000UL                                  /**< Mode DEFAULT for SDIO_TFRMODE */
#define _SDIO_TFRMODE_DATPRESSEL_NODATA                0x00000000UL                                  /**< Mode NODATA for SDIO_TFRMODE */
#define _SDIO_TFRMODE_DATPRESSEL_DATA                  0x00000001UL                                  /**< Mode DATA for SDIO_TFRMODE */
#define SDIO_TFRMODE_DATPRESSEL_DEFAULT                (_SDIO_TFRMODE_DATPRESSEL_DEFAULT << 21)      /**< Shifted mode DEFAULT for SDIO_TFRMODE */
#define SDIO_TFRMODE_DATPRESSEL_NODATA                 (_SDIO_TFRMODE_DATPRESSEL_NODATA << 21)       /**< Shifted mode NODATA for SDIO_TFRMODE */
#define SDIO_TFRMODE_DATPRESSEL_DATA                   (_SDIO_TFRMODE_DATPRESSEL_DATA << 21)         /**< Shifted mode DATA for SDIO_TFRMODE */
#define _SDIO_TFRMODE_CMDTYPE_SHIFT                    22                                            /**< Shift value for SDIO_CMDTYPE */
#define _SDIO_TFRMODE_CMDTYPE_MASK                     0xC00000UL                                    /**< Bit mask for SDIO_CMDTYPE */
#define _SDIO_TFRMODE_CMDTYPE_DEFAULT                  0x00000000UL                                  /**< Mode DEFAULT for SDIO_TFRMODE */
#define _SDIO_TFRMODE_CMDTYPE_NORMAL                   0x00000000UL                                  /**< Mode NORMAL for SDIO_TFRMODE */
#define _SDIO_TFRMODE_CMDTYPE_SUSPEND                  0x00000001UL                                  /**< Mode SUSPEND for SDIO_TFRMODE */
#define _SDIO_TFRMODE_CMDTYPE_RESUME                   0x00000002UL                                  /**< Mode RESUME for SDIO_TFRMODE */
#define _SDIO_TFRMODE_CMDTYPE_ABORT                    0x00000003UL                                  /**< Mode ABORT for SDIO_TFRMODE */
#define SDIO_TFRMODE_CMDTYPE_DEFAULT                   (_SDIO_TFRMODE_CMDTYPE_DEFAULT << 22)         /**< Shifted mode DEFAULT for SDIO_TFRMODE */
#define SDIO_TFRMODE_CMDTYPE_NORMAL                    (_SDIO_TFRMODE_CMDTYPE_NORMAL << 22)          /**< Shifted mode NORMAL for SDIO_TFRMODE */
#define SDIO_TFRMODE_CMDTYPE_SUSPEND                   (_SDIO_TFRMODE_CMDTYPE_SUSPEND << 22)         /**< Shifted mode SUSPEND for SDIO_TFRMODE */
#define SDIO_TFRMODE_CMDTYPE_RESUME                    (_SDIO_TFRMODE_CMDTYPE_RESUME << 22)          /**< Shifted mode RESUME for SDIO_TFRMODE */
#define SDIO_TFRMODE_CMDTYPE_ABORT                     (_SDIO_TFRMODE_CMDTYPE_ABORT << 22)           /**< Shifted mode ABORT for SDIO_TFRMODE */
#define _SDIO_TFRMODE_CMDINDEX_SHIFT                   24                                            /**< Shift value for SDIO_CMDINDEX */
#define _SDIO_TFRMODE_CMDINDEX_MASK                    0x3F000000UL                                  /**< Bit mask for SDIO_CMDINDEX */
#define _SDIO_TFRMODE_CMDINDEX_DEFAULT                 0x00000000UL                                  /**< Mode DEFAULT for SDIO_TFRMODE */
#define SDIO_TFRMODE_CMDINDEX_DEFAULT                  (_SDIO_TFRMODE_CMDINDEX_DEFAULT << 24)        /**< Shifted mode DEFAULT for SDIO_TFRMODE */

/* Bit fields for SDIO RESP0 */
#define _SDIO_RESP0_RESETVALUE                         0x00000000UL                        /**< Default value for SDIO_RESP0 */
#define _SDIO_RESP0_MASK                               0xFFFFFFFFUL                        /**< Mask for SDIO_RESP0 */
#define _SDIO_RESP0_CMDRESP0_SHIFT                     0                                   /**< Shift value for SDIO_CMDRESP0 */
#define _SDIO_RESP0_CMDRESP0_MASK                      0xFFFFFFFFUL                        /**< Bit mask for SDIO_CMDRESP0 */
#define _SDIO_RESP0_CMDRESP0_DEFAULT                   0x00000000UL                        /**< Mode DEFAULT for SDIO_RESP0 */
#define SDIO_RESP0_CMDRESP0_DEFAULT                    (_SDIO_RESP0_CMDRESP0_DEFAULT << 0) /**< Shifted mode DEFAULT for SDIO_RESP0 */

/* Bit fields for SDIO RESP2 */
#define _SDIO_RESP2_RESETVALUE                         0x00000000UL                        /**< Default value for SDIO_RESP2 */
#define _SDIO_RESP2_MASK                               0xFFFFFFFFUL                        /**< Mask for SDIO_RESP2 */
#define _SDIO_RESP2_CMDRESP1_SHIFT                     0                                   /**< Shift value for SDIO_CMDRESP1 */
#define _SDIO_RESP2_CMDRESP1_MASK                      0xFFFFFFFFUL                        /**< Bit mask for SDIO_CMDRESP1 */
#define _SDIO_RESP2_CMDRESP1_DEFAULT                   0x00000000UL                        /**< Mode DEFAULT for SDIO_RESP2 */
#define SDIO_RESP2_CMDRESP1_DEFAULT                    (_SDIO_RESP2_CMDRESP1_DEFAULT << 0) /**< Shifted mode DEFAULT for SDIO_RESP2 */

/* Bit fields for SDIO RESP4 */
#define _SDIO_RESP4_RESETVALUE                         0x00000000UL                        /**< Default value for SDIO_RESP4 */
#define _SDIO_RESP4_MASK                               0xFFFFFFFFUL                        /**< Mask for SDIO_RESP4 */
#define _SDIO_RESP4_CMDRESP2_SHIFT                     0                                   /**< Shift value for SDIO_CMDRESP2 */
#define _SDIO_RESP4_CMDRESP2_MASK                      0xFFFFFFFFUL                        /**< Bit mask for SDIO_CMDRESP2 */
#define _SDIO_RESP4_CMDRESP2_DEFAULT                   0x00000000UL                        /**< Mode DEFAULT for SDIO_RESP4 */
#define SDIO_RESP4_CMDRESP2_DEFAULT                    (_SDIO_RESP4_CMDRESP2_DEFAULT << 0) /**< Shifted mode DEFAULT for SDIO_RESP4 */

/* Bit fields for SDIO RESP6 */
#define _SDIO_RESP6_RESETVALUE                         0x00000000UL                        /**< Default value for SDIO_RESP6 */
#define _SDIO_RESP6_MASK                               0xFFFFFFFFUL                        /**< Mask for SDIO_RESP6 */
#define _SDIO_RESP6_CMDRESP3_SHIFT                     0                                   /**< Shift value for SDIO_CMDRESP3 */
#define _SDIO_RESP6_CMDRESP3_MASK                      0xFFFFFFFFUL                        /**< Bit mask for SDIO_CMDRESP3 */
#define _SDIO_RESP6_CMDRESP3_DEFAULT                   0x00000000UL                        /**< Mode DEFAULT for SDIO_RESP6 */
#define SDIO_RESP6_CMDRESP3_DEFAULT                    (_SDIO_RESP6_CMDRESP3_DEFAULT << 0) /**< Shifted mode DEFAULT for SDIO_RESP6 */

/* Bit fields for SDIO BUFDATPORT */
#define _SDIO_BUFDATPORT_RESETVALUE                    0x00000000UL                           /**< Default value for SDIO_BUFDATPORT */
#define _SDIO_BUFDATPORT_MASK                          0xFFFFFFFFUL                           /**< Mask for SDIO_BUFDATPORT */
#define _SDIO_BUFDATPORT_BUFDAT_SHIFT                  0                                      /**< Shift value for SDIO_BUFDAT */
#define _SDIO_BUFDATPORT_BUFDAT_MASK                   0xFFFFFFFFUL                           /**< Bit mask for SDIO_BUFDAT */
#define _SDIO_BUFDATPORT_BUFDAT_DEFAULT                0x00000000UL                           /**< Mode DEFAULT for SDIO_BUFDATPORT */
#define SDIO_BUFDATPORT_BUFDAT_DEFAULT                 (_SDIO_BUFDATPORT_BUFDAT_DEFAULT << 0) /**< Shifted mode DEFAULT for SDIO_BUFDATPORT */

