RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_sdio.h
/* Bit fields for SDIO HOSTCTRL1 */
#define _SDIO_HOSTCTRL1_RESETVALUE                     0x00800000UL                                        /**< Default value for SDIO_HOSTCTRL1 */
#define _SDIO_HOSTCTRL1_MASK                           0x07FF1FFFUL                                        /**< Mask for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_LEDCTRL                         (0x1UL << 0)                                        /**< LED Control */
#define _SDIO_HOSTCTRL1_LEDCTRL_SHIFT                  0                                                   /**< Shift value for SDIO_LEDCTRL */
#define _SDIO_HOSTCTRL1_LEDCTRL_MASK                   0x1UL                                               /**< Bit mask for SDIO_LEDCTRL */
#define _SDIO_HOSTCTRL1_LEDCTRL_DEFAULT                0x00000000UL                                        /**< Mode DEFAULT for SDIO_HOSTCTRL1 */
#define _SDIO_HOSTCTRL1_LEDCTRL_LEDOFF                 0x00000000UL                                        /**< Mode LEDOFF for SDIO_HOSTCTRL1 */
#define _SDIO_HOSTCTRL1_LEDCTRL_LEDON                  0x00000001UL                                        /**< Mode LEDON for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_LEDCTRL_DEFAULT                 (_SDIO_HOSTCTRL1_LEDCTRL_DEFAULT << 0)              /**< Shifted mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_LEDCTRL_LEDOFF                  (_SDIO_HOSTCTRL1_LEDCTRL_LEDOFF << 0)               /**< Shifted mode LEDOFF for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_LEDCTRL_LEDON                   (_SDIO_HOSTCTRL1_LEDCTRL_LEDON << 0)                /**< Shifted mode LEDON for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_DATTRANWD                       (0x1UL << 1)                                        /**< Data Transfer Width 1-bit or 4-bit Mode */
#define _SDIO_HOSTCTRL1_DATTRANWD_SHIFT                1                                                   /**< Shift value for SDIO_DATTRANWD */
#define _SDIO_HOSTCTRL1_DATTRANWD_MASK                 0x2UL                                               /**< Bit mask for SDIO_DATTRANWD */
#define _SDIO_HOSTCTRL1_DATTRANWD_DEFAULT              0x00000000UL                                        /**< Mode DEFAULT for SDIO_HOSTCTRL1 */
#define _SDIO_HOSTCTRL1_DATTRANWD_SD1                  0x00000000UL                                        /**< Mode SD1 for SDIO_HOSTCTRL1 */
#define _SDIO_HOSTCTRL1_DATTRANWD_SD4                  0x00000001UL                                        /**< Mode SD4 for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_DATTRANWD_DEFAULT               (_SDIO_HOSTCTRL1_DATTRANWD_DEFAULT << 1)            /**< Shifted mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_DATTRANWD_SD1                   (_SDIO_HOSTCTRL1_DATTRANWD_SD1 << 1)                /**< Shifted mode SD1 for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_DATTRANWD_SD4                   (_SDIO_HOSTCTRL1_DATTRANWD_SD4 << 1)                /**< Shifted mode SD4 for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_HSEN                            (0x1UL << 2)                                        /**< High Speed Enable */
#define _SDIO_HOSTCTRL1_HSEN_SHIFT                     2                                                   /**< Shift value for SDIO_HSEN */
#define _SDIO_HOSTCTRL1_HSEN_MASK                      0x4UL                                               /**< Bit mask for SDIO_HSEN */
#define _SDIO_HOSTCTRL1_HSEN_DEFAULT                   0x00000000UL                                        /**< Mode DEFAULT for SDIO_HOSTCTRL1 */
#define _SDIO_HOSTCTRL1_HSEN_NS                        0x00000000UL                                        /**< Mode NS for SDIO_HOSTCTRL1 */
#define _SDIO_HOSTCTRL1_HSEN_HS                        0x00000001UL                                        /**< Mode HS for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_HSEN_DEFAULT                    (_SDIO_HOSTCTRL1_HSEN_DEFAULT << 2)                 /**< Shifted mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_HSEN_NS                         (_SDIO_HOSTCTRL1_HSEN_NS << 2)                      /**< Shifted mode NS for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_HSEN_HS                         (_SDIO_HOSTCTRL1_HSEN_HS << 2)                      /**< Shifted mode HS for SDIO_HOSTCTRL1 */
#define _SDIO_HOSTCTRL1_DMASEL_SHIFT                   3                                                   /**< Shift value for SDIO_DMASEL */
#define _SDIO_HOSTCTRL1_DMASEL_MASK                    0x18UL                                              /**< Bit mask for SDIO_DMASEL */
#define _SDIO_HOSTCTRL1_DMASEL_DEFAULT                 0x00000000UL                                        /**< Mode DEFAULT for SDIO_HOSTCTRL1 */
#define _SDIO_HOSTCTRL1_DMASEL_SDMA                    0x00000000UL                                        /**< Mode SDMA for SDIO_HOSTCTRL1 */
#define _SDIO_HOSTCTRL1_DMASEL_ADMA1                   0x00000001UL                                        /**< Mode ADMA1 for SDIO_HOSTCTRL1 */
#define _SDIO_HOSTCTRL1_DMASEL_ADMA2                   0x00000002UL                                        /**< Mode ADMA2 for SDIO_HOSTCTRL1 */
#define _SDIO_HOSTCTRL1_DMASEL_64BITADMA2              0x00000003UL                                        /**< Mode 64BITADMA2 for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_DMASEL_DEFAULT                  (_SDIO_HOSTCTRL1_DMASEL_DEFAULT << 3)               /**< Shifted mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_DMASEL_SDMA                     (_SDIO_HOSTCTRL1_DMASEL_SDMA << 3)                  /**< Shifted mode SDMA for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_DMASEL_ADMA1                    (_SDIO_HOSTCTRL1_DMASEL_ADMA1 << 3)                 /**< Shifted mode ADMA1 for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_DMASEL_ADMA2                    (_SDIO_HOSTCTRL1_DMASEL_ADMA2 << 3)                 /**< Shifted mode ADMA2 for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_DMASEL_64BITADMA2               (_SDIO_HOSTCTRL1_DMASEL_64BITADMA2 << 3)            /**< Shifted mode 64BITADMA2 for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_EXTDATTRANWD                    (0x1UL << 5)                                        /**< Extended Data Transfer Width */
#define _SDIO_HOSTCTRL1_EXTDATTRANWD_SHIFT             5                                                   /**< Shift value for SDIO_EXTDATTRANWD */
#define _SDIO_HOSTCTRL1_EXTDATTRANWD_MASK              0x20UL                                              /**< Bit mask for SDIO_EXTDATTRANWD */
#define _SDIO_HOSTCTRL1_EXTDATTRANWD_DEFAULT           0x00000000UL                                        /**< Mode DEFAULT for SDIO_HOSTCTRL1 */
#define _SDIO_HOSTCTRL1_EXTDATTRANWD_8BIT              0x00000000UL                                        /**< Mode 8BIT for SDIO_HOSTCTRL1 */
#define _SDIO_HOSTCTRL1_EXTDATTRANWD_DATXFR            0x00000001UL                                        /**< Mode DATXFR for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_EXTDATTRANWD_DEFAULT            (_SDIO_HOSTCTRL1_EXTDATTRANWD_DEFAULT << 5)         /**< Shifted mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_EXTDATTRANWD_8BIT               (_SDIO_HOSTCTRL1_EXTDATTRANWD_8BIT << 5)            /**< Shifted mode 8BIT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_EXTDATTRANWD_DATXFR             (_SDIO_HOSTCTRL1_EXTDATTRANWD_DATXFR << 5)          /**< Shifted mode DATXFR for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_CDTSTLVL                        (0x1UL << 6)                                        /**< Card Detect Test Level */
#define _SDIO_HOSTCTRL1_CDTSTLVL_SHIFT                 6                                                   /**< Shift value for SDIO_CDTSTLVL */
#define _SDIO_HOSTCTRL1_CDTSTLVL_MASK                  0x40UL                                              /**< Bit mask for SDIO_CDTSTLVL */
#define _SDIO_HOSTCTRL1_CDTSTLVL_DEFAULT               0x00000000UL                                        /**< Mode DEFAULT for SDIO_HOSTCTRL1 */
#define _SDIO_HOSTCTRL1_CDTSTLVL_NOCARD                0x00000000UL                                        /**< Mode NOCARD for SDIO_HOSTCTRL1 */
#define _SDIO_HOSTCTRL1_CDTSTLVL_CARDIN                0x00000001UL                                        /**< Mode CARDIN for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_CDTSTLVL_DEFAULT                (_SDIO_HOSTCTRL1_CDTSTLVL_DEFAULT << 6)             /**< Shifted mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_CDTSTLVL_NOCARD                 (_SDIO_HOSTCTRL1_CDTSTLVL_NOCARD << 6)              /**< Shifted mode NOCARD for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_CDTSTLVL_CARDIN                 (_SDIO_HOSTCTRL1_CDTSTLVL_CARDIN << 6)              /**< Shifted mode CARDIN for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_CDSIGDET                        (0x1UL << 7)                                        /**< Card Detetct Signal Detection */
#define _SDIO_HOSTCTRL1_CDSIGDET_SHIFT                 7                                                   /**< Shift value for SDIO_CDSIGDET */
#define _SDIO_HOSTCTRL1_CDSIGDET_MASK                  0x80UL                                              /**< Bit mask for SDIO_CDSIGDET */
#define _SDIO_HOSTCTRL1_CDSIGDET_DEFAULT               0x00000000UL                                        /**< Mode DEFAULT for SDIO_HOSTCTRL1 */
#define _SDIO_HOSTCTRL1_CDSIGDET_SDCD                  0x00000000UL                                        /**< Mode SDCD for SDIO_HOSTCTRL1 */
#define _SDIO_HOSTCTRL1_CDSIGDET_TSTLVL                0x00000001UL                                        /**< Mode TSTLVL for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_CDSIGDET_DEFAULT                (_SDIO_HOSTCTRL1_CDSIGDET_DEFAULT << 7)             /**< Shifted mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_CDSIGDET_SDCD                   (_SDIO_HOSTCTRL1_CDSIGDET_SDCD << 7)                /**< Shifted mode SDCD for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_CDSIGDET_TSTLVL                 (_SDIO_HOSTCTRL1_CDSIGDET_TSTLVL << 7)              /**< Shifted mode TSTLVL for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_SDBUSPOWER                      (0x1UL << 8)                                        /**< SD Bus Power */
#define _SDIO_HOSTCTRL1_SDBUSPOWER_SHIFT               8                                                   /**< Shift value for SDIO_SDBUSPOWER */
#define _SDIO_HOSTCTRL1_SDBUSPOWER_MASK                0x100UL                                             /**< Bit mask for SDIO_SDBUSPOWER */
#define _SDIO_HOSTCTRL1_SDBUSPOWER_DEFAULT             0x00000000UL                                        /**< Mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_SDBUSPOWER_DEFAULT              (_SDIO_HOSTCTRL1_SDBUSPOWER_DEFAULT << 8)           /**< Shifted mode DEFAULT for SDIO_HOSTCTRL1 */
#define _SDIO_HOSTCTRL1_SDBUSVOLTSEL_SHIFT             9                                                   /**< Shift value for SDIO_SDBUSVOLTSEL */
#define _SDIO_HOSTCTRL1_SDBUSVOLTSEL_MASK              0xE00UL                                             /**< Bit mask for SDIO_SDBUSVOLTSEL */
#define _SDIO_HOSTCTRL1_SDBUSVOLTSEL_DEFAULT           0x00000000UL                                        /**< Mode DEFAULT for SDIO_HOSTCTRL1 */
#define _SDIO_HOSTCTRL1_SDBUSVOLTSEL_1P8V              0x00000005UL                                        /**< Mode 1P8V for SDIO_HOSTCTRL1 */
#define _SDIO_HOSTCTRL1_SDBUSVOLTSEL_3P0V              0x00000006UL                                        /**< Mode 3P0V for SDIO_HOSTCTRL1 */
#define _SDIO_HOSTCTRL1_SDBUSVOLTSEL_3P3V              0x00000007UL                                        /**< Mode 3P3V for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_SDBUSVOLTSEL_DEFAULT            (_SDIO_HOSTCTRL1_SDBUSVOLTSEL_DEFAULT << 9)         /**< Shifted mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_SDBUSVOLTSEL_1P8V               (_SDIO_HOSTCTRL1_SDBUSVOLTSEL_1P8V << 9)            /**< Shifted mode 1P8V for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_SDBUSVOLTSEL_3P0V               (_SDIO_HOSTCTRL1_SDBUSVOLTSEL_3P0V << 9)            /**< Shifted mode 3P0V for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_SDBUSVOLTSEL_3P3V               (_SDIO_HOSTCTRL1_SDBUSVOLTSEL_3P3V << 9)            /**< Shifted mode 3P3V for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_HRDRST                          (0x1UL << 12)                                       /**< Hardware Reset Signal */
#define _SDIO_HOSTCTRL1_HRDRST_SHIFT                   12                                                  /**< Shift value for SDIO_HRDRST */
#define _SDIO_HOSTCTRL1_HRDRST_MASK                    0x1000UL                                            /**< Bit mask for SDIO_HRDRST */
#define _SDIO_HOSTCTRL1_HRDRST_DEFAULT                 0x00000000UL                                        /**< Mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_HRDRST_DEFAULT                  (_SDIO_HOSTCTRL1_HRDRST_DEFAULT << 12)              /**< Shifted mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_STOPATBLKGAPREQ                 (0x1UL << 16)                                       /**< Stop at Block Gap Request */
#define _SDIO_HOSTCTRL1_STOPATBLKGAPREQ_SHIFT          16                                                  /**< Shift value for SDIO_STOPATBLKGAPREQ */
#define _SDIO_HOSTCTRL1_STOPATBLKGAPREQ_MASK           0x10000UL                                           /**< Bit mask for SDIO_STOPATBLKGAPREQ */
#define _SDIO_HOSTCTRL1_STOPATBLKGAPREQ_DEFAULT        0x00000000UL                                        /**< Mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_STOPATBLKGAPREQ_DEFAULT         (_SDIO_HOSTCTRL1_STOPATBLKGAPREQ_DEFAULT << 16)     /**< Shifted mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_CONTINUEREQ                     (0x1UL << 17)                                       /**< Continue Request */
#define _SDIO_HOSTCTRL1_CONTINUEREQ_SHIFT              17                                                  /**< Shift value for SDIO_CONTINUEREQ */
#define _SDIO_HOSTCTRL1_CONTINUEREQ_MASK               0x20000UL                                           /**< Bit mask for SDIO_CONTINUEREQ */
#define _SDIO_HOSTCTRL1_CONTINUEREQ_DEFAULT            0x00000000UL                                        /**< Mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_CONTINUEREQ_DEFAULT             (_SDIO_HOSTCTRL1_CONTINUEREQ_DEFAULT << 17)         /**< Shifted mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_RDWAITCTRL                      (0x1UL << 18)                                       /**< Read Wait Control */
#define _SDIO_HOSTCTRL1_RDWAITCTRL_SHIFT               18                                                  /**< Shift value for SDIO_RDWAITCTRL */
#define _SDIO_HOSTCTRL1_RDWAITCTRL_MASK                0x40000UL                                           /**< Bit mask for SDIO_RDWAITCTRL */
#define _SDIO_HOSTCTRL1_RDWAITCTRL_DEFAULT             0x00000000UL                                        /**< Mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_RDWAITCTRL_DEFAULT              (_SDIO_HOSTCTRL1_RDWAITCTRL_DEFAULT << 18)          /**< Shifted mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_INTATBLKGAP                     (0x1UL << 19)                                       /**< Interrupt at Block Gap */
#define _SDIO_HOSTCTRL1_INTATBLKGAP_SHIFT              19                                                  /**< Shift value for SDIO_INTATBLKGAP */
#define _SDIO_HOSTCTRL1_INTATBLKGAP_MASK               0x80000UL                                           /**< Bit mask for SDIO_INTATBLKGAP */
#define _SDIO_HOSTCTRL1_INTATBLKGAP_DEFAULT            0x00000000UL                                        /**< Mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_INTATBLKGAP_DEFAULT             (_SDIO_HOSTCTRL1_INTATBLKGAP_DEFAULT << 19)         /**< Shifted mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_SPIMODE                         (0x1UL << 20)                                       /**< SPI Mode Enable */
#define _SDIO_HOSTCTRL1_SPIMODE_SHIFT                  20                                                  /**< Shift value for SDIO_SPIMODE */
#define _SDIO_HOSTCTRL1_SPIMODE_MASK                   0x100000UL                                          /**< Bit mask for SDIO_SPIMODE */
#define _SDIO_HOSTCTRL1_SPIMODE_DEFAULT                0x00000000UL                                        /**< Mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_SPIMODE_DEFAULT                 (_SDIO_HOSTCTRL1_SPIMODE_DEFAULT << 20)             /**< Shifted mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_BOOTEN                          (0x1UL << 21)                                       /**< Boot Enable */
#define _SDIO_HOSTCTRL1_BOOTEN_SHIFT                   21                                                  /**< Shift value for SDIO_BOOTEN */
#define _SDIO_HOSTCTRL1_BOOTEN_MASK                    0x200000UL                                          /**< Bit mask for SDIO_BOOTEN */
#define _SDIO_HOSTCTRL1_BOOTEN_DEFAULT                 0x00000000UL                                        /**< Mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_BOOTEN_DEFAULT                  (_SDIO_HOSTCTRL1_BOOTEN_DEFAULT << 21)              /**< Shifted mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_ALTBOOTEN                       (0x1UL << 22)                                       /**< Alternate Boot Enable */
#define _SDIO_HOSTCTRL1_ALTBOOTEN_SHIFT                22                                                  /**< Shift value for SDIO_ALTBOOTEN */
#define _SDIO_HOSTCTRL1_ALTBOOTEN_MASK                 0x400000UL                                          /**< Bit mask for SDIO_ALTBOOTEN */
#define _SDIO_HOSTCTRL1_ALTBOOTEN_DEFAULT              0x00000000UL                                        /**< Mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_ALTBOOTEN_DEFAULT               (_SDIO_HOSTCTRL1_ALTBOOTEN_DEFAULT << 22)           /**< Shifted mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_BOOTACKCHK                      (0x1UL << 23)                                       /**< Boot Ack Check */
#define _SDIO_HOSTCTRL1_BOOTACKCHK_SHIFT               23                                                  /**< Shift value for SDIO_BOOTACKCHK */
#define _SDIO_HOSTCTRL1_BOOTACKCHK_MASK                0x800000UL                                          /**< Bit mask for SDIO_BOOTACKCHK */
#define _SDIO_HOSTCTRL1_BOOTACKCHK_DEFAULT             0x00000001UL                                        /**< Mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_BOOTACKCHK_DEFAULT              (_SDIO_HOSTCTRL1_BOOTACKCHK_DEFAULT << 23)          /**< Shifted mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_WKUPEVNTENONCARDINT             (0x1UL << 24)                                       /**< Wakeup Event Enable on Card Interrupt */
#define _SDIO_HOSTCTRL1_WKUPEVNTENONCARDINT_SHIFT      24                                                  /**< Shift value for SDIO_WKUPEVNTENONCARDINT */
#define _SDIO_HOSTCTRL1_WKUPEVNTENONCARDINT_MASK       0x1000000UL                                         /**< Bit mask for SDIO_WKUPEVNTENONCARDINT */
#define _SDIO_HOSTCTRL1_WKUPEVNTENONCARDINT_DEFAULT    0x00000000UL                                        /**< Mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_WKUPEVNTENONCARDINT_DEFAULT     (_SDIO_HOSTCTRL1_WKUPEVNTENONCARDINT_DEFAULT << 24) /**< Shifted mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_WKUPEVNTENONCINS                (0x1UL << 25)                                       /**< Wakeup Event Enable on SD Card Insertion */
#define _SDIO_HOSTCTRL1_WKUPEVNTENONCINS_SHIFT         25                                                  /**< Shift value for SDIO_WKUPEVNTENONCINS */
#define _SDIO_HOSTCTRL1_WKUPEVNTENONCINS_MASK          0x2000000UL                                         /**< Bit mask for SDIO_WKUPEVNTENONCINS */
#define _SDIO_HOSTCTRL1_WKUPEVNTENONCINS_DEFAULT       0x00000000UL                                        /**< Mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_WKUPEVNTENONCINS_DEFAULT        (_SDIO_HOSTCTRL1_WKUPEVNTENONCINS_DEFAULT << 25)    /**< Shifted mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_WKUPEVNTENONCRM                 (0x1UL << 26)                                       /**< Wakeup Event Enable on SD Card Removal */
#define _SDIO_HOSTCTRL1_WKUPEVNTENONCRM_SHIFT          26                                                  /**< Shift value for SDIO_WKUPEVNTENONCRM */
#define _SDIO_HOSTCTRL1_WKUPEVNTENONCRM_MASK           0x4000000UL                                         /**< Bit mask for SDIO_WKUPEVNTENONCRM */
#define _SDIO_HOSTCTRL1_WKUPEVNTENONCRM_DEFAULT        0x00000000UL                                        /**< Mode DEFAULT for SDIO_HOSTCTRL1 */
#define SDIO_HOSTCTRL1_WKUPEVNTENONCRM_DEFAULT         (_SDIO_HOSTCTRL1_WKUPEVNTENONCRM_DEFAULT << 26)     /**< Shifted mode DEFAULT for SDIO_HOSTCTRL1 */

