RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_sdio.h
/* Bit fields for SDIO CLOCKCTRL */
#define _SDIO_CLOCKCTRL_RESETVALUE                     0x00000000UL                                   /**< Default value for SDIO_CLOCKCTRL */
#define _SDIO_CLOCKCTRL_MASK                           0x070FFFE7UL                                   /**< Mask for SDIO_CLOCKCTRL */
#define SDIO_CLOCKCTRL_INTCLKEN                        (0x1UL << 0)                                   /**< Internal Clock Enable */
#define _SDIO_CLOCKCTRL_INTCLKEN_SHIFT                 0                                              /**< Shift value for SDIO_INTCLKEN */
#define _SDIO_CLOCKCTRL_INTCLKEN_MASK                  0x1UL                                          /**< Bit mask for SDIO_INTCLKEN */
#define _SDIO_CLOCKCTRL_INTCLKEN_DEFAULT               0x00000000UL                                   /**< Mode DEFAULT for SDIO_CLOCKCTRL */
#define SDIO_CLOCKCTRL_INTCLKEN_DEFAULT                (_SDIO_CLOCKCTRL_INTCLKEN_DEFAULT << 0)        /**< Shifted mode DEFAULT for SDIO_CLOCKCTRL */
#define SDIO_CLOCKCTRL_INTCLKSTABLE                    (0x1UL << 1)                                   /**< Internal Clock Stable */
#define _SDIO_CLOCKCTRL_INTCLKSTABLE_SHIFT             1                                              /**< Shift value for SDIO_INTCLKSTABLE */
#define _SDIO_CLOCKCTRL_INTCLKSTABLE_MASK              0x2UL                                          /**< Bit mask for SDIO_INTCLKSTABLE */
#define _SDIO_CLOCKCTRL_INTCLKSTABLE_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for SDIO_CLOCKCTRL */
#define SDIO_CLOCKCTRL_INTCLKSTABLE_DEFAULT            (_SDIO_CLOCKCTRL_INTCLKSTABLE_DEFAULT << 1)    /**< Shifted mode DEFAULT for SDIO_CLOCKCTRL */
#define SDIO_CLOCKCTRL_SDCLKEN                         (0x1UL << 2)                                   /**< SDIO_CLK Pin Clock Enable */
#define _SDIO_CLOCKCTRL_SDCLKEN_SHIFT                  2                                              /**< Shift value for SDIO_SDCLKEN */
#define _SDIO_CLOCKCTRL_SDCLKEN_MASK                   0x4UL                                          /**< Bit mask for SDIO_SDCLKEN */
#define _SDIO_CLOCKCTRL_SDCLKEN_DEFAULT                0x00000000UL                                   /**< Mode DEFAULT for SDIO_CLOCKCTRL */
#define SDIO_CLOCKCTRL_SDCLKEN_DEFAULT                 (_SDIO_CLOCKCTRL_SDCLKEN_DEFAULT << 2)         /**< Shifted mode DEFAULT for SDIO_CLOCKCTRL */
#define SDIO_CLOCKCTRL_CLKGENSEL                       (0x1UL << 5)                                   /**< Clock Generator Select */
#define _SDIO_CLOCKCTRL_CLKGENSEL_SHIFT                5                                              /**< Shift value for SDIO_CLKGENSEL */
#define _SDIO_CLOCKCTRL_CLKGENSEL_MASK                 0x20UL                                         /**< Bit mask for SDIO_CLKGENSEL */
#define _SDIO_CLOCKCTRL_CLKGENSEL_DEFAULT              0x00000000UL                                   /**< Mode DEFAULT for SDIO_CLOCKCTRL */
#define SDIO_CLOCKCTRL_CLKGENSEL_DEFAULT               (_SDIO_CLOCKCTRL_CLKGENSEL_DEFAULT << 5)       /**< Shifted mode DEFAULT for SDIO_CLOCKCTRL */
#define _SDIO_CLOCKCTRL_UPPSDCLKFRE_SHIFT              6                                              /**< Shift value for SDIO_UPPSDCLKFRE */
#define _SDIO_CLOCKCTRL_UPPSDCLKFRE_MASK               0xC0UL                                         /**< Bit mask for SDIO_UPPSDCLKFRE */
#define _SDIO_CLOCKCTRL_UPPSDCLKFRE_DEFAULT            0x00000000UL                                   /**< Mode DEFAULT for SDIO_CLOCKCTRL */
#define SDIO_CLOCKCTRL_UPPSDCLKFRE_DEFAULT             (_SDIO_CLOCKCTRL_UPPSDCLKFRE_DEFAULT << 6)     /**< Shifted mode DEFAULT for SDIO_CLOCKCTRL */
#define _SDIO_CLOCKCTRL_SDCLKFREQSEL_SHIFT             8                                              /**< Shift value for SDIO_SDCLKFREQSEL */
#define _SDIO_CLOCKCTRL_SDCLKFREQSEL_MASK              0xFF00UL                                       /**< Bit mask for SDIO_SDCLKFREQSEL */
#define _SDIO_CLOCKCTRL_SDCLKFREQSEL_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for SDIO_CLOCKCTRL */
#define _SDIO_CLOCKCTRL_SDCLKFREQSEL_NODIVISION        0x00000000UL                                   /**< Mode NODIVISION for SDIO_CLOCKCTRL */
#define SDIO_CLOCKCTRL_SDCLKFREQSEL_DEFAULT            (_SDIO_CLOCKCTRL_SDCLKFREQSEL_DEFAULT << 8)    /**< Shifted mode DEFAULT for SDIO_CLOCKCTRL */
#define SDIO_CLOCKCTRL_SDCLKFREQSEL_NODIVISION         (_SDIO_CLOCKCTRL_SDCLKFREQSEL_NODIVISION << 8) /**< Shifted mode NODIVISION for SDIO_CLOCKCTRL */
#define _SDIO_CLOCKCTRL_DATTOUTCNTVAL_SHIFT            16                                             /**< Shift value for SDIO_DATTOUTCNTVAL */
#define _SDIO_CLOCKCTRL_DATTOUTCNTVAL_MASK             0xF0000UL                                      /**< Bit mask for SDIO_DATTOUTCNTVAL */
#define _SDIO_CLOCKCTRL_DATTOUTCNTVAL_DEFAULT          0x00000000UL                                   /**< Mode DEFAULT for SDIO_CLOCKCTRL */
#define SDIO_CLOCKCTRL_DATTOUTCNTVAL_DEFAULT           (_SDIO_CLOCKCTRL_DATTOUTCNTVAL_DEFAULT << 16)  /**< Shifted mode DEFAULT for SDIO_CLOCKCTRL */
#define SDIO_CLOCKCTRL_SFTRSTA                         (0x1UL << 24)                                  /**< Software Reset for All */
#define _SDIO_CLOCKCTRL_SFTRSTA_SHIFT                  24                                             /**< Shift value for SDIO_SFTRSTA */
#define _SDIO_CLOCKCTRL_SFTRSTA_MASK                   0x1000000UL                                    /**< Bit mask for SDIO_SFTRSTA */
#define _SDIO_CLOCKCTRL_SFTRSTA_DEFAULT                0x00000000UL                                   /**< Mode DEFAULT for SDIO_CLOCKCTRL */
#define SDIO_CLOCKCTRL_SFTRSTA_DEFAULT                 (_SDIO_CLOCKCTRL_SFTRSTA_DEFAULT << 24)        /**< Shifted mode DEFAULT for SDIO_CLOCKCTRL */
#define SDIO_CLOCKCTRL_SFTRSTCMD                       (0x1UL << 25)                                  /**< Software Reset for CMD Line */
#define _SDIO_CLOCKCTRL_SFTRSTCMD_SHIFT                25                                             /**< Shift value for SDIO_SFTRSTCMD */
#define _SDIO_CLOCKCTRL_SFTRSTCMD_MASK                 0x2000000UL                                    /**< Bit mask for SDIO_SFTRSTCMD */
#define _SDIO_CLOCKCTRL_SFTRSTCMD_DEFAULT              0x00000000UL                                   /**< Mode DEFAULT for SDIO_CLOCKCTRL */
#define SDIO_CLOCKCTRL_SFTRSTCMD_DEFAULT               (_SDIO_CLOCKCTRL_SFTRSTCMD_DEFAULT << 25)      /**< Shifted mode DEFAULT for SDIO_CLOCKCTRL */
#define SDIO_CLOCKCTRL_SFTRSTDAT                       (0x1UL << 26)                                  /**< Software Reset for DAT Line */
#define _SDIO_CLOCKCTRL_SFTRSTDAT_SHIFT                26                                             /**< Shift value for SDIO_SFTRSTDAT */
#define _SDIO_CLOCKCTRL_SFTRSTDAT_MASK                 0x4000000UL                                    /**< Bit mask for SDIO_SFTRSTDAT */
#define _SDIO_CLOCKCTRL_SFTRSTDAT_DEFAULT              0x00000000UL                                   /**< Mode DEFAULT for SDIO_CLOCKCTRL */
#define SDIO_CLOCKCTRL_SFTRSTDAT_DEFAULT               (_SDIO_CLOCKCTRL_SFTRSTDAT_DEFAULT << 26)      /**< Shifted mode DEFAULT for SDIO_CLOCKCTRL */

/* Bit fields for SDIO IFCR */
#define _SDIO_IFCR_RESETVALUE                          0x00000000UL                               /**< Default value for SDIO_IFCR */
#define _SDIO_IFCR_MASK                                0x13FFF1FFUL                               /**< Mask for SDIO_IFCR */
#define SDIO_IFCR_CMDCOM                               (0x1UL << 0)                               /**< Command Complete */
#define _SDIO_IFCR_CMDCOM_SHIFT                        0                                          /**< Shift value for SDIO_CMDCOM */
#define _SDIO_IFCR_CMDCOM_MASK                         0x1UL                                      /**< Bit mask for SDIO_CMDCOM */
#define _SDIO_IFCR_CMDCOM_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_CMDCOM_DEFAULT                       (_SDIO_IFCR_CMDCOM_DEFAULT << 0)           /**< Shifted mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_TRANCOM                              (0x1UL << 1)                               /**< Transfer Complete */
#define _SDIO_IFCR_TRANCOM_SHIFT                       1                                          /**< Shift value for SDIO_TRANCOM */
#define _SDIO_IFCR_TRANCOM_MASK                        0x2UL                                      /**< Bit mask for SDIO_TRANCOM */
#define _SDIO_IFCR_TRANCOM_DEFAULT                     0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_TRANCOM_DEFAULT                      (_SDIO_IFCR_TRANCOM_DEFAULT << 1)          /**< Shifted mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_BLKGAPEVT                            (0x1UL << 2)                               /**< Block Gap Event */
#define _SDIO_IFCR_BLKGAPEVT_SHIFT                     2                                          /**< Shift value for SDIO_BLKGAPEVT */
#define _SDIO_IFCR_BLKGAPEVT_MASK                      0x4UL                                      /**< Bit mask for SDIO_BLKGAPEVT */
#define _SDIO_IFCR_BLKGAPEVT_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_BLKGAPEVT_DEFAULT                    (_SDIO_IFCR_BLKGAPEVT_DEFAULT << 2)        /**< Shifted mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_DMAINT                               (0x1UL << 3)                               /**< DMA Interrupt */
#define _SDIO_IFCR_DMAINT_SHIFT                        3                                          /**< Shift value for SDIO_DMAINT */
#define _SDIO_IFCR_DMAINT_MASK                         0x8UL                                      /**< Bit mask for SDIO_DMAINT */
#define _SDIO_IFCR_DMAINT_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_DMAINT_DEFAULT                       (_SDIO_IFCR_DMAINT_DEFAULT << 3)           /**< Shifted mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_BFRWRRDY                             (0x1UL << 4)                               /**< Buffer Write Ready */
#define _SDIO_IFCR_BFRWRRDY_SHIFT                      4                                          /**< Shift value for SDIO_BFRWRRDY */
#define _SDIO_IFCR_BFRWRRDY_MASK                       0x10UL                                     /**< Bit mask for SDIO_BFRWRRDY */
#define _SDIO_IFCR_BFRWRRDY_DEFAULT                    0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_BFRWRRDY_DEFAULT                     (_SDIO_IFCR_BFRWRRDY_DEFAULT << 4)         /**< Shifted mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_BFRRDRDY                             (0x1UL << 5)                               /**< Buffer Read Ready */
#define _SDIO_IFCR_BFRRDRDY_SHIFT                      5                                          /**< Shift value for SDIO_BFRRDRDY */
#define _SDIO_IFCR_BFRRDRDY_MASK                       0x20UL                                     /**< Bit mask for SDIO_BFRRDRDY */
#define _SDIO_IFCR_BFRRDRDY_DEFAULT                    0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_BFRRDRDY_DEFAULT                     (_SDIO_IFCR_BFRRDRDY_DEFAULT << 5)         /**< Shifted mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_CARDINS                              (0x1UL << 6)                               /**< Card Insertion */
#define _SDIO_IFCR_CARDINS_SHIFT                       6                                          /**< Shift value for SDIO_CARDINS */
#define _SDIO_IFCR_CARDINS_MASK                        0x40UL                                     /**< Bit mask for SDIO_CARDINS */
#define _SDIO_IFCR_CARDINS_DEFAULT                     0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_CARDINS_DEFAULT                      (_SDIO_IFCR_CARDINS_DEFAULT << 6)          /**< Shifted mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_CARDRM                               (0x1UL << 7)                               /**< Card Removal */
#define _SDIO_IFCR_CARDRM_SHIFT                        7                                          /**< Shift value for SDIO_CARDRM */
#define _SDIO_IFCR_CARDRM_MASK                         0x80UL                                     /**< Bit mask for SDIO_CARDRM */
#define _SDIO_IFCR_CARDRM_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_CARDRM_DEFAULT                       (_SDIO_IFCR_CARDRM_DEFAULT << 7)           /**< Shifted mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_CARDINT                              (0x1UL << 8)                               /**< Card Interrupt */
#define _SDIO_IFCR_CARDINT_SHIFT                       8                                          /**< Shift value for SDIO_CARDINT */
#define _SDIO_IFCR_CARDINT_MASK                        0x100UL                                    /**< Bit mask for SDIO_CARDINT */
#define _SDIO_IFCR_CARDINT_DEFAULT                     0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_CARDINT_DEFAULT                      (_SDIO_IFCR_CARDINT_DEFAULT << 8)          /**< Shifted mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_RETUNINGEVT                          (0x1UL << 12)                              /**< Re-Tunning Event */
#define _SDIO_IFCR_RETUNINGEVT_SHIFT                   12                                         /**< Shift value for SDIO_RETUNINGEVT */
#define _SDIO_IFCR_RETUNINGEVT_MASK                    0x1000UL                                   /**< Bit mask for SDIO_RETUNINGEVT */
#define _SDIO_IFCR_RETUNINGEVT_DEFAULT                 0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_RETUNINGEVT_DEFAULT                  (_SDIO_IFCR_RETUNINGEVT_DEFAULT << 12)     /**< Shifted mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_BOOTACKRCV                           (0x1UL << 13)                              /**< Boot Ack Received */
#define _SDIO_IFCR_BOOTACKRCV_SHIFT                    13                                         /**< Shift value for SDIO_BOOTACKRCV */
#define _SDIO_IFCR_BOOTACKRCV_MASK                     0x2000UL                                   /**< Bit mask for SDIO_BOOTACKRCV */
#define _SDIO_IFCR_BOOTACKRCV_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_BOOTACKRCV_DEFAULT                   (_SDIO_IFCR_BOOTACKRCV_DEFAULT << 13)      /**< Shifted mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_BOOTTERMINATE                        (0x1UL << 14)                              /**< Boot Terminate Interrupt */
#define _SDIO_IFCR_BOOTTERMINATE_SHIFT                 14                                         /**< Shift value for SDIO_BOOTTERMINATE */
#define _SDIO_IFCR_BOOTTERMINATE_MASK                  0x4000UL                                   /**< Bit mask for SDIO_BOOTTERMINATE */
#define _SDIO_IFCR_BOOTTERMINATE_DEFAULT               0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_BOOTTERMINATE_DEFAULT                (_SDIO_IFCR_BOOTTERMINATE_DEFAULT << 14)   /**< Shifted mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_ERRINT                               (0x1UL << 15)                              /**< Error Interrupt */
#define _SDIO_IFCR_ERRINT_SHIFT                        15                                         /**< Shift value for SDIO_ERRINT */
#define _SDIO_IFCR_ERRINT_MASK                         0x8000UL                                   /**< Bit mask for SDIO_ERRINT */
#define _SDIO_IFCR_ERRINT_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_ERRINT_DEFAULT                       (_SDIO_IFCR_ERRINT_DEFAULT << 15)          /**< Shifted mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_CMDTOUTERR                           (0x1UL << 16)                              /**< Command Timeout Error */
#define _SDIO_IFCR_CMDTOUTERR_SHIFT                    16                                         /**< Shift value for SDIO_CMDTOUTERR */
#define _SDIO_IFCR_CMDTOUTERR_MASK                     0x10000UL                                  /**< Bit mask for SDIO_CMDTOUTERR */
#define _SDIO_IFCR_CMDTOUTERR_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_CMDTOUTERR_DEFAULT                   (_SDIO_IFCR_CMDTOUTERR_DEFAULT << 16)      /**< Shifted mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_CMDCRCERR                            (0x1UL << 17)                              /**< CMD CRC Error */
#define _SDIO_IFCR_CMDCRCERR_SHIFT                     17                                         /**< Shift value for SDIO_CMDCRCERR */
#define _SDIO_IFCR_CMDCRCERR_MASK                      0x20000UL                                  /**< Bit mask for SDIO_CMDCRCERR */
#define _SDIO_IFCR_CMDCRCERR_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_CMDCRCERR_DEFAULT                    (_SDIO_IFCR_CMDCRCERR_DEFAULT << 17)       /**< Shifted mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_CMDENDBITERR                         (0x1UL << 18)                              /**< Command End Bit Error */
#define _SDIO_IFCR_CMDENDBITERR_SHIFT                  18                                         /**< Shift value for SDIO_CMDENDBITERR */
#define _SDIO_IFCR_CMDENDBITERR_MASK                   0x40000UL                                  /**< Bit mask for SDIO_CMDENDBITERR */
#define _SDIO_IFCR_CMDENDBITERR_DEFAULT                0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_CMDENDBITERR_DEFAULT                 (_SDIO_IFCR_CMDENDBITERR_DEFAULT << 18)    /**< Shifted mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_CMDINDEXERR                          (0x1UL << 19)                              /**< Command Index Error */
#define _SDIO_IFCR_CMDINDEXERR_SHIFT                   19                                         /**< Shift value for SDIO_CMDINDEXERR */
#define _SDIO_IFCR_CMDINDEXERR_MASK                    0x80000UL                                  /**< Bit mask for SDIO_CMDINDEXERR */
#define _SDIO_IFCR_CMDINDEXERR_DEFAULT                 0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_CMDINDEXERR_DEFAULT                  (_SDIO_IFCR_CMDINDEXERR_DEFAULT << 19)     /**< Shifted mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_DATTOUTERR                           (0x1UL << 20)                              /**< Data Time-out Error */
#define _SDIO_IFCR_DATTOUTERR_SHIFT                    20                                         /**< Shift value for SDIO_DATTOUTERR */
#define _SDIO_IFCR_DATTOUTERR_MASK                     0x100000UL                                 /**< Bit mask for SDIO_DATTOUTERR */
#define _SDIO_IFCR_DATTOUTERR_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_DATTOUTERR_DEFAULT                   (_SDIO_IFCR_DATTOUTERR_DEFAULT << 20)      /**< Shifted mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_DATCRCERR                            (0x1UL << 21)                              /**< Data CRC Error */
#define _SDIO_IFCR_DATCRCERR_SHIFT                     21                                         /**< Shift value for SDIO_DATCRCERR */
#define _SDIO_IFCR_DATCRCERR_MASK                      0x200000UL                                 /**< Bit mask for SDIO_DATCRCERR */
#define _SDIO_IFCR_DATCRCERR_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_DATCRCERR_DEFAULT                    (_SDIO_IFCR_DATCRCERR_DEFAULT << 21)       /**< Shifted mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_DATENDBITERR                         (0x1UL << 22)                              /**< Data End Bit Error */
#define _SDIO_IFCR_DATENDBITERR_SHIFT                  22                                         /**< Shift value for SDIO_DATENDBITERR */
#define _SDIO_IFCR_DATENDBITERR_MASK                   0x400000UL                                 /**< Bit mask for SDIO_DATENDBITERR */
#define _SDIO_IFCR_DATENDBITERR_DEFAULT                0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_DATENDBITERR_DEFAULT                 (_SDIO_IFCR_DATENDBITERR_DEFAULT << 22)    /**< Shifted mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_CURRENTLIMITERR                      (0x1UL << 23)                              /**< Current Limit Error */
#define _SDIO_IFCR_CURRENTLIMITERR_SHIFT               23                                         /**< Shift value for SDIO_CURRENTLIMITERR */
#define _SDIO_IFCR_CURRENTLIMITERR_MASK                0x800000UL                                 /**< Bit mask for SDIO_CURRENTLIMITERR */
#define _SDIO_IFCR_CURRENTLIMITERR_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_CURRENTLIMITERR_DEFAULT              (_SDIO_IFCR_CURRENTLIMITERR_DEFAULT << 23) /**< Shifted mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_AUTOCMDERR                           (0x1UL << 24)                              /**< Auto CMD Error */
#define _SDIO_IFCR_AUTOCMDERR_SHIFT                    24                                         /**< Shift value for SDIO_AUTOCMDERR */
#define _SDIO_IFCR_AUTOCMDERR_MASK                     0x1000000UL                                /**< Bit mask for SDIO_AUTOCMDERR */
#define _SDIO_IFCR_AUTOCMDERR_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_AUTOCMDERR_DEFAULT                   (_SDIO_IFCR_AUTOCMDERR_DEFAULT << 24)      /**< Shifted mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_ADMAERR                              (0x1UL << 25)                              /**< ADMA Error */
#define _SDIO_IFCR_ADMAERR_SHIFT                       25                                         /**< Shift value for SDIO_ADMAERR */
#define _SDIO_IFCR_ADMAERR_MASK                        0x2000000UL                                /**< Bit mask for SDIO_ADMAERR */
#define _SDIO_IFCR_ADMAERR_DEFAULT                     0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_ADMAERR_DEFAULT                      (_SDIO_IFCR_ADMAERR_DEFAULT << 25)         /**< Shifted mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_TARGETRESP                           (0x1UL << 28)                              /**<  Specific  Error STAT */
#define _SDIO_IFCR_TARGETRESP_SHIFT                    28                                         /**< Shift value for SDIO_TARGETRESP */
#define _SDIO_IFCR_TARGETRESP_MASK                     0x10000000UL                               /**< Bit mask for SDIO_TARGETRESP */
#define _SDIO_IFCR_TARGETRESP_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for SDIO_IFCR */
#define SDIO_IFCR_TARGETRESP_DEFAULT                   (_SDIO_IFCR_TARGETRESP_DEFAULT << 28)      /**< Shifted mode DEFAULT for SDIO_IFCR */

