RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_sdio.h
/* Bit fields for SDIO IFENC */
#define _SDIO_IFENC_RESETVALUE                         0x00000000UL                                  /**< Default value for SDIO_IFENC */
#define _SDIO_IFENC_MASK                               0x17FF71FFUL                                  /**< Mask for SDIO_IFENC */
#define SDIO_IFENC_CMDCOMEN                            (0x1UL << 0)                                  /**< Command Complete Signal Enable */
#define _SDIO_IFENC_CMDCOMEN_SHIFT                     0                                             /**< Shift value for SDIO_CMDCOMEN */
#define _SDIO_IFENC_CMDCOMEN_MASK                      0x1UL                                         /**< Bit mask for SDIO_CMDCOMEN */
#define _SDIO_IFENC_CMDCOMEN_DEFAULT                   0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_CMDCOMEN_DEFAULT                    (_SDIO_IFENC_CMDCOMEN_DEFAULT << 0)           /**< Shifted mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_TRANCOMEN                           (0x1UL << 1)                                  /**< Transfer Complete Signal Enable */
#define _SDIO_IFENC_TRANCOMEN_SHIFT                    1                                             /**< Shift value for SDIO_TRANCOMEN */
#define _SDIO_IFENC_TRANCOMEN_MASK                     0x2UL                                         /**< Bit mask for SDIO_TRANCOMEN */
#define _SDIO_IFENC_TRANCOMEN_DEFAULT                  0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_TRANCOMEN_DEFAULT                   (_SDIO_IFENC_TRANCOMEN_DEFAULT << 1)          /**< Shifted mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_BLKGAPEVTEN                         (0x1UL << 2)                                  /**< Block Gap Event Signal Enable */
#define _SDIO_IFENC_BLKGAPEVTEN_SHIFT                  2                                             /**< Shift value for SDIO_BLKGAPEVTEN */
#define _SDIO_IFENC_BLKGAPEVTEN_MASK                   0x4UL                                         /**< Bit mask for SDIO_BLKGAPEVTEN */
#define _SDIO_IFENC_BLKGAPEVTEN_DEFAULT                0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_BLKGAPEVTEN_DEFAULT                 (_SDIO_IFENC_BLKGAPEVTEN_DEFAULT << 2)        /**< Shifted mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_DMAINTEN                            (0x1UL << 3)                                  /**< DMA Interrupt Signal Enable */
#define _SDIO_IFENC_DMAINTEN_SHIFT                     3                                             /**< Shift value for SDIO_DMAINTEN */
#define _SDIO_IFENC_DMAINTEN_MASK                      0x8UL                                         /**< Bit mask for SDIO_DMAINTEN */
#define _SDIO_IFENC_DMAINTEN_DEFAULT                   0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_DMAINTEN_DEFAULT                    (_SDIO_IFENC_DMAINTEN_DEFAULT << 3)           /**< Shifted mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_BUFWRRDYEN                          (0x1UL << 4)                                  /**< Buffer Write Ready Signal Enable */
#define _SDIO_IFENC_BUFWRRDYEN_SHIFT                   4                                             /**< Shift value for SDIO_BUFWRRDYEN */
#define _SDIO_IFENC_BUFWRRDYEN_MASK                    0x10UL                                        /**< Bit mask for SDIO_BUFWRRDYEN */
#define _SDIO_IFENC_BUFWRRDYEN_DEFAULT                 0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_BUFWRRDYEN_DEFAULT                  (_SDIO_IFENC_BUFWRRDYEN_DEFAULT << 4)         /**< Shifted mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_BUFRDRDYEN                          (0x1UL << 5)                                  /**< Buffer Read Ready Signal Enable */
#define _SDIO_IFENC_BUFRDRDYEN_SHIFT                   5                                             /**< Shift value for SDIO_BUFRDRDYEN */
#define _SDIO_IFENC_BUFRDRDYEN_MASK                    0x20UL                                        /**< Bit mask for SDIO_BUFRDRDYEN */
#define _SDIO_IFENC_BUFRDRDYEN_DEFAULT                 0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_BUFRDRDYEN_DEFAULT                  (_SDIO_IFENC_BUFRDRDYEN_DEFAULT << 5)         /**< Shifted mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_CARDINSEN                           (0x1UL << 6)                                  /**< Card Insertion Signal Enable */
#define _SDIO_IFENC_CARDINSEN_SHIFT                    6                                             /**< Shift value for SDIO_CARDINSEN */
#define _SDIO_IFENC_CARDINSEN_MASK                     0x40UL                                        /**< Bit mask for SDIO_CARDINSEN */
#define _SDIO_IFENC_CARDINSEN_DEFAULT                  0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_CARDINSEN_DEFAULT                   (_SDIO_IFENC_CARDINSEN_DEFAULT << 6)          /**< Shifted mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_CARDRMEN                            (0x1UL << 7)                                  /**< Card Removal Signal Enable */
#define _SDIO_IFENC_CARDRMEN_SHIFT                     7                                             /**< Shift value for SDIO_CARDRMEN */
#define _SDIO_IFENC_CARDRMEN_MASK                      0x80UL                                        /**< Bit mask for SDIO_CARDRMEN */
#define _SDIO_IFENC_CARDRMEN_DEFAULT                   0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_CARDRMEN_DEFAULT                    (_SDIO_IFENC_CARDRMEN_DEFAULT << 7)           /**< Shifted mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_CARDINTEN                           (0x1UL << 8)                                  /**< Card Interrupt Signal Enable */
#define _SDIO_IFENC_CARDINTEN_SHIFT                    8                                             /**< Shift value for SDIO_CARDINTEN */
#define _SDIO_IFENC_CARDINTEN_MASK                     0x100UL                                       /**< Bit mask for SDIO_CARDINTEN */
#define _SDIO_IFENC_CARDINTEN_DEFAULT                  0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_CARDINTEN_DEFAULT                   (_SDIO_IFENC_CARDINTEN_DEFAULT << 8)          /**< Shifted mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_RETUNINGEVTEN                       (0x1UL << 12)                                 /**< Re-Tunning Event Signal Enable */
#define _SDIO_IFENC_RETUNINGEVTEN_SHIFT                12                                            /**< Shift value for SDIO_RETUNINGEVTEN */
#define _SDIO_IFENC_RETUNINGEVTEN_MASK                 0x1000UL                                      /**< Bit mask for SDIO_RETUNINGEVTEN */
#define _SDIO_IFENC_RETUNINGEVTEN_DEFAULT              0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_RETUNINGEVTEN_DEFAULT               (_SDIO_IFENC_RETUNINGEVTEN_DEFAULT << 12)     /**< Shifted mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_BOOTACKRCVEN                        (0x1UL << 13)                                 /**< Boot Ack Received Signal Enable */
#define _SDIO_IFENC_BOOTACKRCVEN_SHIFT                 13                                            /**< Shift value for SDIO_BOOTACKRCVEN */
#define _SDIO_IFENC_BOOTACKRCVEN_MASK                  0x2000UL                                      /**< Bit mask for SDIO_BOOTACKRCVEN */
#define _SDIO_IFENC_BOOTACKRCVEN_DEFAULT               0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_BOOTACKRCVEN_DEFAULT                (_SDIO_IFENC_BOOTACKRCVEN_DEFAULT << 13)      /**< Shifted mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_BOOTTERMINATEEN                     (0x1UL << 14)                                 /**< Boot Terminate Interrupt Signal Enable */
#define _SDIO_IFENC_BOOTTERMINATEEN_SHIFT              14                                            /**< Shift value for SDIO_BOOTTERMINATEEN */
#define _SDIO_IFENC_BOOTTERMINATEEN_MASK               0x4000UL                                      /**< Bit mask for SDIO_BOOTTERMINATEEN */
#define _SDIO_IFENC_BOOTTERMINATEEN_DEFAULT            0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_BOOTTERMINATEEN_DEFAULT             (_SDIO_IFENC_BOOTTERMINATEEN_DEFAULT << 14)   /**< Shifted mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_CMDTOUTERREN                        (0x1UL << 16)                                 /**< Command Time-out Error Status Enable */
#define _SDIO_IFENC_CMDTOUTERREN_SHIFT                 16                                            /**< Shift value for SDIO_CMDTOUTERREN */
#define _SDIO_IFENC_CMDTOUTERREN_MASK                  0x10000UL                                     /**< Bit mask for SDIO_CMDTOUTERREN */
#define _SDIO_IFENC_CMDTOUTERREN_DEFAULT               0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_CMDTOUTERREN_DEFAULT                (_SDIO_IFENC_CMDTOUTERREN_DEFAULT << 16)      /**< Shifted mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_CMDCRCERREN                         (0x1UL << 17)                                 /**< Command CRC Error Status Enable */
#define _SDIO_IFENC_CMDCRCERREN_SHIFT                  17                                            /**< Shift value for SDIO_CMDCRCERREN */
#define _SDIO_IFENC_CMDCRCERREN_MASK                   0x20000UL                                     /**< Bit mask for SDIO_CMDCRCERREN */
#define _SDIO_IFENC_CMDCRCERREN_DEFAULT                0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_CMDCRCERREN_DEFAULT                 (_SDIO_IFENC_CMDCRCERREN_DEFAULT << 17)       /**< Shifted mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_CMDENDBITERREN                      (0x1UL << 18)                                 /**< Command End Bit Error Status Enable */
#define _SDIO_IFENC_CMDENDBITERREN_SHIFT               18                                            /**< Shift value for SDIO_CMDENDBITERREN */
#define _SDIO_IFENC_CMDENDBITERREN_MASK                0x40000UL                                     /**< Bit mask for SDIO_CMDENDBITERREN */
#define _SDIO_IFENC_CMDENDBITERREN_DEFAULT             0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_CMDENDBITERREN_DEFAULT              (_SDIO_IFENC_CMDENDBITERREN_DEFAULT << 18)    /**< Shifted mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_CMDINDEXERREN                       (0x1UL << 19)                                 /**< Command Index Error Status Enable */
#define _SDIO_IFENC_CMDINDEXERREN_SHIFT                19                                            /**< Shift value for SDIO_CMDINDEXERREN */
#define _SDIO_IFENC_CMDINDEXERREN_MASK                 0x80000UL                                     /**< Bit mask for SDIO_CMDINDEXERREN */
#define _SDIO_IFENC_CMDINDEXERREN_DEFAULT              0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_CMDINDEXERREN_DEFAULT               (_SDIO_IFENC_CMDINDEXERREN_DEFAULT << 19)     /**< Shifted mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_DATTOUTERREN                        (0x1UL << 20)                                 /**< Data Timeout Error Status Enable */
#define _SDIO_IFENC_DATTOUTERREN_SHIFT                 20                                            /**< Shift value for SDIO_DATTOUTERREN */
#define _SDIO_IFENC_DATTOUTERREN_MASK                  0x100000UL                                    /**< Bit mask for SDIO_DATTOUTERREN */
#define _SDIO_IFENC_DATTOUTERREN_DEFAULT               0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_DATTOUTERREN_DEFAULT                (_SDIO_IFENC_DATTOUTERREN_DEFAULT << 20)      /**< Shifted mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_DATCRCERREN                         (0x1UL << 21)                                 /**< Data CRC Error Status Enable */
#define _SDIO_IFENC_DATCRCERREN_SHIFT                  21                                            /**< Shift value for SDIO_DATCRCERREN */
#define _SDIO_IFENC_DATCRCERREN_MASK                   0x200000UL                                    /**< Bit mask for SDIO_DATCRCERREN */
#define _SDIO_IFENC_DATCRCERREN_DEFAULT                0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_DATCRCERREN_DEFAULT                 (_SDIO_IFENC_DATCRCERREN_DEFAULT << 21)       /**< Shifted mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_DATENDBITERREN                      (0x1UL << 22)                                 /**< Data End Bit Error Status Enable */
#define _SDIO_IFENC_DATENDBITERREN_SHIFT               22                                            /**< Shift value for SDIO_DATENDBITERREN */
#define _SDIO_IFENC_DATENDBITERREN_MASK                0x400000UL                                    /**< Bit mask for SDIO_DATENDBITERREN */
#define _SDIO_IFENC_DATENDBITERREN_DEFAULT             0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_DATENDBITERREN_DEFAULT              (_SDIO_IFENC_DATENDBITERREN_DEFAULT << 22)    /**< Shifted mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_CURRENTLIMITERREN                   (0x1UL << 23)                                 /**< Current Limit Error Status Enable */
#define _SDIO_IFENC_CURRENTLIMITERREN_SHIFT            23                                            /**< Shift value for SDIO_CURRENTLIMITERREN */
#define _SDIO_IFENC_CURRENTLIMITERREN_MASK             0x800000UL                                    /**< Bit mask for SDIO_CURRENTLIMITERREN */
#define _SDIO_IFENC_CURRENTLIMITERREN_DEFAULT          0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_CURRENTLIMITERREN_DEFAULT           (_SDIO_IFENC_CURRENTLIMITERREN_DEFAULT << 23) /**< Shifted mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_AUTOCMDERREN                        (0x1UL << 24)                                 /**< Auto CMD12 Error Status Enable */
#define _SDIO_IFENC_AUTOCMDERREN_SHIFT                 24                                            /**< Shift value for SDIO_AUTOCMDERREN */
#define _SDIO_IFENC_AUTOCMDERREN_MASK                  0x1000000UL                                   /**< Bit mask for SDIO_AUTOCMDERREN */
#define _SDIO_IFENC_AUTOCMDERREN_DEFAULT               0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_AUTOCMDERREN_DEFAULT                (_SDIO_IFENC_AUTOCMDERREN_DEFAULT << 24)      /**< Shifted mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_ADMAERREN                           (0x1UL << 25)                                 /**< ADMA Error Status Enable */
#define _SDIO_IFENC_ADMAERREN_SHIFT                    25                                            /**< Shift value for SDIO_ADMAERREN */
#define _SDIO_IFENC_ADMAERREN_MASK                     0x2000000UL                                   /**< Bit mask for SDIO_ADMAERREN */
#define _SDIO_IFENC_ADMAERREN_DEFAULT                  0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_ADMAERREN_DEFAULT                   (_SDIO_IFENC_ADMAERREN_DEFAULT << 25)         /**< Shifted mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_TUNINGERREN                         (0x1UL << 26)                                 /**< Tuning Error Status Enable */
#define _SDIO_IFENC_TUNINGERREN_SHIFT                  26                                            /**< Shift value for SDIO_TUNINGERREN */
#define _SDIO_IFENC_TUNINGERREN_MASK                   0x4000000UL                                   /**< Bit mask for SDIO_TUNINGERREN */
#define _SDIO_IFENC_TUNINGERREN_DEFAULT                0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_TUNINGERREN_DEFAULT                 (_SDIO_IFENC_TUNINGERREN_DEFAULT << 26)       /**< Shifted mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_TARGETRESPEN                        (0x1UL << 28)                                 /**< Target Response/Host Error Status Enable */
#define _SDIO_IFENC_TARGETRESPEN_SHIFT                 28                                            /**< Shift value for SDIO_TARGETRESPEN */
#define _SDIO_IFENC_TARGETRESPEN_MASK                  0x10000000UL                                  /**< Bit mask for SDIO_TARGETRESPEN */
#define _SDIO_IFENC_TARGETRESPEN_DEFAULT               0x00000000UL                                  /**< Mode DEFAULT for SDIO_IFENC */
#define SDIO_IFENC_TARGETRESPEN_DEFAULT                (_SDIO_IFENC_TARGETRESPEN_DEFAULT << 28)      /**< Shifted mode DEFAULT for SDIO_IFENC */

