RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_sdio.h
/* Bit fields for SDIO IEN */
#define _SDIO_IEN_RESETVALUE                           0x00000000UL                                    /**< Default value for SDIO_IEN */
#define _SDIO_IEN_MASK                                 0x17FF71FFUL                                    /**< Mask for SDIO_IEN */
#define SDIO_IEN_CMDCOMSEN                             (0x1UL << 0)                                    /**< Command Complete Signal Enable */
#define _SDIO_IEN_CMDCOMSEN_SHIFT                      0                                               /**< Shift value for SDIO_CMDCOMSEN */
#define _SDIO_IEN_CMDCOMSEN_MASK                       0x1UL                                           /**< Bit mask for SDIO_CMDCOMSEN */
#define _SDIO_IEN_CMDCOMSEN_DEFAULT                    0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_CMDCOMSEN_DEFAULT                     (_SDIO_IEN_CMDCOMSEN_DEFAULT << 0)              /**< Shifted mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_TRANCOMSEN                            (0x1UL << 1)                                    /**< Transfer Complete Signal Enable */
#define _SDIO_IEN_TRANCOMSEN_SHIFT                     1                                               /**< Shift value for SDIO_TRANCOMSEN */
#define _SDIO_IEN_TRANCOMSEN_MASK                      0x2UL                                           /**< Bit mask for SDIO_TRANCOMSEN */
#define _SDIO_IEN_TRANCOMSEN_DEFAULT                   0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_TRANCOMSEN_DEFAULT                    (_SDIO_IEN_TRANCOMSEN_DEFAULT << 1)             /**< Shifted mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_BLKGAPEVTSEN                          (0x1UL << 2)                                    /**< Block Gap Event Signal Enable */
#define _SDIO_IEN_BLKGAPEVTSEN_SHIFT                   2                                               /**< Shift value for SDIO_BLKGAPEVTSEN */
#define _SDIO_IEN_BLKGAPEVTSEN_MASK                    0x4UL                                           /**< Bit mask for SDIO_BLKGAPEVTSEN */
#define _SDIO_IEN_BLKGAPEVTSEN_DEFAULT                 0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_BLKGAPEVTSEN_DEFAULT                  (_SDIO_IEN_BLKGAPEVTSEN_DEFAULT << 2)           /**< Shifted mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_DMAINTSEN                             (0x1UL << 3)                                    /**< DMA Interrupt Signal Enable */
#define _SDIO_IEN_DMAINTSEN_SHIFT                      3                                               /**< Shift value for SDIO_DMAINTSEN */
#define _SDIO_IEN_DMAINTSEN_MASK                       0x8UL                                           /**< Bit mask for SDIO_DMAINTSEN */
#define _SDIO_IEN_DMAINTSEN_DEFAULT                    0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_DMAINTSEN_DEFAULT                     (_SDIO_IEN_DMAINTSEN_DEFAULT << 3)              /**< Shifted mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_BUFWRRDYSEN                           (0x1UL << 4)                                    /**< Buffer Write Ready Signal Enable */
#define _SDIO_IEN_BUFWRRDYSEN_SHIFT                    4                                               /**< Shift value for SDIO_BUFWRRDYSEN */
#define _SDIO_IEN_BUFWRRDYSEN_MASK                     0x10UL                                          /**< Bit mask for SDIO_BUFWRRDYSEN */
#define _SDIO_IEN_BUFWRRDYSEN_DEFAULT                  0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_BUFWRRDYSEN_DEFAULT                   (_SDIO_IEN_BUFWRRDYSEN_DEFAULT << 4)            /**< Shifted mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_BUFRDRDYSEN                           (0x1UL << 5)                                    /**< Buffer Read Ready Signal Enable */
#define _SDIO_IEN_BUFRDRDYSEN_SHIFT                    5                                               /**< Shift value for SDIO_BUFRDRDYSEN */
#define _SDIO_IEN_BUFRDRDYSEN_MASK                     0x20UL                                          /**< Bit mask for SDIO_BUFRDRDYSEN */
#define _SDIO_IEN_BUFRDRDYSEN_DEFAULT                  0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_BUFRDRDYSEN_DEFAULT                   (_SDIO_IEN_BUFRDRDYSEN_DEFAULT << 5)            /**< Shifted mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_CARDINSSEN                            (0x1UL << 6)                                    /**< Card Insertion Signal Enable */
#define _SDIO_IEN_CARDINSSEN_SHIFT                     6                                               /**< Shift value for SDIO_CARDINSSEN */
#define _SDIO_IEN_CARDINSSEN_MASK                      0x40UL                                          /**< Bit mask for SDIO_CARDINSSEN */
#define _SDIO_IEN_CARDINSSEN_DEFAULT                   0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_CARDINSSEN_DEFAULT                    (_SDIO_IEN_CARDINSSEN_DEFAULT << 6)             /**< Shifted mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_CARDREMSEN                            (0x1UL << 7)                                    /**< Card Removal Signal Enable */
#define _SDIO_IEN_CARDREMSEN_SHIFT                     7                                               /**< Shift value for SDIO_CARDREMSEN */
#define _SDIO_IEN_CARDREMSEN_MASK                      0x80UL                                          /**< Bit mask for SDIO_CARDREMSEN */
#define _SDIO_IEN_CARDREMSEN_DEFAULT                   0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_CARDREMSEN_DEFAULT                    (_SDIO_IEN_CARDREMSEN_DEFAULT << 7)             /**< Shifted mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_CARDINTSEN                            (0x1UL << 8)                                    /**< Card Interrupt Signal Enable */
#define _SDIO_IEN_CARDINTSEN_SHIFT                     8                                               /**< Shift value for SDIO_CARDINTSEN */
#define _SDIO_IEN_CARDINTSEN_MASK                      0x100UL                                         /**< Bit mask for SDIO_CARDINTSEN */
#define _SDIO_IEN_CARDINTSEN_DEFAULT                   0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_CARDINTSEN_DEFAULT                    (_SDIO_IEN_CARDINTSEN_DEFAULT << 8)             /**< Shifted mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_RETUNINGEVTSEN                        (0x1UL << 12)                                   /**< Re-Tuning Event Signal Enable */
#define _SDIO_IEN_RETUNINGEVTSEN_SHIFT                 12                                              /**< Shift value for SDIO_RETUNINGEVTSEN */
#define _SDIO_IEN_RETUNINGEVTSEN_MASK                  0x1000UL                                        /**< Bit mask for SDIO_RETUNINGEVTSEN */
#define _SDIO_IEN_RETUNINGEVTSEN_DEFAULT               0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_RETUNINGEVTSEN_DEFAULT                (_SDIO_IEN_RETUNINGEVTSEN_DEFAULT << 12)        /**< Shifted mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_BOOTACKRCVSEN                         (0x1UL << 13)                                   /**< Boot Ack Received Signal Enable */
#define _SDIO_IEN_BOOTACKRCVSEN_SHIFT                  13                                              /**< Shift value for SDIO_BOOTACKRCVSEN */
#define _SDIO_IEN_BOOTACKRCVSEN_MASK                   0x2000UL                                        /**< Bit mask for SDIO_BOOTACKRCVSEN */
#define _SDIO_IEN_BOOTACKRCVSEN_DEFAULT                0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_BOOTACKRCVSEN_DEFAULT                 (_SDIO_IEN_BOOTACKRCVSEN_DEFAULT << 13)         /**< Shifted mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_BOOTTERMINATESEN                      (0x1UL << 14)                                   /**< Boot Terminate Interrupt Signal Enable */
#define _SDIO_IEN_BOOTTERMINATESEN_SHIFT               14                                              /**< Shift value for SDIO_BOOTTERMINATESEN */
#define _SDIO_IEN_BOOTTERMINATESEN_MASK                0x4000UL                                        /**< Bit mask for SDIO_BOOTTERMINATESEN */
#define _SDIO_IEN_BOOTTERMINATESEN_DEFAULT             0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_BOOTTERMINATESEN_DEFAULT              (_SDIO_IEN_BOOTTERMINATESEN_DEFAULT << 14)      /**< Shifted mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_CMDTOUTERRSEN                         (0x1UL << 16)                                   /**< Command Timeout Error Signal Enable */
#define _SDIO_IEN_CMDTOUTERRSEN_SHIFT                  16                                              /**< Shift value for SDIO_CMDTOUTERRSEN */
#define _SDIO_IEN_CMDTOUTERRSEN_MASK                   0x10000UL                                       /**< Bit mask for SDIO_CMDTOUTERRSEN */
#define _SDIO_IEN_CMDTOUTERRSEN_DEFAULT                0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_CMDTOUTERRSEN_DEFAULT                 (_SDIO_IEN_CMDTOUTERRSEN_DEFAULT << 16)         /**< Shifted mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_CMDCRCERRSEN                          (0x1UL << 17)                                   /**< Command CRC Error Signal Enable */
#define _SDIO_IEN_CMDCRCERRSEN_SHIFT                   17                                              /**< Shift value for SDIO_CMDCRCERRSEN */
#define _SDIO_IEN_CMDCRCERRSEN_MASK                    0x20000UL                                       /**< Bit mask for SDIO_CMDCRCERRSEN */
#define _SDIO_IEN_CMDCRCERRSEN_DEFAULT                 0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_CMDCRCERRSEN_DEFAULT                  (_SDIO_IEN_CMDCRCERRSEN_DEFAULT << 17)          /**< Shifted mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_CMDENDBITERRSEN                       (0x1UL << 18)                                   /**< Command End Bit Error Signal Enable */
#define _SDIO_IEN_CMDENDBITERRSEN_SHIFT                18                                              /**< Shift value for SDIO_CMDENDBITERRSEN */
#define _SDIO_IEN_CMDENDBITERRSEN_MASK                 0x40000UL                                       /**< Bit mask for SDIO_CMDENDBITERRSEN */
#define _SDIO_IEN_CMDENDBITERRSEN_DEFAULT              0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_CMDENDBITERRSEN_DEFAULT               (_SDIO_IEN_CMDENDBITERRSEN_DEFAULT << 18)       /**< Shifted mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_CMDINDEXERRSEN                        (0x1UL << 19)                                   /**< Command Index Error Signal Enable */
#define _SDIO_IEN_CMDINDEXERRSEN_SHIFT                 19                                              /**< Shift value for SDIO_CMDINDEXERRSEN */
#define _SDIO_IEN_CMDINDEXERRSEN_MASK                  0x80000UL                                       /**< Bit mask for SDIO_CMDINDEXERRSEN */
#define _SDIO_IEN_CMDINDEXERRSEN_DEFAULT               0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_CMDINDEXERRSEN_DEFAULT                (_SDIO_IEN_CMDINDEXERRSEN_DEFAULT << 19)        /**< Shifted mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_DATTOUTERRSEN                         (0x1UL << 20)                                   /**< Data Timeout Error Signal Enable */
#define _SDIO_IEN_DATTOUTERRSEN_SHIFT                  20                                              /**< Shift value for SDIO_DATTOUTERRSEN */
#define _SDIO_IEN_DATTOUTERRSEN_MASK                   0x100000UL                                      /**< Bit mask for SDIO_DATTOUTERRSEN */
#define _SDIO_IEN_DATTOUTERRSEN_DEFAULT                0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_DATTOUTERRSEN_DEFAULT                 (_SDIO_IEN_DATTOUTERRSEN_DEFAULT << 20)         /**< Shifted mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_DATCRCERRSEN                          (0x1UL << 21)                                   /**< Data CRC Error Signal Enable */
#define _SDIO_IEN_DATCRCERRSEN_SHIFT                   21                                              /**< Shift value for SDIO_DATCRCERRSEN */
#define _SDIO_IEN_DATCRCERRSEN_MASK                    0x200000UL                                      /**< Bit mask for SDIO_DATCRCERRSEN */
#define _SDIO_IEN_DATCRCERRSEN_DEFAULT                 0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_DATCRCERRSEN_DEFAULT                  (_SDIO_IEN_DATCRCERRSEN_DEFAULT << 21)          /**< Shifted mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_DATENDBITERRSEN                       (0x1UL << 22)                                   /**< Data End Bit Error Signal Enable */
#define _SDIO_IEN_DATENDBITERRSEN_SHIFT                22                                              /**< Shift value for SDIO_DATENDBITERRSEN */
#define _SDIO_IEN_DATENDBITERRSEN_MASK                 0x400000UL                                      /**< Bit mask for SDIO_DATENDBITERRSEN */
#define _SDIO_IEN_DATENDBITERRSEN_DEFAULT              0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_DATENDBITERRSEN_DEFAULT               (_SDIO_IEN_DATENDBITERRSEN_DEFAULT << 22)       /**< Shifted mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_CURRENTLIMITERRSEN                    (0x1UL << 23)                                   /**< Current Limit Error Signal Enable */
#define _SDIO_IEN_CURRENTLIMITERRSEN_SHIFT             23                                              /**< Shift value for SDIO_CURRENTLIMITERRSEN */
#define _SDIO_IEN_CURRENTLIMITERRSEN_MASK              0x800000UL                                      /**< Bit mask for SDIO_CURRENTLIMITERRSEN */
#define _SDIO_IEN_CURRENTLIMITERRSEN_DEFAULT           0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_CURRENTLIMITERRSEN_DEFAULT            (_SDIO_IEN_CURRENTLIMITERRSEN_DEFAULT << 23)    /**< Shifted mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_AUTOCMDERRSEN                         (0x1UL << 24)                                   /**< Auto CMD12 Error Signal Enable */
#define _SDIO_IEN_AUTOCMDERRSEN_SHIFT                  24                                              /**< Shift value for SDIO_AUTOCMDERRSEN */
#define _SDIO_IEN_AUTOCMDERRSEN_MASK                   0x1000000UL                                     /**< Bit mask for SDIO_AUTOCMDERRSEN */
#define _SDIO_IEN_AUTOCMDERRSEN_DEFAULT                0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_AUTOCMDERRSEN_DEFAULT                 (_SDIO_IEN_AUTOCMDERRSEN_DEFAULT << 24)         /**< Shifted mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_ADMAERRSEN                            (0x1UL << 25)                                   /**< ADMA Error Signal Enable */
#define _SDIO_IEN_ADMAERRSEN_SHIFT                     25                                              /**< Shift value for SDIO_ADMAERRSEN */
#define _SDIO_IEN_ADMAERRSEN_MASK                      0x2000000UL                                     /**< Bit mask for SDIO_ADMAERRSEN */
#define _SDIO_IEN_ADMAERRSEN_DEFAULT                   0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_ADMAERRSEN_DEFAULT                    (_SDIO_IEN_ADMAERRSEN_DEFAULT << 25)            /**< Shifted mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_TUNINGERRSIGNALENABLE                 (0x1UL << 26)                                   /**< Tuning Error Signal Enable */
#define _SDIO_IEN_TUNINGERRSIGNALENABLE_SHIFT          26                                              /**< Shift value for SDIO_TUNINGERRSIGNALENABLE */
#define _SDIO_IEN_TUNINGERRSIGNALENABLE_MASK           0x4000000UL                                     /**< Bit mask for SDIO_TUNINGERRSIGNALENABLE */
#define _SDIO_IEN_TUNINGERRSIGNALENABLE_DEFAULT        0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_TUNINGERRSIGNALENABLE_DEFAULT         (_SDIO_IEN_TUNINGERRSIGNALENABLE_DEFAULT << 26) /**< Shifted mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_TARGETRESPERRSEN                      (0x1UL << 28)                                   /**< Target Response Error Signal Enable */
#define _SDIO_IEN_TARGETRESPERRSEN_SHIFT               28                                              /**< Shift value for SDIO_TARGETRESPERRSEN */
#define _SDIO_IEN_TARGETRESPERRSEN_MASK                0x10000000UL                                    /**< Bit mask for SDIO_TARGETRESPERRSEN */
#define _SDIO_IEN_TARGETRESPERRSEN_DEFAULT             0x00000000UL                                    /**< Mode DEFAULT for SDIO_IEN */
#define SDIO_IEN_TARGETRESPERRSEN_DEFAULT              (_SDIO_IEN_TARGETRESPERRSEN_DEFAULT << 28)      /**< Shifted mode DEFAULT for SDIO_IEN */

