RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_sdio.h
/* Bit fields for SDIO CAPAB0 */
#define _SDIO_CAPAB0_RESETVALUE                        0x00000000UL                                /**< Default value for SDIO_CAPAB0 */
#define _SDIO_CAPAB0_MASK                              0xF7EFFFBFUL                                /**< Mask for SDIO_CAPAB0 */
#define _SDIO_CAPAB0_TMOUTCLKFREQ_SHIFT                0                                           /**< Shift value for SDIO_TMOUTCLKFREQ */
#define _SDIO_CAPAB0_TMOUTCLKFREQ_MASK                 0x3FUL                                      /**< Bit mask for SDIO_TMOUTCLKFREQ */
#define _SDIO_CAPAB0_TMOUTCLKFREQ_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_TMOUTCLKFREQ_DEFAULT               (_SDIO_CAPAB0_TMOUTCLKFREQ_DEFAULT << 0)    /**< Shifted mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_TMOUTCLKUNIT                       (0x1UL << 7)                                /**< Timeout Clock Unit */
#define _SDIO_CAPAB0_TMOUTCLKUNIT_SHIFT                7                                           /**< Shift value for SDIO_TMOUTCLKUNIT */
#define _SDIO_CAPAB0_TMOUTCLKUNIT_MASK                 0x80UL                                      /**< Bit mask for SDIO_TMOUTCLKUNIT */
#define _SDIO_CAPAB0_TMOUTCLKUNIT_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_TMOUTCLKUNIT_DEFAULT               (_SDIO_CAPAB0_TMOUTCLKUNIT_DEFAULT << 7)    /**< Shifted mode DEFAULT for SDIO_CAPAB0 */
#define _SDIO_CAPAB0_BASECLKFREQSD_SHIFT               8                                           /**< Shift value for SDIO_BASECLKFREQSD */
#define _SDIO_CAPAB0_BASECLKFREQSD_MASK                0xFF00UL                                    /**< Bit mask for SDIO_BASECLKFREQSD */
#define _SDIO_CAPAB0_BASECLKFREQSD_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_BASECLKFREQSD_DEFAULT              (_SDIO_CAPAB0_BASECLKFREQSD_DEFAULT << 8)   /**< Shifted mode DEFAULT for SDIO_CAPAB0 */
#define _SDIO_CAPAB0_MAXBLOCKLEN_SHIFT                 16                                          /**< Shift value for SDIO_MAXBLOCKLEN */
#define _SDIO_CAPAB0_MAXBLOCKLEN_MASK                  0x30000UL                                   /**< Bit mask for SDIO_MAXBLOCKLEN */
#define _SDIO_CAPAB0_MAXBLOCKLEN_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_MAXBLOCKLEN_DEFAULT                (_SDIO_CAPAB0_MAXBLOCKLEN_DEFAULT << 16)    /**< Shifted mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_EXTMEDIABUSSUP                     (0x1UL << 18)                               /**< Extended Media Bus Support */
#define _SDIO_CAPAB0_EXTMEDIABUSSUP_SHIFT              18                                          /**< Shift value for SDIO_EXTMEDIABUSSUP */
#define _SDIO_CAPAB0_EXTMEDIABUSSUP_MASK               0x40000UL                                   /**< Bit mask for SDIO_EXTMEDIABUSSUP */
#define _SDIO_CAPAB0_EXTMEDIABUSSUP_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_EXTMEDIABUSSUP_DEFAULT             (_SDIO_CAPAB0_EXTMEDIABUSSUP_DEFAULT << 18) /**< Shifted mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_ADMA2SUP                           (0x1UL << 19)                               /**< ADMA2 Support */
#define _SDIO_CAPAB0_ADMA2SUP_SHIFT                    19                                          /**< Shift value for SDIO_ADMA2SUP */
#define _SDIO_CAPAB0_ADMA2SUP_MASK                     0x80000UL                                   /**< Bit mask for SDIO_ADMA2SUP */
#define _SDIO_CAPAB0_ADMA2SUP_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_ADMA2SUP_DEFAULT                   (_SDIO_CAPAB0_ADMA2SUP_DEFAULT << 19)       /**< Shifted mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_HSSUP                              (0x1UL << 21)                               /**< High Speed Support */
#define _SDIO_CAPAB0_HSSUP_SHIFT                       21                                          /**< Shift value for SDIO_HSSUP */
#define _SDIO_CAPAB0_HSSUP_MASK                        0x200000UL                                  /**< Bit mask for SDIO_HSSUP */
#define _SDIO_CAPAB0_HSSUP_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_HSSUP_DEFAULT                      (_SDIO_CAPAB0_HSSUP_DEFAULT << 21)          /**< Shifted mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_SDMASUP                            (0x1UL << 22)                               /**< SDMA Support */
#define _SDIO_CAPAB0_SDMASUP_SHIFT                     22                                          /**< Shift value for SDIO_SDMASUP */
#define _SDIO_CAPAB0_SDMASUP_MASK                      0x400000UL                                  /**< Bit mask for SDIO_SDMASUP */
#define _SDIO_CAPAB0_SDMASUP_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_SDMASUP_DEFAULT                    (_SDIO_CAPAB0_SDMASUP_DEFAULT << 22)        /**< Shifted mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_SUSRESSUP                          (0x1UL << 23)                               /**< Suspend / Resume Support */
#define _SDIO_CAPAB0_SUSRESSUP_SHIFT                   23                                          /**< Shift value for SDIO_SUSRESSUP */
#define _SDIO_CAPAB0_SUSRESSUP_MASK                    0x800000UL                                  /**< Bit mask for SDIO_SUSRESSUP */
#define _SDIO_CAPAB0_SUSRESSUP_DEFAULT                 0x00000000UL                                /**< Mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_SUSRESSUP_DEFAULT                  (_SDIO_CAPAB0_SUSRESSUP_DEFAULT << 23)      /**< Shifted mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_VOLTSUP3P3V                        (0x1UL << 24)                               /**< Voltage Support 3.3V */
#define _SDIO_CAPAB0_VOLTSUP3P3V_SHIFT                 24                                          /**< Shift value for SDIO_VOLTSUP3P3V */
#define _SDIO_CAPAB0_VOLTSUP3P3V_MASK                  0x1000000UL                                 /**< Bit mask for SDIO_VOLTSUP3P3V */
#define _SDIO_CAPAB0_VOLTSUP3P3V_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_VOLTSUP3P3V_DEFAULT                (_SDIO_CAPAB0_VOLTSUP3P3V_DEFAULT << 24)    /**< Shifted mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_VOLTSUP3P0V                        (0x1UL << 25)                               /**< Voltage Support 3.0V */
#define _SDIO_CAPAB0_VOLTSUP3P0V_SHIFT                 25                                          /**< Shift value for SDIO_VOLTSUP3P0V */
#define _SDIO_CAPAB0_VOLTSUP3P0V_MASK                  0x2000000UL                                 /**< Bit mask for SDIO_VOLTSUP3P0V */
#define _SDIO_CAPAB0_VOLTSUP3P0V_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_VOLTSUP3P0V_DEFAULT                (_SDIO_CAPAB0_VOLTSUP3P0V_DEFAULT << 25)    /**< Shifted mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_VOLTSUP1P8V                        (0x1UL << 26)                               /**< Voltage Support 1.8V */
#define _SDIO_CAPAB0_VOLTSUP1P8V_SHIFT                 26                                          /**< Shift value for SDIO_VOLTSUP1P8V */
#define _SDIO_CAPAB0_VOLTSUP1P8V_MASK                  0x4000000UL                                 /**< Bit mask for SDIO_VOLTSUP1P8V */
#define _SDIO_CAPAB0_VOLTSUP1P8V_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_VOLTSUP1P8V_DEFAULT                (_SDIO_CAPAB0_VOLTSUP1P8V_DEFAULT << 26)    /**< Shifted mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_SYSBUS64BSUP                       (0x1UL << 28)                               /**< System Bus 64-bit Support */
#define _SDIO_CAPAB0_SYSBUS64BSUP_SHIFT                28                                          /**< Shift value for SDIO_SYSBUS64BSUP */
#define _SDIO_CAPAB0_SYSBUS64BSUP_MASK                 0x10000000UL                                /**< Bit mask for SDIO_SYSBUS64BSUP */
#define _SDIO_CAPAB0_SYSBUS64BSUP_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_SYSBUS64BSUP_DEFAULT               (_SDIO_CAPAB0_SYSBUS64BSUP_DEFAULT << 28)   /**< Shifted mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_ASYNCINTSUP                        (0x1UL << 29)                               /**< Asynchronous Interrupt Support */
#define _SDIO_CAPAB0_ASYNCINTSUP_SHIFT                 29                                          /**< Shift value for SDIO_ASYNCINTSUP */
#define _SDIO_CAPAB0_ASYNCINTSUP_MASK                  0x20000000UL                                /**< Bit mask for SDIO_ASYNCINTSUP */
#define _SDIO_CAPAB0_ASYNCINTSUP_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_ASYNCINTSUP_DEFAULT                (_SDIO_CAPAB0_ASYNCINTSUP_DEFAULT << 29)    /**< Shifted mode DEFAULT for SDIO_CAPAB0 */
#define _SDIO_CAPAB0_IFSLOTTYPE_SHIFT                  30                                          /**< Shift value for SDIO_IFSLOTTYPE */
#define _SDIO_CAPAB0_IFSLOTTYPE_MASK                   0xC0000000UL                                /**< Bit mask for SDIO_IFSLOTTYPE */
#define _SDIO_CAPAB0_IFSLOTTYPE_DEFAULT                0x00000000UL                                /**< Mode DEFAULT for SDIO_CAPAB0 */
#define _SDIO_CAPAB0_IFSLOTTYPE_REMOVABLE              0x00000000UL                                /**< Mode REMOVABLE for SDIO_CAPAB0 */
#define _SDIO_CAPAB0_IFSLOTTYPE_EMBEDDED               0x00000001UL                                /**< Mode EMBEDDED for SDIO_CAPAB0 */
#define _SDIO_CAPAB0_IFSLOTTYPE_SHARED                 0x00000002UL                                /**< Mode SHARED for SDIO_CAPAB0 */
#define SDIO_CAPAB0_IFSLOTTYPE_DEFAULT                 (_SDIO_CAPAB0_IFSLOTTYPE_DEFAULT << 30)     /**< Shifted mode DEFAULT for SDIO_CAPAB0 */
#define SDIO_CAPAB0_IFSLOTTYPE_REMOVABLE               (_SDIO_CAPAB0_IFSLOTTYPE_REMOVABLE << 30)   /**< Shifted mode REMOVABLE for SDIO_CAPAB0 */
#define SDIO_CAPAB0_IFSLOTTYPE_EMBEDDED                (_SDIO_CAPAB0_IFSLOTTYPE_EMBEDDED << 30)    /**< Shifted mode EMBEDDED for SDIO_CAPAB0 */
#define SDIO_CAPAB0_IFSLOTTYPE_SHARED                  (_SDIO_CAPAB0_IFSLOTTYPE_SHARED << 30)      /**< Shifted mode SHARED for SDIO_CAPAB0 */

/* Bit fields for SDIO CAPAB2 */
#define _SDIO_CAPAB2_RESETVALUE                        0x00000000UL                              /**< Default value for SDIO_CAPAB2 */
#define _SDIO_CAPAB2_MASK                              0x03FFEF77UL                              /**< Mask for SDIO_CAPAB2 */
#define SDIO_CAPAB2_SDR50SUP                           (0x1UL << 0)                              /**< SDR50 Support */
#define _SDIO_CAPAB2_SDR50SUP_SHIFT                    0                                         /**< Shift value for SDIO_SDR50SUP */
#define _SDIO_CAPAB2_SDR50SUP_MASK                     0x1UL                                     /**< Bit mask for SDIO_SDR50SUP */
#define _SDIO_CAPAB2_SDR50SUP_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for SDIO_CAPAB2 */
#define SDIO_CAPAB2_SDR50SUP_DEFAULT                   (_SDIO_CAPAB2_SDR50SUP_DEFAULT << 0)      /**< Shifted mode DEFAULT for SDIO_CAPAB2 */
#define SDIO_CAPAB2_SDR104SUP                          (0x1UL << 1)                              /**< SDR104 Support */
#define _SDIO_CAPAB2_SDR104SUP_SHIFT                   1                                         /**< Shift value for SDIO_SDR104SUP */
#define _SDIO_CAPAB2_SDR104SUP_MASK                    0x2UL                                     /**< Bit mask for SDIO_SDR104SUP */
#define _SDIO_CAPAB2_SDR104SUP_DEFAULT                 0x00000000UL                              /**< Mode DEFAULT for SDIO_CAPAB2 */
#define SDIO_CAPAB2_SDR104SUP_DEFAULT                  (_SDIO_CAPAB2_SDR104SUP_DEFAULT << 1)     /**< Shifted mode DEFAULT for SDIO_CAPAB2 */
#define SDIO_CAPAB2_DDR50SUP                           (0x1UL << 2)                              /**< DDR50 Support */
#define _SDIO_CAPAB2_DDR50SUP_SHIFT                    2                                         /**< Shift value for SDIO_DDR50SUP */
#define _SDIO_CAPAB2_DDR50SUP_MASK                     0x4UL                                     /**< Bit mask for SDIO_DDR50SUP */
#define _SDIO_CAPAB2_DDR50SUP_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for SDIO_CAPAB2 */
#define SDIO_CAPAB2_DDR50SUP_DEFAULT                   (_SDIO_CAPAB2_DDR50SUP_DEFAULT << 2)      /**< Shifted mode DEFAULT for SDIO_CAPAB2 */
#define SDIO_CAPAB2_DRVTYPASUP                         (0x1UL << 4)                              /**< Driver Type a Support */
#define _SDIO_CAPAB2_DRVTYPASUP_SHIFT                  4                                         /**< Shift value for SDIO_DRVTYPASUP */
#define _SDIO_CAPAB2_DRVTYPASUP_MASK                   0x10UL                                    /**< Bit mask for SDIO_DRVTYPASUP */
#define _SDIO_CAPAB2_DRVTYPASUP_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for SDIO_CAPAB2 */
#define SDIO_CAPAB2_DRVTYPASUP_DEFAULT                 (_SDIO_CAPAB2_DRVTYPASUP_DEFAULT << 4)    /**< Shifted mode DEFAULT for SDIO_CAPAB2 */
#define SDIO_CAPAB2_DRVTYPCSUP                         (0x1UL << 5)                              /**< Driver Type C Support */
#define _SDIO_CAPAB2_DRVTYPCSUP_SHIFT                  5                                         /**< Shift value for SDIO_DRVTYPCSUP */
#define _SDIO_CAPAB2_DRVTYPCSUP_MASK                   0x20UL                                    /**< Bit mask for SDIO_DRVTYPCSUP */
#define _SDIO_CAPAB2_DRVTYPCSUP_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for SDIO_CAPAB2 */
#define SDIO_CAPAB2_DRVTYPCSUP_DEFAULT                 (_SDIO_CAPAB2_DRVTYPCSUP_DEFAULT << 5)    /**< Shifted mode DEFAULT for SDIO_CAPAB2 */
#define SDIO_CAPAB2_DRVTYPDSUP                         (0x1UL << 6)                              /**< Driver Type D Support */
#define _SDIO_CAPAB2_DRVTYPDSUP_SHIFT                  6                                         /**< Shift value for SDIO_DRVTYPDSUP */
#define _SDIO_CAPAB2_DRVTYPDSUP_MASK                   0x40UL                                    /**< Bit mask for SDIO_DRVTYPDSUP */
#define _SDIO_CAPAB2_DRVTYPDSUP_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for SDIO_CAPAB2 */
#define SDIO_CAPAB2_DRVTYPDSUP_DEFAULT                 (_SDIO_CAPAB2_DRVTYPDSUP_DEFAULT << 6)    /**< Shifted mode DEFAULT for SDIO_CAPAB2 */
#define _SDIO_CAPAB2_TIMCNTRETUN_SHIFT                 8                                         /**< Shift value for SDIO_TIMCNTRETUN */
#define _SDIO_CAPAB2_TIMCNTRETUN_MASK                  0xF00UL                                   /**< Bit mask for SDIO_TIMCNTRETUN */
#define _SDIO_CAPAB2_TIMCNTRETUN_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for SDIO_CAPAB2 */
#define SDIO_CAPAB2_TIMCNTRETUN_DEFAULT                (_SDIO_CAPAB2_TIMCNTRETUN_DEFAULT << 8)   /**< Shifted mode DEFAULT for SDIO_CAPAB2 */
#define SDIO_CAPAB2_USETUNSDR50                        (0x1UL << 13)                             /**< Use Tuning for SDR50 */
#define _SDIO_CAPAB2_USETUNSDR50_SHIFT                 13                                        /**< Shift value for SDIO_USETUNSDR50 */
#define _SDIO_CAPAB2_USETUNSDR50_MASK                  0x2000UL                                  /**< Bit mask for SDIO_USETUNSDR50 */
#define _SDIO_CAPAB2_USETUNSDR50_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for SDIO_CAPAB2 */
#define SDIO_CAPAB2_USETUNSDR50_DEFAULT                (_SDIO_CAPAB2_USETUNSDR50_DEFAULT << 13)  /**< Shifted mode DEFAULT for SDIO_CAPAB2 */
#define _SDIO_CAPAB2_RETUNEMODES_SHIFT                 14                                        /**< Shift value for SDIO_RETUNEMODES */
#define _SDIO_CAPAB2_RETUNEMODES_MASK                  0xC000UL                                  /**< Bit mask for SDIO_RETUNEMODES */
#define _SDIO_CAPAB2_RETUNEMODES_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for SDIO_CAPAB2 */
#define SDIO_CAPAB2_RETUNEMODES_DEFAULT                (_SDIO_CAPAB2_RETUNEMODES_DEFAULT << 14)  /**< Shifted mode DEFAULT for SDIO_CAPAB2 */
#define _SDIO_CAPAB2_CLOCKKMUL_SHIFT                   16                                        /**< Shift value for SDIO_CLOCKKMUL */
#define _SDIO_CAPAB2_CLOCKKMUL_MASK                    0xFF0000UL                                /**< Bit mask for SDIO_CLOCKKMUL */
#define _SDIO_CAPAB2_CLOCKKMUL_DEFAULT                 0x00000000UL                              /**< Mode DEFAULT for SDIO_CAPAB2 */
#define SDIO_CAPAB2_CLOCKKMUL_DEFAULT                  (_SDIO_CAPAB2_CLOCKKMUL_DEFAULT << 16)    /**< Shifted mode DEFAULT for SDIO_CAPAB2 */
#define SDIO_CAPAB2_SPIMODE                            (0x1UL << 24)                             /**< SPI Mode Support */
#define _SDIO_CAPAB2_SPIMODE_SHIFT                     24                                        /**< Shift value for SDIO_SPIMODE */
#define _SDIO_CAPAB2_SPIMODE_MASK                      0x1000000UL                               /**< Bit mask for SDIO_SPIMODE */
#define _SDIO_CAPAB2_SPIMODE_DEFAULT                   0x00000000UL                              /**< Mode DEFAULT for SDIO_CAPAB2 */
#define SDIO_CAPAB2_SPIMODE_DEFAULT                    (_SDIO_CAPAB2_SPIMODE_DEFAULT << 24)      /**< Shifted mode DEFAULT for SDIO_CAPAB2 */
#define SDIO_CAPAB2_SPIBLOCKMODE                       (0x1UL << 25)                             /**< SPI Block Mode Support */
#define _SDIO_CAPAB2_SPIBLOCKMODE_SHIFT                25                                        /**< Shift value for SDIO_SPIBLOCKMODE */
#define _SDIO_CAPAB2_SPIBLOCKMODE_MASK                 0x2000000UL                               /**< Bit mask for SDIO_SPIBLOCKMODE */
#define _SDIO_CAPAB2_SPIBLOCKMODE_DEFAULT              0x00000000UL                              /**< Mode DEFAULT for SDIO_CAPAB2 */
#define SDIO_CAPAB2_SPIBLOCKMODE_DEFAULT               (_SDIO_CAPAB2_SPIBLOCKMODE_DEFAULT << 25) /**< Shifted mode DEFAULT for SDIO_CAPAB2 */

/* Bit fields for SDIO MAXCURCAPAB */
#define _SDIO_MAXCURCAPAB_RESETVALUE                   0x00000000UL                                   /**< Default value for SDIO_MAXCURCAPAB */
#define _SDIO_MAXCURCAPAB_MASK                         0x00FFFFFFUL                                   /**< Mask for SDIO_MAXCURCAPAB */
#define _SDIO_MAXCURCAPAB_MAXCUR3P3VAL_SHIFT           0                                              /**< Shift value for SDIO_MAXCUR3P3VAL */
#define _SDIO_MAXCURCAPAB_MAXCUR3P3VAL_MASK            0xFFUL                                         /**< Bit mask for SDIO_MAXCUR3P3VAL */
#define _SDIO_MAXCURCAPAB_MAXCUR3P3VAL_DEFAULT         0x00000000UL                                   /**< Mode DEFAULT for SDIO_MAXCURCAPAB */
#define SDIO_MAXCURCAPAB_MAXCUR3P3VAL_DEFAULT          (_SDIO_MAXCURCAPAB_MAXCUR3P3VAL_DEFAULT << 0)  /**< Shifted mode DEFAULT for SDIO_MAXCURCAPAB */
#define _SDIO_MAXCURCAPAB_MAXCUR3P0VAL_SHIFT           8                                              /**< Shift value for SDIO_MAXCUR3P0VAL */
#define _SDIO_MAXCURCAPAB_MAXCUR3P0VAL_MASK            0xFF00UL                                       /**< Bit mask for SDIO_MAXCUR3P0VAL */
#define _SDIO_MAXCURCAPAB_MAXCUR3P0VAL_DEFAULT         0x00000000UL                                   /**< Mode DEFAULT for SDIO_MAXCURCAPAB */
#define SDIO_MAXCURCAPAB_MAXCUR3P0VAL_DEFAULT          (_SDIO_MAXCURCAPAB_MAXCUR3P0VAL_DEFAULT << 8)  /**< Shifted mode DEFAULT for SDIO_MAXCURCAPAB */
#define _SDIO_MAXCURCAPAB_MAXCUR1P8VAL_SHIFT           16                                             /**< Shift value for SDIO_MAXCUR1P8VAL */
#define _SDIO_MAXCURCAPAB_MAXCUR1P8VAL_MASK            0xFF0000UL                                     /**< Bit mask for SDIO_MAXCUR1P8VAL */
#define _SDIO_MAXCURCAPAB_MAXCUR1P8VAL_DEFAULT         0x00000000UL                                   /**< Mode DEFAULT for SDIO_MAXCURCAPAB */
#define SDIO_MAXCURCAPAB_MAXCUR1P8VAL_DEFAULT          (_SDIO_MAXCURCAPAB_MAXCUR1P8VAL_DEFAULT << 16) /**< Shifted mode DEFAULT for SDIO_MAXCURCAPAB */

