RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_sdio.h
/* Bit fields for SDIO PRSTVAL0 */
#define _SDIO_PRSTVAL0_RESETVALUE                      0x00000000UL                                   /**< Default value for SDIO_PRSTVAL0 */
#define _SDIO_PRSTVAL0_MASK                            0xC7FFC7FFUL                                   /**< Mask for SDIO_PRSTVAL0 */
#define _SDIO_PRSTVAL0_INITSDCLKFREQVAL_SHIFT          0                                              /**< Shift value for SDIO_INITSDCLKFREQVAL */
#define _SDIO_PRSTVAL0_INITSDCLKFREQVAL_MASK           0x3FFUL                                        /**< Bit mask for SDIO_INITSDCLKFREQVAL */
#define _SDIO_PRSTVAL0_INITSDCLKFREQVAL_DEFAULT        0x00000000UL                                   /**< Mode DEFAULT for SDIO_PRSTVAL0 */
#define SDIO_PRSTVAL0_INITSDCLKFREQVAL_DEFAULT         (_SDIO_PRSTVAL0_INITSDCLKFREQVAL_DEFAULT << 0) /**< Shifted mode DEFAULT for SDIO_PRSTVAL0 */
#define SDIO_PRSTVAL0_INITCLCKGENVAL                   (0x1UL << 10)                                  /**< Clock Generator Select Value for Initialization */
#define _SDIO_PRSTVAL0_INITCLCKGENVAL_SHIFT            10                                             /**< Shift value for SDIO_INITCLCKGENVAL */
#define _SDIO_PRSTVAL0_INITCLCKGENVAL_MASK             0x400UL                                        /**< Bit mask for SDIO_INITCLCKGENVAL */
#define _SDIO_PRSTVAL0_INITCLCKGENVAL_DEFAULT          0x00000000UL                                   /**< Mode DEFAULT for SDIO_PRSTVAL0 */
#define SDIO_PRSTVAL0_INITCLCKGENVAL_DEFAULT           (_SDIO_PRSTVAL0_INITCLCKGENVAL_DEFAULT << 10)  /**< Shifted mode DEFAULT for SDIO_PRSTVAL0 */
#define _SDIO_PRSTVAL0_INITDRVSTVAL_SHIFT              14                                             /**< Shift value for SDIO_INITDRVSTVAL */
#define _SDIO_PRSTVAL0_INITDRVSTVAL_MASK               0xC000UL                                       /**< Bit mask for SDIO_INITDRVSTVAL */
#define _SDIO_PRSTVAL0_INITDRVSTVAL_DEFAULT            0x00000000UL                                   /**< Mode DEFAULT for SDIO_PRSTVAL0 */
#define _SDIO_PRSTVAL0_INITDRVSTVAL_TYPEB              0x00000000UL                                   /**< Mode TYPEB for SDIO_PRSTVAL0 */
#define _SDIO_PRSTVAL0_INITDRVSTVAL_TYPEA              0x00000001UL                                   /**< Mode TYPEA for SDIO_PRSTVAL0 */
#define _SDIO_PRSTVAL0_INITDRVSTVAL_TYPEC              0x00000002UL                                   /**< Mode TYPEC for SDIO_PRSTVAL0 */
#define _SDIO_PRSTVAL0_INITDRVSTVAL_TYPED              0x00000003UL                                   /**< Mode TYPED for SDIO_PRSTVAL0 */
#define SDIO_PRSTVAL0_INITDRVSTVAL_DEFAULT             (_SDIO_PRSTVAL0_INITDRVSTVAL_DEFAULT << 14)    /**< Shifted mode DEFAULT for SDIO_PRSTVAL0 */
#define SDIO_PRSTVAL0_INITDRVSTVAL_TYPEB               (_SDIO_PRSTVAL0_INITDRVSTVAL_TYPEB << 14)      /**< Shifted mode TYPEB for SDIO_PRSTVAL0 */
#define SDIO_PRSTVAL0_INITDRVSTVAL_TYPEA               (_SDIO_PRSTVAL0_INITDRVSTVAL_TYPEA << 14)      /**< Shifted mode TYPEA for SDIO_PRSTVAL0 */
#define SDIO_PRSTVAL0_INITDRVSTVAL_TYPEC               (_SDIO_PRSTVAL0_INITDRVSTVAL_TYPEC << 14)      /**< Shifted mode TYPEC for SDIO_PRSTVAL0 */
#define SDIO_PRSTVAL0_INITDRVSTVAL_TYPED               (_SDIO_PRSTVAL0_INITDRVSTVAL_TYPED << 14)      /**< Shifted mode TYPED for SDIO_PRSTVAL0 */
#define _SDIO_PRSTVAL0_DSPSDCLKFREQVAL_SHIFT           16                                             /**< Shift value for SDIO_DSPSDCLKFREQVAL */
#define _SDIO_PRSTVAL0_DSPSDCLKFREQVAL_MASK            0x3FF0000UL                                    /**< Bit mask for SDIO_DSPSDCLKFREQVAL */
#define _SDIO_PRSTVAL0_DSPSDCLKFREQVAL_DEFAULT         0x00000000UL                                   /**< Mode DEFAULT for SDIO_PRSTVAL0 */
#define SDIO_PRSTVAL0_DSPSDCLKFREQVAL_DEFAULT          (_SDIO_PRSTVAL0_DSPSDCLKFREQVAL_DEFAULT << 16) /**< Shifted mode DEFAULT for SDIO_PRSTVAL0 */
#define SDIO_PRSTVAL0_DSPCLKGENVAL                     (0x1UL << 26)                                  /**< Clock Generator Select Value for Default Speed */
#define _SDIO_PRSTVAL0_DSPCLKGENVAL_SHIFT              26                                             /**< Shift value for SDIO_DSPCLKGENVAL */
#define _SDIO_PRSTVAL0_DSPCLKGENVAL_MASK               0x4000000UL                                    /**< Bit mask for SDIO_DSPCLKGENVAL */
#define _SDIO_PRSTVAL0_DSPCLKGENVAL_DEFAULT            0x00000000UL                                   /**< Mode DEFAULT for SDIO_PRSTVAL0 */
#define SDIO_PRSTVAL0_DSPCLKGENVAL_DEFAULT             (_SDIO_PRSTVAL0_DSPCLKGENVAL_DEFAULT << 26)    /**< Shifted mode DEFAULT for SDIO_PRSTVAL0 */
#define _SDIO_PRSTVAL0_DSPDRVSTVAL_SHIFT               30                                             /**< Shift value for SDIO_DSPDRVSTVAL */
#define _SDIO_PRSTVAL0_DSPDRVSTVAL_MASK                0xC0000000UL                                   /**< Bit mask for SDIO_DSPDRVSTVAL */
#define _SDIO_PRSTVAL0_DSPDRVSTVAL_DEFAULT             0x00000000UL                                   /**< Mode DEFAULT for SDIO_PRSTVAL0 */
#define _SDIO_PRSTVAL0_DSPDRVSTVAL_TYPEB               0x00000000UL                                   /**< Mode TYPEB for SDIO_PRSTVAL0 */
#define _SDIO_PRSTVAL0_DSPDRVSTVAL_TYPEA               0x00000001UL                                   /**< Mode TYPEA for SDIO_PRSTVAL0 */
#define _SDIO_PRSTVAL0_DSPDRVSTVAL_TYPEC               0x00000002UL                                   /**< Mode TYPEC for SDIO_PRSTVAL0 */
#define _SDIO_PRSTVAL0_DSPDRVSTVAL_TYPED               0x00000003UL                                   /**< Mode TYPED for SDIO_PRSTVAL0 */
#define SDIO_PRSTVAL0_DSPDRVSTVAL_DEFAULT              (_SDIO_PRSTVAL0_DSPDRVSTVAL_DEFAULT << 30)     /**< Shifted mode DEFAULT for SDIO_PRSTVAL0 */
#define SDIO_PRSTVAL0_DSPDRVSTVAL_TYPEB                (_SDIO_PRSTVAL0_DSPDRVSTVAL_TYPEB << 30)       /**< Shifted mode TYPEB for SDIO_PRSTVAL0 */
#define SDIO_PRSTVAL0_DSPDRVSTVAL_TYPEA                (_SDIO_PRSTVAL0_DSPDRVSTVAL_TYPEA << 30)       /**< Shifted mode TYPEA for SDIO_PRSTVAL0 */
#define SDIO_PRSTVAL0_DSPDRVSTVAL_TYPEC                (_SDIO_PRSTVAL0_DSPDRVSTVAL_TYPEC << 30)       /**< Shifted mode TYPEC for SDIO_PRSTVAL0 */
#define SDIO_PRSTVAL0_DSPDRVSTVAL_TYPED                (_SDIO_PRSTVAL0_DSPDRVSTVAL_TYPED << 30)       /**< Shifted mode TYPED for SDIO_PRSTVAL0 */

/* Bit fields for SDIO PRSTVAL2 */
#define _SDIO_PRSTVAL2_RESETVALUE                      0x00000000UL                                     /**< Default value for SDIO_PRSTVAL2 */
#define _SDIO_PRSTVAL2_MASK                            0xC7FFC7FFUL                                     /**< Mask for SDIO_PRSTVAL2 */
#define _SDIO_PRSTVAL2_HSPSDCLKFREQVAL_SHIFT           0                                                /**< Shift value for SDIO_HSPSDCLKFREQVAL */
#define _SDIO_PRSTVAL2_HSPSDCLKFREQVAL_MASK            0x3FFUL                                          /**< Bit mask for SDIO_HSPSDCLKFREQVAL */
#define _SDIO_PRSTVAL2_HSPSDCLKFREQVAL_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for SDIO_PRSTVAL2 */
#define SDIO_PRSTVAL2_HSPSDCLKFREQVAL_DEFAULT          (_SDIO_PRSTVAL2_HSPSDCLKFREQVAL_DEFAULT << 0)    /**< Shifted mode DEFAULT for SDIO_PRSTVAL2 */
#define SDIO_PRSTVAL2_HSPCLKGENVAL                     (0x1UL << 10)                                    /**< Clock Generator Select Value for High Speed */
#define _SDIO_PRSTVAL2_HSPCLKGENVAL_SHIFT              10                                               /**< Shift value for SDIO_HSPCLKGENVAL */
#define _SDIO_PRSTVAL2_HSPCLKGENVAL_MASK               0x400UL                                          /**< Bit mask for SDIO_HSPCLKGENVAL */
#define _SDIO_PRSTVAL2_HSPCLKGENVAL_DEFAULT            0x00000000UL                                     /**< Mode DEFAULT for SDIO_PRSTVAL2 */
#define SDIO_PRSTVAL2_HSPCLKGENVAL_DEFAULT             (_SDIO_PRSTVAL2_HSPCLKGENVAL_DEFAULT << 10)      /**< Shifted mode DEFAULT for SDIO_PRSTVAL2 */
#define _SDIO_PRSTVAL2_HSPDRVSTVAL_SHIFT               14                                               /**< Shift value for SDIO_HSPDRVSTVAL */
#define _SDIO_PRSTVAL2_HSPDRVSTVAL_MASK                0xC000UL                                         /**< Bit mask for SDIO_HSPDRVSTVAL */
#define _SDIO_PRSTVAL2_HSPDRVSTVAL_DEFAULT             0x00000000UL                                     /**< Mode DEFAULT for SDIO_PRSTVAL2 */
#define _SDIO_PRSTVAL2_HSPDRVSTVAL_TYPEB               0x00000000UL                                     /**< Mode TYPEB for SDIO_PRSTVAL2 */
#define _SDIO_PRSTVAL2_HSPDRVSTVAL_TYPEA               0x00000001UL                                     /**< Mode TYPEA for SDIO_PRSTVAL2 */
#define _SDIO_PRSTVAL2_HSPDRVSTVAL_TYPEC               0x00000002UL                                     /**< Mode TYPEC for SDIO_PRSTVAL2 */
#define _SDIO_PRSTVAL2_HSPDRVSTVAL_TYPED               0x00000003UL                                     /**< Mode TYPED for SDIO_PRSTVAL2 */
#define SDIO_PRSTVAL2_HSPDRVSTVAL_DEFAULT              (_SDIO_PRSTVAL2_HSPDRVSTVAL_DEFAULT << 14)       /**< Shifted mode DEFAULT for SDIO_PRSTVAL2 */
#define SDIO_PRSTVAL2_HSPDRVSTVAL_TYPEB                (_SDIO_PRSTVAL2_HSPDRVSTVAL_TYPEB << 14)         /**< Shifted mode TYPEB for SDIO_PRSTVAL2 */
#define SDIO_PRSTVAL2_HSPDRVSTVAL_TYPEA                (_SDIO_PRSTVAL2_HSPDRVSTVAL_TYPEA << 14)         /**< Shifted mode TYPEA for SDIO_PRSTVAL2 */
#define SDIO_PRSTVAL2_HSPDRVSTVAL_TYPEC                (_SDIO_PRSTVAL2_HSPDRVSTVAL_TYPEC << 14)         /**< Shifted mode TYPEC for SDIO_PRSTVAL2 */
#define SDIO_PRSTVAL2_HSPDRVSTVAL_TYPED                (_SDIO_PRSTVAL2_HSPDRVSTVAL_TYPED << 14)         /**< Shifted mode TYPED for SDIO_PRSTVAL2 */
#define _SDIO_PRSTVAL2_SDR12SDCLKFREQVAL_SHIFT         16                                               /**< Shift value for SDIO_SDR12SDCLKFREQVAL */
#define _SDIO_PRSTVAL2_SDR12SDCLKFREQVAL_MASK          0x3FF0000UL                                      /**< Bit mask for SDIO_SDR12SDCLKFREQVAL */
#define _SDIO_PRSTVAL2_SDR12SDCLKFREQVAL_DEFAULT       0x00000000UL                                     /**< Mode DEFAULT for SDIO_PRSTVAL2 */
#define SDIO_PRSTVAL2_SDR12SDCLKFREQVAL_DEFAULT        (_SDIO_PRSTVAL2_SDR12SDCLKFREQVAL_DEFAULT << 16) /**< Shifted mode DEFAULT for SDIO_PRSTVAL2 */
#define SDIO_PRSTVAL2_SDR12CLKGENVAL                   (0x1UL << 26)                                    /**< Clock Generator Select Value for SDR12 */
#define _SDIO_PRSTVAL2_SDR12CLKGENVAL_SHIFT            26                                               /**< Shift value for SDIO_SDR12CLKGENVAL */
#define _SDIO_PRSTVAL2_SDR12CLKGENVAL_MASK             0x4000000UL                                      /**< Bit mask for SDIO_SDR12CLKGENVAL */
#define _SDIO_PRSTVAL2_SDR12CLKGENVAL_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for SDIO_PRSTVAL2 */
#define SDIO_PRSTVAL2_SDR12CLKGENVAL_DEFAULT           (_SDIO_PRSTVAL2_SDR12CLKGENVAL_DEFAULT << 26)    /**< Shifted mode DEFAULT for SDIO_PRSTVAL2 */
#define _SDIO_PRSTVAL2_SDR12DRVSTVAL_SHIFT             30                                               /**< Shift value for SDIO_SDR12DRVSTVAL */
#define _SDIO_PRSTVAL2_SDR12DRVSTVAL_MASK              0xC0000000UL                                     /**< Bit mask for SDIO_SDR12DRVSTVAL */
#define _SDIO_PRSTVAL2_SDR12DRVSTVAL_DEFAULT           0x00000000UL                                     /**< Mode DEFAULT for SDIO_PRSTVAL2 */
#define _SDIO_PRSTVAL2_SDR12DRVSTVAL_TYPEB             0x00000000UL                                     /**< Mode TYPEB for SDIO_PRSTVAL2 */
#define _SDIO_PRSTVAL2_SDR12DRVSTVAL_TYPEA             0x00000001UL                                     /**< Mode TYPEA for SDIO_PRSTVAL2 */
#define _SDIO_PRSTVAL2_SDR12DRVSTVAL_TYPEC             0x00000002UL                                     /**< Mode TYPEC for SDIO_PRSTVAL2 */
#define _SDIO_PRSTVAL2_SDR12DRVSTVAL_TYPED             0x00000003UL                                     /**< Mode TYPED for SDIO_PRSTVAL2 */
#define SDIO_PRSTVAL2_SDR12DRVSTVAL_DEFAULT            (_SDIO_PRSTVAL2_SDR12DRVSTVAL_DEFAULT << 30)     /**< Shifted mode DEFAULT for SDIO_PRSTVAL2 */
#define SDIO_PRSTVAL2_SDR12DRVSTVAL_TYPEB              (_SDIO_PRSTVAL2_SDR12DRVSTVAL_TYPEB << 30)       /**< Shifted mode TYPEB for SDIO_PRSTVAL2 */
#define SDIO_PRSTVAL2_SDR12DRVSTVAL_TYPEA              (_SDIO_PRSTVAL2_SDR12DRVSTVAL_TYPEA << 30)       /**< Shifted mode TYPEA for SDIO_PRSTVAL2 */
#define SDIO_PRSTVAL2_SDR12DRVSTVAL_TYPEC              (_SDIO_PRSTVAL2_SDR12DRVSTVAL_TYPEC << 30)       /**< Shifted mode TYPEC for SDIO_PRSTVAL2 */
#define SDIO_PRSTVAL2_SDR12DRVSTVAL_TYPED              (_SDIO_PRSTVAL2_SDR12DRVSTVAL_TYPED << 30)       /**< Shifted mode TYPED for SDIO_PRSTVAL2 */

/* Bit fields for SDIO PRSTVAL4 */
#define _SDIO_PRSTVAL4_RESETVALUE                      0x00000000UL                                     /**< Default value for SDIO_PRSTVAL4 */
#define _SDIO_PRSTVAL4_MASK                            0xC7FFC7FFUL                                     /**< Mask for SDIO_PRSTVAL4 */
#define _SDIO_PRSTVAL4_SDR25SDCLKFREQVAL_SHIFT         0                                                /**< Shift value for SDIO_SDR25SDCLKFREQVAL */
#define _SDIO_PRSTVAL4_SDR25SDCLKFREQVAL_MASK          0x3FFUL                                          /**< Bit mask for SDIO_SDR25SDCLKFREQVAL */
#define _SDIO_PRSTVAL4_SDR25SDCLKFREQVAL_DEFAULT       0x00000000UL                                     /**< Mode DEFAULT for SDIO_PRSTVAL4 */
#define SDIO_PRSTVAL4_SDR25SDCLKFREQVAL_DEFAULT        (_SDIO_PRSTVAL4_SDR25SDCLKFREQVAL_DEFAULT << 0)  /**< Shifted mode DEFAULT for SDIO_PRSTVAL4 */
#define SDIO_PRSTVAL4_SDR25CLKGENVAL                   (0x1UL << 10)                                    /**< Clock Generator Select Value for SDR25 */
#define _SDIO_PRSTVAL4_SDR25CLKGENVAL_SHIFT            10                                               /**< Shift value for SDIO_SDR25CLKGENVAL */
#define _SDIO_PRSTVAL4_SDR25CLKGENVAL_MASK             0x400UL                                          /**< Bit mask for SDIO_SDR25CLKGENVAL */
#define _SDIO_PRSTVAL4_SDR25CLKGENVAL_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for SDIO_PRSTVAL4 */
#define SDIO_PRSTVAL4_SDR25CLKGENVAL_DEFAULT           (_SDIO_PRSTVAL4_SDR25CLKGENVAL_DEFAULT << 10)    /**< Shifted mode DEFAULT for SDIO_PRSTVAL4 */
#define _SDIO_PRSTVAL4_SDR25DRVSTVAL_SHIFT             14                                               /**< Shift value for SDIO_SDR25DRVSTVAL */
#define _SDIO_PRSTVAL4_SDR25DRVSTVAL_MASK              0xC000UL                                         /**< Bit mask for SDIO_SDR25DRVSTVAL */
#define _SDIO_PRSTVAL4_SDR25DRVSTVAL_DEFAULT           0x00000000UL                                     /**< Mode DEFAULT for SDIO_PRSTVAL4 */
#define _SDIO_PRSTVAL4_SDR25DRVSTVAL_TYPEB             0x00000000UL                                     /**< Mode TYPEB for SDIO_PRSTVAL4 */
#define _SDIO_PRSTVAL4_SDR25DRVSTVAL_TYPEA             0x00000001UL                                     /**< Mode TYPEA for SDIO_PRSTVAL4 */
#define _SDIO_PRSTVAL4_SDR25DRVSTVAL_TYPEC             0x00000002UL                                     /**< Mode TYPEC for SDIO_PRSTVAL4 */
#define _SDIO_PRSTVAL4_SDR25DRVSTVAL_TYPED             0x00000003UL                                     /**< Mode TYPED for SDIO_PRSTVAL4 */
#define SDIO_PRSTVAL4_SDR25DRVSTVAL_DEFAULT            (_SDIO_PRSTVAL4_SDR25DRVSTVAL_DEFAULT << 14)     /**< Shifted mode DEFAULT for SDIO_PRSTVAL4 */
#define SDIO_PRSTVAL4_SDR25DRVSTVAL_TYPEB              (_SDIO_PRSTVAL4_SDR25DRVSTVAL_TYPEB << 14)       /**< Shifted mode TYPEB for SDIO_PRSTVAL4 */
#define SDIO_PRSTVAL4_SDR25DRVSTVAL_TYPEA              (_SDIO_PRSTVAL4_SDR25DRVSTVAL_TYPEA << 14)       /**< Shifted mode TYPEA for SDIO_PRSTVAL4 */
#define SDIO_PRSTVAL4_SDR25DRVSTVAL_TYPEC              (_SDIO_PRSTVAL4_SDR25DRVSTVAL_TYPEC << 14)       /**< Shifted mode TYPEC for SDIO_PRSTVAL4 */
#define SDIO_PRSTVAL4_SDR25DRVSTVAL_TYPED              (_SDIO_PRSTVAL4_SDR25DRVSTVAL_TYPED << 14)       /**< Shifted mode TYPED for SDIO_PRSTVAL4 */
#define _SDIO_PRSTVAL4_SDR50SDCLKFREQVAL_SHIFT         16                                               /**< Shift value for SDIO_SDR50SDCLKFREQVAL */
#define _SDIO_PRSTVAL4_SDR50SDCLKFREQVAL_MASK          0x3FF0000UL                                      /**< Bit mask for SDIO_SDR50SDCLKFREQVAL */
#define _SDIO_PRSTVAL4_SDR50SDCLKFREQVAL_DEFAULT       0x00000000UL                                     /**< Mode DEFAULT for SDIO_PRSTVAL4 */
#define SDIO_PRSTVAL4_SDR50SDCLKFREQVAL_DEFAULT        (_SDIO_PRSTVAL4_SDR50SDCLKFREQVAL_DEFAULT << 16) /**< Shifted mode DEFAULT for SDIO_PRSTVAL4 */
#define SDIO_PRSTVAL4_SDR50CLCKGENVAL                  (0x1UL << 26)                                    /**< Clock Generator Select Value for SDR50 */
#define _SDIO_PRSTVAL4_SDR50CLCKGENVAL_SHIFT           26                                               /**< Shift value for SDIO_SDR50CLCKGENVAL */
#define _SDIO_PRSTVAL4_SDR50CLCKGENVAL_MASK            0x4000000UL                                      /**< Bit mask for SDIO_SDR50CLCKGENVAL */
#define _SDIO_PRSTVAL4_SDR50CLCKGENVAL_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for SDIO_PRSTVAL4 */
#define SDIO_PRSTVAL4_SDR50CLCKGENVAL_DEFAULT          (_SDIO_PRSTVAL4_SDR50CLCKGENVAL_DEFAULT << 26)   /**< Shifted mode DEFAULT for SDIO_PRSTVAL4 */
#define _SDIO_PRSTVAL4_SDR50DRVSTVAL_SHIFT             30                                               /**< Shift value for SDIO_SDR50DRVSTVAL */
#define _SDIO_PRSTVAL4_SDR50DRVSTVAL_MASK              0xC0000000UL                                     /**< Bit mask for SDIO_SDR50DRVSTVAL */
#define _SDIO_PRSTVAL4_SDR50DRVSTVAL_DEFAULT           0x00000000UL                                     /**< Mode DEFAULT for SDIO_PRSTVAL4 */
#define _SDIO_PRSTVAL4_SDR50DRVSTVAL_TYPEB             0x00000000UL                                     /**< Mode TYPEB for SDIO_PRSTVAL4 */
#define _SDIO_PRSTVAL4_SDR50DRVSTVAL_TYPEA             0x00000001UL                                     /**< Mode TYPEA for SDIO_PRSTVAL4 */
#define _SDIO_PRSTVAL4_SDR50DRVSTVAL_TYPEC             0x00000002UL                                     /**< Mode TYPEC for SDIO_PRSTVAL4 */
#define _SDIO_PRSTVAL4_SDR50DRVSTVAL_TYPED             0x00000003UL                                     /**< Mode TYPED for SDIO_PRSTVAL4 */
#define SDIO_PRSTVAL4_SDR50DRVSTVAL_DEFAULT            (_SDIO_PRSTVAL4_SDR50DRVSTVAL_DEFAULT << 30)     /**< Shifted mode DEFAULT for SDIO_PRSTVAL4 */
#define SDIO_PRSTVAL4_SDR50DRVSTVAL_TYPEB              (_SDIO_PRSTVAL4_SDR50DRVSTVAL_TYPEB << 30)       /**< Shifted mode TYPEB for SDIO_PRSTVAL4 */
#define SDIO_PRSTVAL4_SDR50DRVSTVAL_TYPEA              (_SDIO_PRSTVAL4_SDR50DRVSTVAL_TYPEA << 30)       /**< Shifted mode TYPEA for SDIO_PRSTVAL4 */
#define SDIO_PRSTVAL4_SDR50DRVSTVAL_TYPEC              (_SDIO_PRSTVAL4_SDR50DRVSTVAL_TYPEC << 30)       /**< Shifted mode TYPEC for SDIO_PRSTVAL4 */
#define SDIO_PRSTVAL4_SDR50DRVSTVAL_TYPED              (_SDIO_PRSTVAL4_SDR50DRVSTVAL_TYPED << 30)       /**< Shifted mode TYPED for SDIO_PRSTVAL4 */

