RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_sdio.h
/* Bit fields for SDIO CFG0 */
#define _SDIO_CFG0_RESETVALUE                          0x00000000UL                           /**< Default value for SDIO_CFG0 */
#define _SDIO_CFG0_MASK                                0x7FFFFFFFUL                           /**< Mask for SDIO_CFG0 */
#define _SDIO_CFG0_TUNINGCNT_SHIFT                     0                                      /**< Shift value for SDIO_TUNINGCNT */
#define _SDIO_CFG0_TUNINGCNT_MASK                      0x3FUL                                 /**< Bit mask for SDIO_TUNINGCNT */
#define _SDIO_CFG0_TUNINGCNT_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG0 */
#define SDIO_CFG0_TUNINGCNT_DEFAULT                    (_SDIO_CFG0_TUNINGCNT_DEFAULT << 0)    /**< Shifted mode DEFAULT for SDIO_CFG0 */
#define _SDIO_CFG0_TOUTCLKFREQ_SHIFT                   6                                      /**< Shift value for SDIO_TOUTCLKFREQ */
#define _SDIO_CFG0_TOUTCLKFREQ_MASK                    0xFC0UL                                /**< Bit mask for SDIO_TOUTCLKFREQ */
#define _SDIO_CFG0_TOUTCLKFREQ_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG0 */
#define SDIO_CFG0_TOUTCLKFREQ_DEFAULT                  (_SDIO_CFG0_TOUTCLKFREQ_DEFAULT << 6)  /**< Shifted mode DEFAULT for SDIO_CFG0 */
#define SDIO_CFG0_TOUTCLKUNIT                          (0x1UL << 12)                          /**< Timeout Clock Unit in kHz or MHz */
#define _SDIO_CFG0_TOUTCLKUNIT_SHIFT                   12                                     /**< Shift value for SDIO_TOUTCLKUNIT */
#define _SDIO_CFG0_TOUTCLKUNIT_MASK                    0x1000UL                               /**< Bit mask for SDIO_TOUTCLKUNIT */
#define _SDIO_CFG0_TOUTCLKUNIT_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG0 */
#define SDIO_CFG0_TOUTCLKUNIT_DEFAULT                  (_SDIO_CFG0_TOUTCLKUNIT_DEFAULT << 12) /**< Shifted mode DEFAULT for SDIO_CFG0 */
#define _SDIO_CFG0_BASECLKFREQ_SHIFT                   13                                     /**< Shift value for SDIO_BASECLKFREQ */
#define _SDIO_CFG0_BASECLKFREQ_MASK                    0x1FE000UL                             /**< Bit mask for SDIO_BASECLKFREQ */
#define _SDIO_CFG0_BASECLKFREQ_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG0 */
#define SDIO_CFG0_BASECLKFREQ_DEFAULT                  (_SDIO_CFG0_BASECLKFREQ_DEFAULT << 13) /**< Shifted mode DEFAULT for SDIO_CFG0 */
#define _SDIO_CFG0_MAXBLKLEN_SHIFT                     21                                     /**< Shift value for SDIO_MAXBLKLEN */
#define _SDIO_CFG0_MAXBLKLEN_MASK                      0x600000UL                             /**< Bit mask for SDIO_MAXBLKLEN */
#define _SDIO_CFG0_MAXBLKLEN_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG0 */
#define _SDIO_CFG0_MAXBLKLEN_512B                      0x00000000UL                           /**< Mode 512B for SDIO_CFG0 */
#define _SDIO_CFG0_MAXBLKLEN_1024B                     0x00000001UL                           /**< Mode 1024B for SDIO_CFG0 */
#define _SDIO_CFG0_MAXBLKLEN_2048B                     0x00000002UL                           /**< Mode 2048B for SDIO_CFG0 */
#define SDIO_CFG0_MAXBLKLEN_DEFAULT                    (_SDIO_CFG0_MAXBLKLEN_DEFAULT << 21)   /**< Shifted mode DEFAULT for SDIO_CFG0 */
#define SDIO_CFG0_MAXBLKLEN_512B                       (_SDIO_CFG0_MAXBLKLEN_512B << 21)      /**< Shifted mode 512B for SDIO_CFG0 */
#define SDIO_CFG0_MAXBLKLEN_1024B                      (_SDIO_CFG0_MAXBLKLEN_1024B << 21)     /**< Shifted mode 1024B for SDIO_CFG0 */
#define SDIO_CFG0_MAXBLKLEN_2048B                      (_SDIO_CFG0_MAXBLKLEN_2048B << 21)     /**< Shifted mode 2048B for SDIO_CFG0 */
#define SDIO_CFG0_C8BITSUP                             (0x1UL << 23)                          /**< 8-bit Interface Support */
#define _SDIO_CFG0_C8BITSUP_SHIFT                      23                                     /**< Shift value for SDIO_C8BITSUP */
#define _SDIO_CFG0_C8BITSUP_MASK                       0x800000UL                             /**< Bit mask for SDIO_C8BITSUP */
#define _SDIO_CFG0_C8BITSUP_DEFAULT                    0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG0 */
#define SDIO_CFG0_C8BITSUP_DEFAULT                     (_SDIO_CFG0_C8BITSUP_DEFAULT << 23)    /**< Shifted mode DEFAULT for SDIO_CFG0 */
#define SDIO_CFG0_CADMA2SUP                            (0x1UL << 24)                          /**< ADMA2 Mode Support */
#define _SDIO_CFG0_CADMA2SUP_SHIFT                     24                                     /**< Shift value for SDIO_CADMA2SUP */
#define _SDIO_CFG0_CADMA2SUP_MASK                      0x1000000UL                            /**< Bit mask for SDIO_CADMA2SUP */
#define _SDIO_CFG0_CADMA2SUP_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG0 */
#define SDIO_CFG0_CADMA2SUP_DEFAULT                    (_SDIO_CFG0_CADMA2SUP_DEFAULT << 24)   /**< Shifted mode DEFAULT for SDIO_CFG0 */
#define SDIO_CFG0_CHSSUP                               (0x1UL << 25)                          /**< High Speed Mode Support */
#define _SDIO_CFG0_CHSSUP_SHIFT                        25                                     /**< Shift value for SDIO_CHSSUP */
#define _SDIO_CFG0_CHSSUP_MASK                         0x2000000UL                            /**< Bit mask for SDIO_CHSSUP */
#define _SDIO_CFG0_CHSSUP_DEFAULT                      0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG0 */
#define SDIO_CFG0_CHSSUP_DEFAULT                       (_SDIO_CFG0_CHSSUP_DEFAULT << 25)      /**< Shifted mode DEFAULT for SDIO_CFG0 */
#define SDIO_CFG0_CSDMASUP                             (0x1UL << 26)                          /**< SDMA Mode Support */
#define _SDIO_CFG0_CSDMASUP_SHIFT                      26                                     /**< Shift value for SDIO_CSDMASUP */
#define _SDIO_CFG0_CSDMASUP_MASK                       0x4000000UL                            /**< Bit mask for SDIO_CSDMASUP */
#define _SDIO_CFG0_CSDMASUP_DEFAULT                    0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG0 */
#define SDIO_CFG0_CSDMASUP_DEFAULT                     (_SDIO_CFG0_CSDMASUP_DEFAULT << 26)    /**< Shifted mode DEFAULT for SDIO_CFG0 */
#define SDIO_CFG0_CSUSPRESSUP                          (0x1UL << 27)                          /**< Suspend/Resume Support */
#define _SDIO_CFG0_CSUSPRESSUP_SHIFT                   27                                     /**< Shift value for SDIO_CSUSPRESSUP */
#define _SDIO_CFG0_CSUSPRESSUP_MASK                    0x8000000UL                            /**< Bit mask for SDIO_CSUSPRESSUP */
#define _SDIO_CFG0_CSUSPRESSUP_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG0 */
#define SDIO_CFG0_CSUSPRESSUP_DEFAULT                  (_SDIO_CFG0_CSUSPRESSUP_DEFAULT << 27) /**< Shifted mode DEFAULT for SDIO_CFG0 */
#define SDIO_CFG0_C3P3VSUP                             (0x1UL << 28)                          /**< Core 3P3V Support */
#define _SDIO_CFG0_C3P3VSUP_SHIFT                      28                                     /**< Shift value for SDIO_C3P3VSUP */
#define _SDIO_CFG0_C3P3VSUP_MASK                       0x10000000UL                           /**< Bit mask for SDIO_C3P3VSUP */
#define _SDIO_CFG0_C3P3VSUP_DEFAULT                    0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG0 */
#define SDIO_CFG0_C3P3VSUP_DEFAULT                     (_SDIO_CFG0_C3P3VSUP_DEFAULT << 28)    /**< Shifted mode DEFAULT for SDIO_CFG0 */
#define SDIO_CFG0_C3P0VSUP                             (0x1UL << 29)                          /**< 3P0V Support */
#define _SDIO_CFG0_C3P0VSUP_SHIFT                      29                                     /**< Shift value for SDIO_C3P0VSUP */
#define _SDIO_CFG0_C3P0VSUP_MASK                       0x20000000UL                           /**< Bit mask for SDIO_C3P0VSUP */
#define _SDIO_CFG0_C3P0VSUP_DEFAULT                    0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG0 */
#define SDIO_CFG0_C3P0VSUP_DEFAULT                     (_SDIO_CFG0_C3P0VSUP_DEFAULT << 29)    /**< Shifted mode DEFAULT for SDIO_CFG0 */
#define SDIO_CFG0_C1P8VSUP                             (0x1UL << 30)                          /**< 1P8V Support */
#define _SDIO_CFG0_C1P8VSUP_SHIFT                      30                                     /**< Shift value for SDIO_C1P8VSUP */
#define _SDIO_CFG0_C1P8VSUP_MASK                       0x40000000UL                           /**< Bit mask for SDIO_C1P8VSUP */
#define _SDIO_CFG0_C1P8VSUP_DEFAULT                    0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG0 */
#define SDIO_CFG0_C1P8VSUP_DEFAULT                     (_SDIO_CFG0_C1P8VSUP_DEFAULT << 30)    /**< Shifted mode DEFAULT for SDIO_CFG0 */

/* Bit fields for SDIO CFG1 */
#define _SDIO_CFG1_RESETVALUE                          0x00000000UL                           /**< Default value for SDIO_CFG1 */
#define _SDIO_CFG1_MASK                                0x0005FFFFUL                           /**< Mask for SDIO_CFG1 */
#define SDIO_CFG1_ASYNCINTRSUP                         (0x1UL << 0)                           /**< Asynchronous Interrupt Support */
#define _SDIO_CFG1_ASYNCINTRSUP_SHIFT                  0                                      /**< Shift value for SDIO_ASYNCINTRSUP */
#define _SDIO_CFG1_ASYNCINTRSUP_MASK                   0x1UL                                  /**< Bit mask for SDIO_ASYNCINTRSUP */
#define _SDIO_CFG1_ASYNCINTRSUP_DEFAULT                0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG1 */
#define SDIO_CFG1_ASYNCINTRSUP_DEFAULT                 (_SDIO_CFG1_ASYNCINTRSUP_DEFAULT << 0) /**< Shifted mode DEFAULT for SDIO_CFG1 */
#define _SDIO_CFG1_SLOTTYPE_SHIFT                      1                                      /**< Shift value for SDIO_SLOTTYPE */
#define _SDIO_CFG1_SLOTTYPE_MASK                       0x6UL                                  /**< Bit mask for SDIO_SLOTTYPE */
#define _SDIO_CFG1_SLOTTYPE_DEFAULT                    0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG1 */
#define _SDIO_CFG1_SLOTTYPE_RMSDSLOT                   0x00000000UL                           /**< Mode RMSDSLOT for SDIO_CFG1 */
#define _SDIO_CFG1_SLOTTYPE_EMSDSLOT                   0x00000001UL                           /**< Mode EMSDSLOT for SDIO_CFG1 */
#define _SDIO_CFG1_SLOTTYPE_SHBUSSLOT                  0x00000002UL                           /**< Mode SHBUSSLOT for SDIO_CFG1 */
#define SDIO_CFG1_SLOTTYPE_DEFAULT                     (_SDIO_CFG1_SLOTTYPE_DEFAULT << 1)     /**< Shifted mode DEFAULT for SDIO_CFG1 */
#define SDIO_CFG1_SLOTTYPE_RMSDSLOT                    (_SDIO_CFG1_SLOTTYPE_RMSDSLOT << 1)    /**< Shifted mode RMSDSLOT for SDIO_CFG1 */
#define SDIO_CFG1_SLOTTYPE_EMSDSLOT                    (_SDIO_CFG1_SLOTTYPE_EMSDSLOT << 1)    /**< Shifted mode EMSDSLOT for SDIO_CFG1 */
#define SDIO_CFG1_SLOTTYPE_SHBUSSLOT                   (_SDIO_CFG1_SLOTTYPE_SHBUSSLOT << 1)   /**< Shifted mode SHBUSSLOT for SDIO_CFG1 */
#define SDIO_CFG1_CSDR50SUP                            (0x1UL << 3)                           /**< Core Support SDR50 */
#define _SDIO_CFG1_CSDR50SUP_SHIFT                     3                                      /**< Shift value for SDIO_CSDR50SUP */
#define _SDIO_CFG1_CSDR50SUP_MASK                      0x8UL                                  /**< Bit mask for SDIO_CSDR50SUP */
#define _SDIO_CFG1_CSDR50SUP_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG1 */
#define SDIO_CFG1_CSDR50SUP_DEFAULT                    (_SDIO_CFG1_CSDR50SUP_DEFAULT << 3)    /**< Shifted mode DEFAULT for SDIO_CFG1 */
#define SDIO_CFG1_CSDR104SUP                           (0x1UL << 4)                           /**< Support SDR104 */
#define _SDIO_CFG1_CSDR104SUP_SHIFT                    4                                      /**< Shift value for SDIO_CSDR104SUP */
#define _SDIO_CFG1_CSDR104SUP_MASK                     0x10UL                                 /**< Bit mask for SDIO_CSDR104SUP */
#define _SDIO_CFG1_CSDR104SUP_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG1 */
#define SDIO_CFG1_CSDR104SUP_DEFAULT                   (_SDIO_CFG1_CSDR104SUP_DEFAULT << 4)   /**< Shifted mode DEFAULT for SDIO_CFG1 */
#define SDIO_CFG1_CDDR50SUP                            (0x1UL << 5)                           /**< Support DDR50 */
#define _SDIO_CFG1_CDDR50SUP_SHIFT                     5                                      /**< Shift value for SDIO_CDDR50SUP */
#define _SDIO_CFG1_CDDR50SUP_MASK                      0x20UL                                 /**< Bit mask for SDIO_CDDR50SUP */
#define _SDIO_CFG1_CDDR50SUP_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG1 */
#define SDIO_CFG1_CDDR50SUP_DEFAULT                    (_SDIO_CFG1_CDDR50SUP_DEFAULT << 5)    /**< Shifted mode DEFAULT for SDIO_CFG1 */
#define SDIO_CFG1_CDRVASUP                             (0x1UL << 6)                           /**< Support Type a Driver */
#define _SDIO_CFG1_CDRVASUP_SHIFT                      6                                      /**< Shift value for SDIO_CDRVASUP */
#define _SDIO_CFG1_CDRVASUP_MASK                       0x40UL                                 /**< Bit mask for SDIO_CDRVASUP */
#define _SDIO_CFG1_CDRVASUP_DEFAULT                    0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG1 */
#define SDIO_CFG1_CDRVASUP_DEFAULT                     (_SDIO_CFG1_CDRVASUP_DEFAULT << 6)     /**< Shifted mode DEFAULT for SDIO_CFG1 */
#define SDIO_CFG1_CDRVCSUP                             (0x1UL << 7)                           /**< Support Type C Driver */
#define _SDIO_CFG1_CDRVCSUP_SHIFT                      7                                      /**< Shift value for SDIO_CDRVCSUP */
#define _SDIO_CFG1_CDRVCSUP_MASK                       0x80UL                                 /**< Bit mask for SDIO_CDRVCSUP */
#define _SDIO_CFG1_CDRVCSUP_DEFAULT                    0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG1 */
#define SDIO_CFG1_CDRVCSUP_DEFAULT                     (_SDIO_CFG1_CDRVCSUP_DEFAULT << 7)     /**< Shifted mode DEFAULT for SDIO_CFG1 */
#define SDIO_CFG1_CDRVDSUP                             (0x1UL << 8)                           /**< Support Type D Driver */
#define _SDIO_CFG1_CDRVDSUP_SHIFT                      8                                      /**< Shift value for SDIO_CDRVDSUP */
#define _SDIO_CFG1_CDRVDSUP_MASK                       0x100UL                                /**< Bit mask for SDIO_CDRVDSUP */
#define _SDIO_CFG1_CDRVDSUP_DEFAULT                    0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG1 */
#define SDIO_CFG1_CDRVDSUP_DEFAULT                     (_SDIO_CFG1_CDRVDSUP_DEFAULT << 8)     /**< Shifted mode DEFAULT for SDIO_CFG1 */
#define _SDIO_CFG1_RETUNTMRCTL_SHIFT                   9                                      /**< Shift value for SDIO_RETUNTMRCTL */
#define _SDIO_CFG1_RETUNTMRCTL_MASK                    0x1E00UL                               /**< Bit mask for SDIO_RETUNTMRCTL */
#define _SDIO_CFG1_RETUNTMRCTL_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG1 */
#define SDIO_CFG1_RETUNTMRCTL_DEFAULT                  (_SDIO_CFG1_RETUNTMRCTL_DEFAULT << 9)  /**< Shifted mode DEFAULT for SDIO_CFG1 */
#define SDIO_CFG1_TUNSDR50                             (0x1UL << 13)                          /**< Tuning for SDR50 */
#define _SDIO_CFG1_TUNSDR50_SHIFT                      13                                     /**< Shift value for SDIO_TUNSDR50 */
#define _SDIO_CFG1_TUNSDR50_MASK                       0x2000UL                               /**< Bit mask for SDIO_TUNSDR50 */
#define _SDIO_CFG1_TUNSDR50_DEFAULT                    0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG1 */
#define SDIO_CFG1_TUNSDR50_DEFAULT                     (_SDIO_CFG1_TUNSDR50_DEFAULT << 13)    /**< Shifted mode DEFAULT for SDIO_CFG1 */
#define _SDIO_CFG1_RETUNMODES_SHIFT                    14                                     /**< Shift value for SDIO_RETUNMODES */
#define _SDIO_CFG1_RETUNMODES_MASK                     0xC000UL                               /**< Bit mask for SDIO_RETUNMODES */
#define _SDIO_CFG1_RETUNMODES_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG1 */
#define SDIO_CFG1_RETUNMODES_DEFAULT                   (_SDIO_CFG1_RETUNMODES_DEFAULT << 14)  /**< Shifted mode DEFAULT for SDIO_CFG1 */
#define SDIO_CFG1_SPISUP                               (0x1UL << 16)                          /**< SPI Support */
#define _SDIO_CFG1_SPISUP_SHIFT                        16                                     /**< Shift value for SDIO_SPISUP */
#define _SDIO_CFG1_SPISUP_MASK                         0x10000UL                              /**< Bit mask for SDIO_SPISUP */
#define _SDIO_CFG1_SPISUP_DEFAULT                      0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG1 */
#define SDIO_CFG1_SPISUP_DEFAULT                       (_SDIO_CFG1_SPISUP_DEFAULT << 16)      /**< Shifted mode DEFAULT for SDIO_CFG1 */
#define SDIO_CFG1_ASYNCWKUPEN                          (0x1UL << 18)                          /**< Asynchronous Wakeup Enable */
#define _SDIO_CFG1_ASYNCWKUPEN_SHIFT                   18                                     /**< Shift value for SDIO_ASYNCWKUPEN */
#define _SDIO_CFG1_ASYNCWKUPEN_MASK                    0x40000UL                              /**< Bit mask for SDIO_ASYNCWKUPEN */
#define _SDIO_CFG1_ASYNCWKUPEN_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for SDIO_CFG1 */
#define SDIO_CFG1_ASYNCWKUPEN_DEFAULT                  (_SDIO_CFG1_ASYNCWKUPEN_DEFAULT << 18) /**< Shifted mode DEFAULT for SDIO_CFG1 */

/* Bit fields for SDIO CFGPRESETVAL0 */
#define _SDIO_CFGPRESETVAL0_RESETVALUE                 0x00000000UL                                     /**< Default value for SDIO_CFGPRESETVAL0 */
#define _SDIO_CFGPRESETVAL0_MASK                       0x1FFF1FFFUL                                     /**< Mask for SDIO_CFGPRESETVAL0 */
#define _SDIO_CFGPRESETVAL0_INITSDCLKFREQ_SHIFT        0                                                /**< Shift value for SDIO_INITSDCLKFREQ */
#define _SDIO_CFGPRESETVAL0_INITSDCLKFREQ_MASK         0x3FFUL                                          /**< Bit mask for SDIO_INITSDCLKFREQ */
#define _SDIO_CFGPRESETVAL0_INITSDCLKFREQ_DEFAULT      0x00000000UL                                     /**< Mode DEFAULT for SDIO_CFGPRESETVAL0 */
#define SDIO_CFGPRESETVAL0_INITSDCLKFREQ_DEFAULT       (_SDIO_CFGPRESETVAL0_INITSDCLKFREQ_DEFAULT << 0) /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL0 */
#define SDIO_CFGPRESETVAL0_INITCLKGENEN                (0x1UL << 10)                                    /**< Initial Clock Gen Enable */
#define _SDIO_CFGPRESETVAL0_INITCLKGENEN_SHIFT         10                                               /**< Shift value for SDIO_INITCLKGENEN */
#define _SDIO_CFGPRESETVAL0_INITCLKGENEN_MASK          0x400UL                                          /**< Bit mask for SDIO_INITCLKGENEN */
#define _SDIO_CFGPRESETVAL0_INITCLKGENEN_DEFAULT       0x00000000UL                                     /**< Mode DEFAULT for SDIO_CFGPRESETVAL0 */
#define SDIO_CFGPRESETVAL0_INITCLKGENEN_DEFAULT        (_SDIO_CFGPRESETVAL0_INITCLKGENEN_DEFAULT << 10) /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL0 */
#define _SDIO_CFGPRESETVAL0_INITDRVST_SHIFT            11                                               /**< Shift value for SDIO_INITDRVST */
#define _SDIO_CFGPRESETVAL0_INITDRVST_MASK             0x1800UL                                         /**< Bit mask for SDIO_INITDRVST */
#define _SDIO_CFGPRESETVAL0_INITDRVST_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for SDIO_CFGPRESETVAL0 */
#define SDIO_CFGPRESETVAL0_INITDRVST_DEFAULT           (_SDIO_CFGPRESETVAL0_INITDRVST_DEFAULT << 11)    /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL0 */
#define _SDIO_CFGPRESETVAL0_DSPSDCLKFREQ_SHIFT         16                                               /**< Shift value for SDIO_DSPSDCLKFREQ */
#define _SDIO_CFGPRESETVAL0_DSPSDCLKFREQ_MASK          0x3FF0000UL                                      /**< Bit mask for SDIO_DSPSDCLKFREQ */
#define _SDIO_CFGPRESETVAL0_DSPSDCLKFREQ_DEFAULT       0x00000000UL                                     /**< Mode DEFAULT for SDIO_CFGPRESETVAL0 */
#define SDIO_CFGPRESETVAL0_DSPSDCLKFREQ_DEFAULT        (_SDIO_CFGPRESETVAL0_DSPSDCLKFREQ_DEFAULT << 16) /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL0 */
#define SDIO_CFGPRESETVAL0_DSPCLKGENEN                 (0x1UL << 26)                                    /**< Default Speed Clock Gen Enable */
#define _SDIO_CFGPRESETVAL0_DSPCLKGENEN_SHIFT          26                                               /**< Shift value for SDIO_DSPCLKGENEN */
#define _SDIO_CFGPRESETVAL0_DSPCLKGENEN_MASK           0x4000000UL                                      /**< Bit mask for SDIO_DSPCLKGENEN */
#define _SDIO_CFGPRESETVAL0_DSPCLKGENEN_DEFAULT        0x00000000UL                                     /**< Mode DEFAULT for SDIO_CFGPRESETVAL0 */
#define SDIO_CFGPRESETVAL0_DSPCLKGENEN_DEFAULT         (_SDIO_CFGPRESETVAL0_DSPCLKGENEN_DEFAULT << 26)  /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL0 */
#define _SDIO_CFGPRESETVAL0_DSPDRVST_SHIFT             27                                               /**< Shift value for SDIO_DSPDRVST */
#define _SDIO_CFGPRESETVAL0_DSPDRVST_MASK              0x18000000UL                                     /**< Bit mask for SDIO_DSPDRVST */
#define _SDIO_CFGPRESETVAL0_DSPDRVST_DEFAULT           0x00000000UL                                     /**< Mode DEFAULT for SDIO_CFGPRESETVAL0 */
#define SDIO_CFGPRESETVAL0_DSPDRVST_DEFAULT            (_SDIO_CFGPRESETVAL0_DSPDRVST_DEFAULT << 27)     /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL0 */

