RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_sdio.h
/* Bit fields for SDIO CFGPRESETVAL3 */
#define _SDIO_CFGPRESETVAL3_RESETVALUE                 0x00000000UL                                       /**< Default value for SDIO_CFGPRESETVAL3 */
#define _SDIO_CFGPRESETVAL3_MASK                       0x1FFF1FFFUL                                       /**< Mask for SDIO_CFGPRESETVAL3 */
#define _SDIO_CFGPRESETVAL3_SDR104SDCLKFREQ_SHIFT      0                                                  /**< Shift value for SDIO_SDR104SDCLKFREQ */
#define _SDIO_CFGPRESETVAL3_SDR104SDCLKFREQ_MASK       0x3FFUL                                            /**< Bit mask for SDIO_SDR104SDCLKFREQ */
#define _SDIO_CFGPRESETVAL3_SDR104SDCLKFREQ_DEFAULT    0x00000000UL                                       /**< Mode DEFAULT for SDIO_CFGPRESETVAL3 */
#define SDIO_CFGPRESETVAL3_SDR104SDCLKFREQ_DEFAULT     (_SDIO_CFGPRESETVAL3_SDR104SDCLKFREQ_DEFAULT << 0) /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL3 */
#define SDIO_CFGPRESETVAL3_SDR104CLKGENEN              (0x1UL << 10)                                      /**< SDR104 SD_CLK Gen Enable */
#define _SDIO_CFGPRESETVAL3_SDR104CLKGENEN_SHIFT       10                                                 /**< Shift value for SDIO_SDR104CLKGENEN */
#define _SDIO_CFGPRESETVAL3_SDR104CLKGENEN_MASK        0x400UL                                            /**< Bit mask for SDIO_SDR104CLKGENEN */
#define _SDIO_CFGPRESETVAL3_SDR104CLKGENEN_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for SDIO_CFGPRESETVAL3 */
#define SDIO_CFGPRESETVAL3_SDR104CLKGENEN_DEFAULT      (_SDIO_CFGPRESETVAL3_SDR104CLKGENEN_DEFAULT << 10) /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL3 */
#define _SDIO_CFGPRESETVAL3_SDR104DRVST_SHIFT          11                                                 /**< Shift value for SDIO_SDR104DRVST */
#define _SDIO_CFGPRESETVAL3_SDR104DRVST_MASK           0x1800UL                                           /**< Bit mask for SDIO_SDR104DRVST */
#define _SDIO_CFGPRESETVAL3_SDR104DRVST_DEFAULT        0x00000000UL                                       /**< Mode DEFAULT for SDIO_CFGPRESETVAL3 */
#define SDIO_CFGPRESETVAL3_SDR104DRVST_DEFAULT         (_SDIO_CFGPRESETVAL3_SDR104DRVST_DEFAULT << 11)    /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL3 */
#define _SDIO_CFGPRESETVAL3_DDR50SDCLKFREQ_SHIFT       16                                                 /**< Shift value for SDIO_DDR50SDCLKFREQ */
#define _SDIO_CFGPRESETVAL3_DDR50SDCLKFREQ_MASK        0x3FF0000UL                                        /**< Bit mask for SDIO_DDR50SDCLKFREQ */
#define _SDIO_CFGPRESETVAL3_DDR50SDCLKFREQ_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for SDIO_CFGPRESETVAL3 */
#define SDIO_CFGPRESETVAL3_DDR50SDCLKFREQ_DEFAULT      (_SDIO_CFGPRESETVAL3_DDR50SDCLKFREQ_DEFAULT << 16) /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL3 */
#define SDIO_CFGPRESETVAL3_DDR50CLKGENEN               (0x1UL << 26)                                      /**< DDR50 Speed Clock Gen Enable */
#define _SDIO_CFGPRESETVAL3_DDR50CLKGENEN_SHIFT        26                                                 /**< Shift value for SDIO_DDR50CLKGENEN */
#define _SDIO_CFGPRESETVAL3_DDR50CLKGENEN_MASK         0x4000000UL                                        /**< Bit mask for SDIO_DDR50CLKGENEN */
#define _SDIO_CFGPRESETVAL3_DDR50CLKGENEN_DEFAULT      0x00000000UL                                       /**< Mode DEFAULT for SDIO_CFGPRESETVAL3 */
#define SDIO_CFGPRESETVAL3_DDR50CLKGENEN_DEFAULT       (_SDIO_CFGPRESETVAL3_DDR50CLKGENEN_DEFAULT << 26)  /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL3 */
#define _SDIO_CFGPRESETVAL3_DDR50DRVST_SHIFT           27                                                 /**< Shift value for SDIO_DDR50DRVST */
#define _SDIO_CFGPRESETVAL3_DDR50DRVST_MASK            0x18000000UL                                       /**< Bit mask for SDIO_DDR50DRVST */
#define _SDIO_CFGPRESETVAL3_DDR50DRVST_DEFAULT         0x00000000UL                                       /**< Mode DEFAULT for SDIO_CFGPRESETVAL3 */
#define SDIO_CFGPRESETVAL3_DDR50DRVST_DEFAULT          (_SDIO_CFGPRESETVAL3_DDR50DRVST_DEFAULT << 27)     /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL3 */

/* Bit fields for SDIO ROUTELOC0 */
#define _SDIO_ROUTELOC0_RESETVALUE                     0x00000000UL                           /**< Default value for SDIO_ROUTELOC0 */
#define _SDIO_ROUTELOC0_MASK                           0x01030301UL                           /**< Mask for SDIO_ROUTELOC0 */
#define _SDIO_ROUTELOC0_DATLOC_SHIFT                   0                                      /**< Shift value for SDIO_DATLOC */
#define _SDIO_ROUTELOC0_DATLOC_MASK                    0x1UL                                  /**< Bit mask for SDIO_DATLOC */
#define _SDIO_ROUTELOC0_DATLOC_LOC0                    0x00000000UL                           /**< Mode LOC0 for SDIO_ROUTELOC0 */
#define _SDIO_ROUTELOC0_DATLOC_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for SDIO_ROUTELOC0 */
#define _SDIO_ROUTELOC0_DATLOC_LOC1                    0x00000001UL                           /**< Mode LOC1 for SDIO_ROUTELOC0 */
#define SDIO_ROUTELOC0_DATLOC_LOC0                     (_SDIO_ROUTELOC0_DATLOC_LOC0 << 0)     /**< Shifted mode LOC0 for SDIO_ROUTELOC0 */
#define SDIO_ROUTELOC0_DATLOC_DEFAULT                  (_SDIO_ROUTELOC0_DATLOC_DEFAULT << 0)  /**< Shifted mode DEFAULT for SDIO_ROUTELOC0 */
#define SDIO_ROUTELOC0_DATLOC_LOC1                     (_SDIO_ROUTELOC0_DATLOC_LOC1 << 0)     /**< Shifted mode LOC1 for SDIO_ROUTELOC0 */
#define _SDIO_ROUTELOC0_CDLOC_SHIFT                    8                                      /**< Shift value for SDIO_CDLOC */
#define _SDIO_ROUTELOC0_CDLOC_MASK                     0x300UL                                /**< Bit mask for SDIO_CDLOC */
#define _SDIO_ROUTELOC0_CDLOC_LOC0                     0x00000000UL                           /**< Mode LOC0 for SDIO_ROUTELOC0 */
#define _SDIO_ROUTELOC0_CDLOC_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for SDIO_ROUTELOC0 */
#define _SDIO_ROUTELOC0_CDLOC_LOC1                     0x00000001UL                           /**< Mode LOC1 for SDIO_ROUTELOC0 */
#define _SDIO_ROUTELOC0_CDLOC_LOC2                     0x00000002UL                           /**< Mode LOC2 for SDIO_ROUTELOC0 */
#define _SDIO_ROUTELOC0_CDLOC_LOC3                     0x00000003UL                           /**< Mode LOC3 for SDIO_ROUTELOC0 */
#define SDIO_ROUTELOC0_CDLOC_LOC0                      (_SDIO_ROUTELOC0_CDLOC_LOC0 << 8)      /**< Shifted mode LOC0 for SDIO_ROUTELOC0 */
#define SDIO_ROUTELOC0_CDLOC_DEFAULT                   (_SDIO_ROUTELOC0_CDLOC_DEFAULT << 8)   /**< Shifted mode DEFAULT for SDIO_ROUTELOC0 */
#define SDIO_ROUTELOC0_CDLOC_LOC1                      (_SDIO_ROUTELOC0_CDLOC_LOC1 << 8)      /**< Shifted mode LOC1 for SDIO_ROUTELOC0 */
#define SDIO_ROUTELOC0_CDLOC_LOC2                      (_SDIO_ROUTELOC0_CDLOC_LOC2 << 8)      /**< Shifted mode LOC2 for SDIO_ROUTELOC0 */
#define SDIO_ROUTELOC0_CDLOC_LOC3                      (_SDIO_ROUTELOC0_CDLOC_LOC3 << 8)      /**< Shifted mode LOC3 for SDIO_ROUTELOC0 */
#define _SDIO_ROUTELOC0_WPLOC_SHIFT                    16                                     /**< Shift value for SDIO_WPLOC */
#define _SDIO_ROUTELOC0_WPLOC_MASK                     0x30000UL                              /**< Bit mask for SDIO_WPLOC */
#define _SDIO_ROUTELOC0_WPLOC_LOC0                     0x00000000UL                           /**< Mode LOC0 for SDIO_ROUTELOC0 */
#define _SDIO_ROUTELOC0_WPLOC_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for SDIO_ROUTELOC0 */
#define _SDIO_ROUTELOC0_WPLOC_LOC1                     0x00000001UL                           /**< Mode LOC1 for SDIO_ROUTELOC0 */
#define _SDIO_ROUTELOC0_WPLOC_LOC2                     0x00000002UL                           /**< Mode LOC2 for SDIO_ROUTELOC0 */
#define _SDIO_ROUTELOC0_WPLOC_LOC3                     0x00000003UL                           /**< Mode LOC3 for SDIO_ROUTELOC0 */
#define SDIO_ROUTELOC0_WPLOC_LOC0                      (_SDIO_ROUTELOC0_WPLOC_LOC0 << 16)     /**< Shifted mode LOC0 for SDIO_ROUTELOC0 */
#define SDIO_ROUTELOC0_WPLOC_DEFAULT                   (_SDIO_ROUTELOC0_WPLOC_DEFAULT << 16)  /**< Shifted mode DEFAULT for SDIO_ROUTELOC0 */
#define SDIO_ROUTELOC0_WPLOC_LOC1                      (_SDIO_ROUTELOC0_WPLOC_LOC1 << 16)     /**< Shifted mode LOC1 for SDIO_ROUTELOC0 */
#define SDIO_ROUTELOC0_WPLOC_LOC2                      (_SDIO_ROUTELOC0_WPLOC_LOC2 << 16)     /**< Shifted mode LOC2 for SDIO_ROUTELOC0 */
#define SDIO_ROUTELOC0_WPLOC_LOC3                      (_SDIO_ROUTELOC0_WPLOC_LOC3 << 16)     /**< Shifted mode LOC3 for SDIO_ROUTELOC0 */
#define _SDIO_ROUTELOC0_CLKLOC_SHIFT                   24                                     /**< Shift value for SDIO_CLKLOC */
#define _SDIO_ROUTELOC0_CLKLOC_MASK                    0x1000000UL                            /**< Bit mask for SDIO_CLKLOC */
#define _SDIO_ROUTELOC0_CLKLOC_LOC0                    0x00000000UL                           /**< Mode LOC0 for SDIO_ROUTELOC0 */
#define _SDIO_ROUTELOC0_CLKLOC_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for SDIO_ROUTELOC0 */
#define _SDIO_ROUTELOC0_CLKLOC_LOC1                    0x00000001UL                           /**< Mode LOC1 for SDIO_ROUTELOC0 */
#define SDIO_ROUTELOC0_CLKLOC_LOC0                     (_SDIO_ROUTELOC0_CLKLOC_LOC0 << 24)    /**< Shifted mode LOC0 for SDIO_ROUTELOC0 */
#define SDIO_ROUTELOC0_CLKLOC_DEFAULT                  (_SDIO_ROUTELOC0_CLKLOC_DEFAULT << 24) /**< Shifted mode DEFAULT for SDIO_ROUTELOC0 */
#define SDIO_ROUTELOC0_CLKLOC_LOC1                     (_SDIO_ROUTELOC0_CLKLOC_LOC1 << 24)    /**< Shifted mode LOC1 for SDIO_ROUTELOC0 */

/* Bit fields for SDIO ROUTELOC1 */
#define _SDIO_ROUTELOC1_RESETVALUE                     0x00000000UL                          /**< Default value for SDIO_ROUTELOC1 */
#define _SDIO_ROUTELOC1_MASK                           0x00000001UL                          /**< Mask for SDIO_ROUTELOC1 */
#define _SDIO_ROUTELOC1_CMDLOC_SHIFT                   0                                     /**< Shift value for SDIO_CMDLOC */
#define _SDIO_ROUTELOC1_CMDLOC_MASK                    0x1UL                                 /**< Bit mask for SDIO_CMDLOC */
#define _SDIO_ROUTELOC1_CMDLOC_LOC0                    0x00000000UL                          /**< Mode LOC0 for SDIO_ROUTELOC1 */
#define _SDIO_ROUTELOC1_CMDLOC_DEFAULT                 0x00000000UL                          /**< Mode DEFAULT for SDIO_ROUTELOC1 */
#define _SDIO_ROUTELOC1_CMDLOC_LOC1                    0x00000001UL                          /**< Mode LOC1 for SDIO_ROUTELOC1 */
#define SDIO_ROUTELOC1_CMDLOC_LOC0                     (_SDIO_ROUTELOC1_CMDLOC_LOC0 << 0)    /**< Shifted mode LOC0 for SDIO_ROUTELOC1 */
#define SDIO_ROUTELOC1_CMDLOC_DEFAULT                  (_SDIO_ROUTELOC1_CMDLOC_DEFAULT << 0) /**< Shifted mode DEFAULT for SDIO_ROUTELOC1 */
#define SDIO_ROUTELOC1_CMDLOC_LOC1                     (_SDIO_ROUTELOC1_CMDLOC_LOC1 << 0)    /**< Shifted mode LOC1 for SDIO_ROUTELOC1 */

