RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_sdio.h
/* Bit fields for SDIO ROUTEPEN */
#define _SDIO_ROUTEPEN_RESETVALUE                      0x00000000UL                         /**< Default value for SDIO_ROUTEPEN */
#define _SDIO_ROUTEPEN_MASK                            0x000003FFUL                         /**< Mask for SDIO_ROUTEPEN */
#define SDIO_ROUTEPEN_CLKPEN                           (0x1UL << 0)                         /**< CLK I/O Enable */
#define _SDIO_ROUTEPEN_CLKPEN_SHIFT                    0                                    /**< Shift value for SDIO_CLKPEN */
#define _SDIO_ROUTEPEN_CLKPEN_MASK                     0x1UL                                /**< Bit mask for SDIO_CLKPEN */
#define _SDIO_ROUTEPEN_CLKPEN_DEFAULT                  0x00000000UL                         /**< Mode DEFAULT for SDIO_ROUTEPEN */
#define SDIO_ROUTEPEN_CLKPEN_DEFAULT                   (_SDIO_ROUTEPEN_CLKPEN_DEFAULT << 0) /**< Shifted mode DEFAULT for SDIO_ROUTEPEN */
#define SDIO_ROUTEPEN_CMDPEN                           (0x1UL << 1)                         /**< CMD I/O Enable */
#define _SDIO_ROUTEPEN_CMDPEN_SHIFT                    1                                    /**< Shift value for SDIO_CMDPEN */
#define _SDIO_ROUTEPEN_CMDPEN_MASK                     0x2UL                                /**< Bit mask for SDIO_CMDPEN */
#define _SDIO_ROUTEPEN_CMDPEN_DEFAULT                  0x00000000UL                         /**< Mode DEFAULT for SDIO_ROUTEPEN */
#define SDIO_ROUTEPEN_CMDPEN_DEFAULT                   (_SDIO_ROUTEPEN_CMDPEN_DEFAULT << 1) /**< Shifted mode DEFAULT for SDIO_ROUTEPEN */
#define SDIO_ROUTEPEN_D0PEN                            (0x1UL << 2)                         /**< Dat0 I/O Enable */
#define _SDIO_ROUTEPEN_D0PEN_SHIFT                     2                                    /**< Shift value for SDIO_D0PEN */
#define _SDIO_ROUTEPEN_D0PEN_MASK                      0x4UL                                /**< Bit mask for SDIO_D0PEN */
#define _SDIO_ROUTEPEN_D0PEN_DEFAULT                   0x00000000UL                         /**< Mode DEFAULT for SDIO_ROUTEPEN */
#define SDIO_ROUTEPEN_D0PEN_DEFAULT                    (_SDIO_ROUTEPEN_D0PEN_DEFAULT << 2)  /**< Shifted mode DEFAULT for SDIO_ROUTEPEN */
#define SDIO_ROUTEPEN_D1PEN                            (0x1UL << 3)                         /**< Dat1 I/O Enable */
#define _SDIO_ROUTEPEN_D1PEN_SHIFT                     3                                    /**< Shift value for SDIO_D1PEN */
#define _SDIO_ROUTEPEN_D1PEN_MASK                      0x8UL                                /**< Bit mask for SDIO_D1PEN */
#define _SDIO_ROUTEPEN_D1PEN_DEFAULT                   0x00000000UL                         /**< Mode DEFAULT for SDIO_ROUTEPEN */
#define SDIO_ROUTEPEN_D1PEN_DEFAULT                    (_SDIO_ROUTEPEN_D1PEN_DEFAULT << 3)  /**< Shifted mode DEFAULT for SDIO_ROUTEPEN */
#define SDIO_ROUTEPEN_D2PEN                            (0x1UL << 4)                         /**< Dat2 I/O Enable */
#define _SDIO_ROUTEPEN_D2PEN_SHIFT                     4                                    /**< Shift value for SDIO_D2PEN */
#define _SDIO_ROUTEPEN_D2PEN_MASK                      0x10UL                               /**< Bit mask for SDIO_D2PEN */
#define _SDIO_ROUTEPEN_D2PEN_DEFAULT                   0x00000000UL                         /**< Mode DEFAULT for SDIO_ROUTEPEN */
#define SDIO_ROUTEPEN_D2PEN_DEFAULT                    (_SDIO_ROUTEPEN_D2PEN_DEFAULT << 4)  /**< Shifted mode DEFAULT for SDIO_ROUTEPEN */
#define SDIO_ROUTEPEN_D3PEN                            (0x1UL << 5)                         /**< Dat3 I/O Enable */
#define _SDIO_ROUTEPEN_D3PEN_SHIFT                     5                                    /**< Shift value for SDIO_D3PEN */
#define _SDIO_ROUTEPEN_D3PEN_MASK                      0x20UL                               /**< Bit mask for SDIO_D3PEN */
#define _SDIO_ROUTEPEN_D3PEN_DEFAULT                   0x00000000UL                         /**< Mode DEFAULT for SDIO_ROUTEPEN */
#define SDIO_ROUTEPEN_D3PEN_DEFAULT                    (_SDIO_ROUTEPEN_D3PEN_DEFAULT << 5)  /**< Shifted mode DEFAULT for SDIO_ROUTEPEN */
#define SDIO_ROUTEPEN_D4PEN                            (0x1UL << 6)                         /**< Dat4 I/O Enable */
#define _SDIO_ROUTEPEN_D4PEN_SHIFT                     6                                    /**< Shift value for SDIO_D4PEN */
#define _SDIO_ROUTEPEN_D4PEN_MASK                      0x40UL                               /**< Bit mask for SDIO_D4PEN */
#define _SDIO_ROUTEPEN_D4PEN_DEFAULT                   0x00000000UL                         /**< Mode DEFAULT for SDIO_ROUTEPEN */
#define SDIO_ROUTEPEN_D4PEN_DEFAULT                    (_SDIO_ROUTEPEN_D4PEN_DEFAULT << 6)  /**< Shifted mode DEFAULT for SDIO_ROUTEPEN */
#define SDIO_ROUTEPEN_D5PEN                            (0x1UL << 7)                         /**< Dat5 Enable */
#define _SDIO_ROUTEPEN_D5PEN_SHIFT                     7                                    /**< Shift value for SDIO_D5PEN */
#define _SDIO_ROUTEPEN_D5PEN_MASK                      0x80UL                               /**< Bit mask for SDIO_D5PEN */
#define _SDIO_ROUTEPEN_D5PEN_DEFAULT                   0x00000000UL                         /**< Mode DEFAULT for SDIO_ROUTEPEN */
#define SDIO_ROUTEPEN_D5PEN_DEFAULT                    (_SDIO_ROUTEPEN_D5PEN_DEFAULT << 7)  /**< Shifted mode DEFAULT for SDIO_ROUTEPEN */
#define SDIO_ROUTEPEN_D6PEN                            (0x1UL << 8)                         /**< Dat6 Enable */
#define _SDIO_ROUTEPEN_D6PEN_SHIFT                     8                                    /**< Shift value for SDIO_D6PEN */
#define _SDIO_ROUTEPEN_D6PEN_MASK                      0x100UL                              /**< Bit mask for SDIO_D6PEN */
#define _SDIO_ROUTEPEN_D6PEN_DEFAULT                   0x00000000UL                         /**< Mode DEFAULT for SDIO_ROUTEPEN */
#define SDIO_ROUTEPEN_D6PEN_DEFAULT                    (_SDIO_ROUTEPEN_D6PEN_DEFAULT << 8)  /**< Shifted mode DEFAULT for SDIO_ROUTEPEN */
#define SDIO_ROUTEPEN_D7PEN                            (0x1UL << 9)                         /**< Data7 I/O Enable */
#define _SDIO_ROUTEPEN_D7PEN_SHIFT                     9                                    /**< Shift value for SDIO_D7PEN */
#define _SDIO_ROUTEPEN_D7PEN_MASK                      0x200UL                              /**< Bit mask for SDIO_D7PEN */
#define _SDIO_ROUTEPEN_D7PEN_DEFAULT                   0x00000000UL                         /**< Mode DEFAULT for SDIO_ROUTEPEN */
#define SDIO_ROUTEPEN_D7PEN_DEFAULT                    (_SDIO_ROUTEPEN_D7PEN_DEFAULT << 9)  /**< Shifted mode DEFAULT for SDIO_ROUTEPEN */

/** @} */
/** @} End of group EFM32GG11B_SDIO */
/** @} End of group Parts */
#ifdef __cplusplus
}
#endif

